{
    "AGGH": {
        "text": "Honiara International Airport (IATA: HIR, ICAO: AGGH), formerly known as Henderson Field, is an airport in the province of \nGuadalcanal in the nation of Solomon Islands. It is the primary international airport in the country, the second being Munda \nAirport in Western Province, which serves as its alternate. It is located 8 kilometres (5 miles) from the capital, Honiara. ",
        "source": "https://en.wikipedia.org/wiki/Honiara_International_Airport"
    },
    "AYHK": {
        "text": "Hoskins Airport (IATA: HKN, ICAO: AYHK) is an airport in Hoskins (on the island of New Britain) in Papua \nNew Guinea. The airport serves Kimbe - the capital of West New Britain province. Mount Pago is 16 km from \nthe airport. ",
        "source": "https://en.wikipedia.org/wiki/Hoskins_Airport"
    },
    "AYMO": {
        "text": "Momote Airport (IATA: MAS, ICAO: AYMO) is an airport on Los Negros Island in the Admiralty Islands, Papua New \nGuinea. It also serves Manus Island, which is connected to Los Negros by a bridge. ",
        "source": "https://en.wikipedia.org/wiki/Momote_Airport"
    },
    "AYPY": {
        "text": "Port Moresby International Airport (IATA: POM, ICAO: AYPY), also known as Jacksons International Airport, is an international airport located \neight kilometres (four nautical miles) outside Port Moresby in Papua New Guinea. It is the largest and busiest airport in \nPapua New Guinea, with an estimated 1.4 million passengers using the airport in 2015, and is the main hub for \nAir Niugini, the national airline of Papua New Guinea. The airport serves as the main hub for PNG Air and \nTravel Air. ",
        "source": "https://en.wikipedia.org/wiki/Port_Moresby_International_Airport"
    },
    "BIKF": {
        "text": "Keflavík Airport (Icelandic: Keflavíkurflugvöllur [ˈcʰɛplaˌviːkʏrˌflʏɣˌvœtlʏr̥]) (IATA: KEF, ICAO: BIKF), also known as Reykjavík–Keflavík Airport, is the largest airport in \nIceland and the country's main hub for international transportation. The airport is 1.7 nautical miles (3.1 kilometres) west of Keflavík \nand 50 km (30 mi) southwest of Reykjavík. The airport has three runways, two of which are in use, and \nthe airport area is about 25 km2 (10 sq mi). ",
        "source": "https://en.wikipedia.org/wiki/Keflav%C3%ADk_International_Airport"
    },
    "CYEG": {
        "text": "Edmonton International Airport (IATA: YEG, ICAO: CYEG), officially branded YEG Edmonton International Airport since 2022, is the primary air \npassenger and air cargo facility in the Edmonton Metropolitan Region of the Canadian province of Alberta. Designated as an international \nairport by Transport Canada and operated by Edmonton Airports, it is located 14 nautical miles (26 km; 16 mi) south \nsouthwest of Downtown Edmonton in Leduc County on Highway 2 opposite of the city of Leduc. The airport offers scheduled \nnon-stop flights to major cities in Canada, the United States, Mexico, the Caribbean, Central America and Europe. ",
        "source": "https://en.wikipedia.org/wiki/Edmonton_International_Airport"
    },
    "CYHZ": {
        "text": "Halifax Stanfield International Airport (IATA: YHZ, ICAO: CYHZ) is a Canadian airport in Goffs, Nova Scotia, a rural community \nof the Halifax Regional Municipality. It serves the Halifax region, mainland Nova Scotia, and adjacent areas in the neighbouring Maritime \nprovinces. The airport is named in honour of Robert Stanfield, the 17th Premier of Nova Scotia and former leader of \nthe federal Progressive Conservative Party of Canada. ",
        "source": "https://en.wikipedia.org/wiki/Halifax_Stanfield_International_Airport"
    },
    "CYOW": {
        "text": "Ottawa/Macdonald–Cartier International Airport (French: Aéroport international Macdonald-Cartier d'Ottawa) (IATA: YOW, ICAO: CYOW) is the main international airport serving Ottawa, \nOntario, Canada, and its metropolitan area as well as Gatineau, Quebec known as the National Capital Region. It is named \nafter the Canadian statesmen and two of the \"founding fathers of Canada\", Sir John A. Macdonald and Sir George-Étienne Cartier. ",
        "source": "https://en.wikipedia.org/wiki/Ottawa_Macdonald%E2%80%93Cartier_International_Airport"
    },
    "CYQB": {
        "text": "Québec City Jean Lesage International Airport, also known as Jean Lesage International Airport (French: Aéroport international Jean-Lesage de Québec, \nor Aéroport de Québec) (IATA: YQB, ICAO: CYQB), is the primary airport serving Quebec City, Canada. Designated as an international \nairport by Transport Canada, it is located eleven kilometres (six nautical miles) west-southwest of the city. In 2023, it was \nthe 12th-busiest airport in Canada, with 1,688,736 passengers. ",
        "source": "https://en.wikipedia.org/wiki/Qu%C3%A9bec_City_Jean_Lesage_International_Airport"
    },
    "CYUL": {
        "text": "Montréal–Trudeau International Airport (IATA: YUL, ICAO: CYUL) (French: Aéroport International Montréal-Trudeau) or Montréal–Trudeau, formerly known and still commonly referred \nto as Montréal–Dorval International Airport (Aéroport international Montréal-Dorval), is an international airport in Dorval, Quebec, Canada. It is the only \nTransport Canada designated international airport serving Montreal and is situated 20 km (12 mi) west of Downtown Montreal. The airport \nterminals are located entirely in the suburb of Dorval, while one runway is located in the Montreal borough of Saint-Laurent. ",
        "source": "https://en.wikipedia.org/wiki/Montr%C3%A9al%E2%80%93Trudeau_International_Airport"
    },
    "CYVR": {
        "text": "Vancouver International Airport (IATA: YVR, ICAO: CYVR) is an international airport located on Sea Island in Richmond, British Columbia, \nserving the city of Vancouver and the Lower Mainland region. It is located 12 km (7.5 mi) from Downtown Vancouver. \nYVR is the second busiest airport in Canada by passenger traffic (24.9 million), behind Toronto Pearson International Airport in Ontario. ",
        "source": "https://en.wikipedia.org/wiki/Vancouver_International_Airport"
    },
    "CYWG": {
        "text": "Winnipeg James Armstrong Richardson International Airport (commonly known as Winnipeg International Airport or Winnipeg Airport) (IATA: YWG, ICAO: CYWG) \nis an international airport located in Winnipeg, Manitoba, Canada. It is the seventh busiest airport in Canada by passenger traffic, \nserving 4,094,793 passengers in 2023, and the 7th busiest airport in Canada by aircraft movements. Winnipeg International Airport is a \nhub for Calm Air, Perimeter Airlines, and cargo airline Cargojet, also serving as a focus city for WestJet and an \noperating base for Flair Airlines. ",
        "source": "https://en.wikipedia.org/wiki/Winnipeg_James_Armstrong_Richardson_International_Airport"
    },
    "CYYC": {
        "text": "Calgary International Airport (IATA: YYC, ICAO: CYYC), branded as YYC Calgary International Airport, is an international airport that serves \nthe city of Calgary, Alberta, Canada. It is located approximately 17 kilometres (11 mi) northeast of downtown and covers an \narea of 20.82 square kilometres (8.04 sq mi; 5,144 acres; 2,082 ha). With 18.5 million passengers in 2023 and 124,108 \naircraft movements in 2021, Calgary International is the busiest airport in Alberta and the fourth-busiest in Canada by passenger traffic. ",
        "source": "https://en.wikipedia.org/wiki/Calgary_International_Airport"
    },
    "CYYT": {
        "text": "St. John's International Airport (IATA: YYT, ICAO: CYYT) is in Newfoundland and Labrador, Canada. It is located 3 nautical \nmiles (5.6 km; 3.5 mi) northwest of St. ",
        "source": "https://en.wikipedia.org/wiki/St._John%27s_International_Airport"
    },
    "CYYZ": {
        "text": "Toronto Pearson International Airport (IATA: YYZ, ICAO: CYYZ; originally Malton Airport, simply Toronto Pearson or Pearson, and officially Lester \nB. Pearson International Airport) is an international airport located in Mississauga, Ontario, Canada. It is the main airport serving Toronto, \nits metropolitan area, and the surrounding region known as the Golden Horseshoe. ",
        "source": "https://en.wikipedia.org/wiki/Toronto_Pearson_International_Airport"
    },
    "DAAG": {
        "text": "Houari Boumediene International Airport (Arabic: مطار هواري بومدين الدولي, romanized: Maṭār Hawwārī Būmadyan al-Duwaliyy) (IATA: ALG, ICAO: DAAG), also \nknown as Algiers Airport or Algiers International Airport, is the main international airport serving Algiers, the capital of Algeria. It \nis located 9.1 NM (16.9 km; 10.5 mi) east southeast of the city. The airport is named after Houari Boumediene \n(1932–1978), a former president of Algeria. ",
        "source": "https://en.wikipedia.org/wiki/Houari_Boumediene_Airport"
    },
    "DGAA": {
        "text": "Kotoka International Airport (IATA: ACC, ICAO: DGAA) is an international airport in Accra, the capital of Ghana. The airport \nis operated by Ghana Airports Company Limited (GACL), which has its offices on the airport property. It is the sole \ninternational airport in Ghana. ",
        "source": "https://en.wikipedia.org/wiki/Kotoka_International_Airport"
    },
    "DNAA": {
        "text": "Nnamdi Azikiwe International Airport (IATA: ABV, ICAO: DNAA) is an international airport serving Abuja, in the Federal Capital Territory \nof Nigeria. It is the main airport serving the Nigerian capital city and was named after Nigeria's first President, Nnamdi \nAzikiwe (1904–1996). The airport is approximately 20 km (12 mi) southwest of the city centre, and has an international and \na domestic terminal that share its single runway. ",
        "source": "https://en.wikipedia.org/wiki/Nnamdi_Azikiwe_International_Airport"
    },
    "DNMM": {
        "text": "Murtala Muhammed International Airport (MMIA) (IATA: LOS, ICAO: DNMM) (Yoruba: Pápá Ọkọ̀ Òfurufú Káríayé Múrítàlá Mùhammẹ̀d) is an international \nairport located in Ikeja, Lagos State, Nigeria, and is the major airport serving the entire state. The airport was initially \nbuilt during World War II and is named after Murtala Muhammed (1938–1976), the fourth military ruler of Nigeria. . ",
        "source": "https://en.wikipedia.org/wiki/Murtala_Muhammed_International_Airport"
    },
    "DRRN": {
        "text": "Diori Hamani International Airport (IATA: NIM, ICAO: DRRN) is an airport in Niamey, the capital of Niger. It is \nlocated 9 km (5.6 mi) from Niamey in the south eastern suburbs of the city, along the Route Nationale 1, \nthe major highway linking Niamey with the east of the nation. The airport complex also includes the major base for \nthe Armed Forces of Niger's \"Armee d'Air\". ",
        "source": "https://en.wikipedia.org/wiki/Diori_Hamani_International_Airport"
    },
    "DTTA": {
        "text": "Tunis–Carthage International Airport, (French: Aéroport de Tunis-Carthage, Arabic: مطار تونس قرطاج الدولي, IATA: TUN, ICAO: DTTA) is the international \nairport of Tunis, the capital of Tunisia. It serves as the home base for Tunisair, Tunisair Express, Nouvelair Tunisia, and \nTunisavia. The airport is named for the historic city of Carthage, located just east of the airport. ",
        "source": "https://en.wikipedia.org/wiki/Tunis%E2%80%93Carthage_International_Airport"
    },
    "EBBR": {
        "text": "Brussels Airport (IATA: BRU, ICAO: EBBR), also informally called Brussels-National Airport or Brussels-Zaventem Airport, is an international airport in \nthe municipality of Zaventem in Flemish Brabant, 6.5 nautical miles (12.0 km; 7.5 mi) northeast of Brussels, Belgium. In 2019, \nmore than 26 million passengers arrived or departed at Brussels Airport, making it the 26th busiest airport in Europe. It \nis home to around 260 companies, together directly employing 20,000 people and serves as the home base for Brussels Airlines \nand TUI fly Belgium. ",
        "source": "https://en.wikipedia.org/wiki/Brussels_Airport"
    },
    "EDDB": {
        "text": "Berlin Brandenburg Airport Willy Brandt (German: Flughafen Berlin Brandenburg „Willy Brandt“, (IATA: BER, ICAO: EDDB), German pronunciation: [beːʔeːˈʔɛɐ̯] ) \nis an international airport in Schönefeld, just south of the German capital and state of Berlin, in the state of \nBrandenburg. Named after the former West Berlin mayor and West German chancellor Willy Brandt, it is located 18 kilometres (11 \nmi) south-east of the city centre and serves as a base for Eurowings, easyJet and Ryanair. It mostly has flights \nto European metropolitan and leisure destinations as well as a number of intercontinental services. ",
        "source": "https://en.wikipedia.org/wiki/Berlin_Brandenburg_Airport"
    },
    "EDDF": {
        "text": "Frankfurt Airport, German: Flughafen Frankfurt Main [ˈfluːkhaːfn̩ ˈfʁaŋkfʊʁt ˈmaɪn] (IATA: FRA, ICAO: EDDF), is Germany's main international airport by \npassenger numbers, located in Frankfurt, Germany's fifth-largest city. In the German Aeronautical Information Publication, its name is Frankfurt Main Airport. \nThe airport is operated by Fraport and serves as the main hub for Lufthansa, including Lufthansa CityLine and Lufthansa Cargo \nas well as Condor and AeroLogic. ",
        "source": "https://en.wikipedia.org/wiki/Frankfurt_Airport"
    },
    "EDDH": {
        "text": "Hamburg Airport (IATA: HAM, ICAO: EDDH), known in German as Flughafen Hamburg, is a major international airport in Hamburg, \nthe second-largest city in Germany. Since November 2016 the airport has been named after the former German chancellor Helmut Schmidt. \nIt is located 8.5 km (5.3 mi) north of the city centre in the Fuhlsbüttel quarter and serves as a \nhub for Eurowings and focus city for Condor. ",
        "source": "https://en.wikipedia.org/wiki/Hamburg_Airport"
    },
    "EDDK": {
        "text": "Cologne Bonn Airport (German: Flughafen Köln/Bonn Konrad Adenauer) (IATA: CGN, ICAO: EDDK) is the international airport of Germany's fourth-largest \ncity Cologne, and also serves Bonn, the former capital of West Germany. With approximately 12.4 million passengers passing through it \nin 2017, it is the seventh-largest passenger airport in Germany and the third-largest in terms of cargo operations. By traffic \nunits, which combines cargo and passengers, the airport is in fifth position in Germany. ",
        "source": "https://en.wikipedia.org/wiki/Cologne_Bonn_Airport"
    },
    "EDDL": {
        "text": "Düsseldorf Airport (IATA: DUS, ICAO: EDDL) (German: Flughafen Düsseldorf, pronounced [ˌfluːkhaːfn̩ ˈdʏsl̩dɔʁf]), known as Düsseldorf International Airport until March \n2013, is an international airport serving Düsseldorf, the capital of the German state of North Rhine-Westphalia. It is about 7 \nkilometres (4.3 mi; 3.8 nmi) north of downtown Düsseldorf and some 20 kilometres (12 mi; 11 nmi) southwest of Essen \nin the Rhine-Ruhr area, Germany's largest metropolitan area. Düsseldorf is the fourth-busiest airport in Germany and handled almost 8 million \npassengers in 2021. ",
        "source": "https://en.wikipedia.org/wiki/D%C3%BCsseldorf_Airport"
    },
    "EDDM": {
        "text": "Find more data about Munich Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/MUC'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/MUC"
    },
    "EDDN": {
        "text": "Nuremberg Airport (IATA: NUE, ICAO: EDDN) is an international airport of the Franconian metropolitan area of Nuremberg and the \nsecond-busiest airport in Bavaria after Munich Airport. The year 2018, with 4.5 million, was the year with the highest passenger \nvolume to date at this airport. It is Germany's 9th busiest airport in 2022. ",
        "source": "https://en.wikipedia.org/wiki/Nuremberg_Airport"
    },
    "EDDP": {
        "text": "Leipzig/Halle Airport (IATA: LEJ, ICAO: EDDP) (German: Flughafen Leipzig/Halle) is an international airport located in Schkeuditz, Saxony, Germany, and \nserves both Leipzig, Saxony, and Halle, Saxony-Anhalt. It is Germany's 14th largest airport by passengers and handled more than 2.61 \nmillion passengers in 2019 mainly with flights to European leisure destinations. In terms of cargo traffic, the airport is the \nfifth-busiest in Europe and the second-busiest in Germany after Frankfurt Airport, having handled 1,238,343 metric tonnes of cargo in 2019. ",
        "source": "https://en.wikipedia.org/wiki/Leipzig/Halle_Airport"
    },
    "EDDS": {
        "text": "Stuttgart Airport (German: Flughafen Stuttgart, formerly Flughafen Stuttgart-Echterdingen) (IATA: STR, ICAO: EDDS) is the international airport of Stuttgart, the \ncapital of the German state of Baden-Württemberg. It is christened in honor of Stuttgart's former mayor, Manfred Rommel, son of \nErwin Rommel, and is the sixth busiest airport in Germany with 11,832,634 passengers having passed through its doors in 2018. \nThe facility covers approximately 400 hectares (1,000 acres), of which 190 hectares are green space. ",
        "source": "https://en.wikipedia.org/wiki/Stuttgart_Airport"
    },
    "EDDV": {
        "text": "Hannover Airport (IATA: HAJ, ICAO: EDDV) is the international airport of Hanover, capital of the German state of Lower \nSaxony. The ninth largest airport in Germany, it is situated on 570 hectares (1,400 acres) in Langenhagen, 11 kilometres (6.8 \nmi) north of the centre of Hanover. The airport has flights to European metropolitan and leisure destinations, and serves as \na base for Eurowings, Corendon Airlines Europe and TUI fly Deutschland. ",
        "source": "https://en.wikipedia.org/wiki/Hannover_Airport"
    },
    "EETN": {
        "text": "Tallinn Airport (Estonian: Tallinna lennujaam, IATA: TLL, ICAO: EETN) or Lennart Meri Tallinn Airport (Estonian: Lennart Meri Tallinna lennujaam) \nis the largest airport in Estonia, which serves as the secondary hub for AirBaltic and the cargo airline Airest. It \nwas also the home base of the now defunct national airline Estonian Air. Tallinn Airport is open to both domestic \nand international flights. ",
        "source": "https://en.wikipedia.org/wiki/Tallinn_Airport"
    },
    "EFHK": {
        "text": "Helsinki-Vantaa Airport (IATA: HEL, ICAO: EFHK), or simply Helsinki Airport, is the main international airport of the city of \nHelsinki, its surrounding metropolitan area, and the Uusimaa region in Finland. The airport is located in the neighbouring city of \nVantaa, about 5 kilometres (3 mi) west of Tikkurila, the administrative centre of Vantaa and 9.2 NM (17.0 km; 10.6 \nmi) north of Helsinki's city centre. The airport is operated by state-owned Finavia. ",
        "source": "https://en.wikipedia.org/wiki/Helsinki_Airport"
    },
    "EGAA": {
        "text": "Belfast International Airport (IATA: BFS, ICAO: EGAA) is an airport 11.5 NM (21.3 km; 13.2 mi) northwest of Belfast \nin Northern Ireland, and is the main airport for the city of Belfast. Until 1983, it was known as Aldergrove \nAirport, after the nearby village of Aldergrove in County Antrim. In 2023, over 5.9 million passengers travelled through the airport, \na 23.6% increase compared with 2022. ",
        "source": "https://en.wikipedia.org/wiki/Belfast_International_Airport"
    },
    "EGBB": {
        "text": "Birmingham Airport (IATA: BHX, ICAO: EGBB), formerly Birmingham International Airport, is an international airport located 7 nautical miles (13 \nkm; 8.1 mi) east-southeast of Birmingham city centre, 9.5 nautical miles (17.6 km; 10.9 mi) west-northwest of Coventry slightly north \nof Bickenhill village, in the Metropolitan Borough of Solihull, England. Officially opened as Elmdon Airport on 8 July 1939, the \nairport was requisitioned by the Air Ministry during the Second World War and used by both the Royal Air Force \n(RAF) and the Royal Navy as RAF Elmdon. It was largely used for flight training and wartime production purposes. ",
        "source": "https://en.wikipedia.org/wiki/Birmingham_Airport"
    },
    "EGCC": {
        "text": "Manchester Airport (IATA: MAN, ICAO: EGCC) is an international airport in Ringway, Manchester, England, 7 miles (11 km) south-west \nof Manchester city centre. In 2022, it was the third busiest airport in the United Kingdom in terms of passengers \n(the busiest outside of London) and the 19th busiest airport in Europe in 2023, with 28.1 million passengers served. The \nairport comprises three passenger terminals and a cargo terminal. ",
        "source": "https://en.wikipedia.org/wiki/Manchester_Airport"
    },
    "EGGW": {
        "text": "London Luton Airport (IATA: LTN, ICAO: EGGW) is an international airport located in Luton, Bedfordshire, England, situated 1.7 miles \n(2.7 km) east of the town centre, and 29 miles (47 km) north of Central London. The airport is owned \nby London Luton Airport Ltd (LLAL), a company wholly owned by Luton Borough Council, and operated by London Luton Airport \nOperations Ltd (LLAOL). An airport was opened on the site on 16 July 1938. ",
        "source": "https://en.wikipedia.org/wiki/Luton_Airport"
    },
    "EGKK": {
        "text": "London Gatwick (), also known as Gatwick Airport (IATA: LGW, ICAO: EGKK), is the secondary international airport serving London, \nEngland, United Kingdom. It is located near Crawley, West Sussex, England 29.5 miles (47.5 km) south of Central London. In \n2022, Gatwick was the second-busiest airport by total passenger traffic in the UK, after Heathrow Airport, and was the 8th-busiest \nin Europe by total passenger traffic. ",
        "source": "https://en.wikipedia.org/wiki/Gatwick_Airport"
    },
    "EGLL": {
        "text": "Heathrow Airport (), called London Airport until 1966 (IATA: LHR, ICAO: EGLL), is the main international airport serving London, \nthe capital of England and the United Kingdom. It is the largest of the six international airports in the London \nairport system (the others being Gatwick, City, Luton, Stansted and Southend). The airport is owned and operated by Heathrow Airport \nHoldings, owned mostly by Qatar Investment Authority, Public Investment Fund and CDPQ. ",
        "source": "https://en.wikipedia.org/wiki/Heathrow_Airport"
    },
    "EGPF": {
        "text": "Glasgow Airport, also known as Glasgow International Airport (IATA: GLA, ICAO: EGPF) (Scottish Gaelic: Port-adhair Eadar-nàiseanta Ghlaschu), formerly Abbotsinch \nAirport, is an international airport in Scotland. It is located in Paisley, Renfrewshire, 8.6 nautical miles (15.9 km; 9.9 mi) \nwest of Glasgow city centre. In 2019, the airport handled 8.84 million passengers, an 8.4% annual decrease, making it the \nsecond-busiest in Scotland, after Edinburgh Airport, and the ninth-busiest airport in the United Kingdom. ",
        "source": "https://en.wikipedia.org/wiki/Glasgow_Airport"
    },
    "EGPH": {
        "text": "Edinburgh Airport (IATA: EDI, ICAO: EGPH) is an international airport located in the Ingliston area of Edinburgh, Scotland. It \nwas the busiest airport in Scotland in 2019, handling over 14.7 million passengers. It was also the sixth-busiest airport in \nthe United Kingdom by total passengers in 2019. ",
        "source": "https://en.wikipedia.org/wiki/Edinburgh_Airport"
    },
    "EGSS": {
        "text": "London Stansted Airport (IATA: STN, ICAO: EGSS) is the tertiary international airport serving London, England. It is located near \nStansted Mountfitchet, Essex, 42 mi (68 km) northeast of Central London. London Stansted serves over 160 destinations across Europe, Asia \nand Africa. ",
        "source": "https://en.wikipedia.org/wiki/London_Stansted_Airport"
    },
    "EHAM": {
        "text": "Amsterdam Airport Schiphol (IATA: AMS, ICAO: EHAM), known informally as Schiphol Airport (Dutch: Luchthaven Schiphol, pronounced [ˌlʏxtɦaːvə(n) ˈsxɪp(ɦ)ɔl; sxɪpˈɦɔl]), \nis the main international airport of the Netherlands, and is one of the major hubs for the SkyTeam airline alliance. \nIt is located 9 kilometres (5.6 mi; 4.9 nmi) southwest of Amsterdam, in the municipality of Haarlemmermeer in the province \nof North Holland. It is the world's third busiest airport by international passenger traffic in 2021. ",
        "source": "https://en.wikipedia.org/wiki/Amsterdam_Airport_Schiphol"
    },
    "EHEH": {
        "text": "Eindhoven Airport (IATA: EIN, ICAO: EHEH) is an international airport located 7.6 km (4.7 mi) west of Eindhoven, Netherlands. \nIn terms of the number of served passengers, it is the second largest airport in the Netherlands, with 6.8 million \npassengers in 2023. The airport is used by both civilian and military traffic. ",
        "source": "https://en.wikipedia.org/wiki/Eindhoven_Airport"
    },
    "EIDW": {
        "text": "Dublin Airport Irish: Aerfort Bhaile Átha Cliath (IATA: DUB, ICAO: EIDW) is an international airport serving Dublin, Ireland. It \nis operated by DAA (formerly Dublin Airport Authority). The airport is located in Collinstown, 7 km (4.3 mi) north of \nDublin, and 3 km (1.9 mi) south of the town of Swords. ",
        "source": "https://en.wikipedia.org/wiki/Dublin_Airport"
    },
    "EINN": {
        "text": "Shannon Airport (Irish: Aerfort na Sionainne) (IATA: SNN, ICAO: EINN) is an international airport located in County Clare in \nIreland. It is adjacent to the Shannon Estuary and lies halfway between Ennis and Limerick. With over 1.5 million passengers \nin 2022, the airport is the third busiest airport in the Republic of Ireland, and the fifth busiest on the \nisland. ",
        "source": "https://en.wikipedia.org/wiki/Shannon_Airport"
    },
    "EKBI": {
        "text": "Billund Airport (Danish: Billund Lufthavn) (IATA: BLL, ICAO: EKBI) is an airport in Denmark. Located 1 nautical mile (1.9 \nkm; 1.2 mi) northeast of Billund, it serves as one of the country's busiest air cargo centres, as well as \na charter airline destination. Most major European airports are connected to Billund via multiple daily scheduled flights. ",
        "source": "https://en.wikipedia.org/wiki/Billund_Airport"
    },
    "EKCH": {
        "text": "Copenhagen Airport, Kastrup (Danish: Københavns Lufthavn, Kastrup, pronounced [kʰøpm̩ˈhɑwns ˈlɔftˌhɑwˀn ˈkʰæˌstʁɔp]; IATA: CPH, ICAO: EKCH) is an international airport \nserving Copenhagen, Denmark, Zealand, the Øresund Region, and southern Sweden including Scania. In 2023 it is the largest airport in \nthe Nordic countries. As the Nordic countries' largest airport, it served 30.3 million passengers in 2019. ",
        "source": "https://en.wikipedia.org/wiki/Copenhagen_Airport"
    },
    "ELLX": {
        "text": "Luxembourg Airport (IATA: LUX, ICAO: ELLX) is the main airport in Luxembourg. Previously called Luxembourg Findel Airport due to \nits location at Findel, it is Luxembourg's only international airport and is the only airport in the country with a \npaved runway. It is located 3.25 NM (6.02 km; 3.74 mi) east of Luxembourg City. ",
        "source": "https://en.wikipedia.org/wiki/Luxembourg_Airport"
    },
    "ENBR": {
        "text": "Bergen Airport (Nynorsk: Bergen lufthamn; IATA: BGO, ICAO: ENBR), alternatively Bergen Flesland Airport or simply Flesland Airport, is an \ninternational airport located at Flesland in the city and municipality of Bergen, Vestland, Norway. Opened in 1955, it is the \nsecond-busiest airport in Norway, with 6,306,623 passenger operations in 2018. Flesland is operated by the state-owned Avinor. ",
        "source": "https://en.wikipedia.org/wiki/Bergen_Airport,_Flesland"
    },
    "ENGM": {
        "text": "Oslo Airport (Norwegian: Oslo lufthavn; IATA: OSL, ICAO: ENGM), alternatively referred to as Oslo Gardermoen Airport or simply Gardermoen, \nis the international airport serving Oslo, Norway, the capital and most populous city in the country. A hub for Norwegian \nAir Shuttle, Scandinavian Airlines and Widerøe, in 2011, it connected to 26 domestic and 158 international destinations. The airport is \nlocated 19 nautical miles (35 km; 22 mi) northeast of Oslo, at Gardermoen at the border of municipalities Nannestad and \nUllensaker, in Akershus county. ",
        "source": "https://en.wikipedia.org/wiki/Oslo_Airport,_Gardermoen"
    },
    "ENTC": {
        "text": "Tromsø Airport (Norwegian: Tromsø lufthavn; IATA: TOS, ICAO: ENTC) is an international airport located at Langnes in the city \nof Tromsø in Tromsø Municipality, Troms county, Norway. Situated on the western shore of the island of Tromsøya, it features \na 2,447-meter (8,028 ft) runway aligned 18/36. Owned and operated by the state-owned Avinor, Langnes handled 1,910,692 passengers, 43,219 aircraft \nmovements and 2,758 tonnes of cargo in 2014. ",
        "source": "https://en.wikipedia.org/wiki/Troms%C3%B8_Airport"
    },
    "ENVA": {
        "text": "Trondheim Airport (Norwegian: Trondheim lufthavn; IATA: TRD, ICAO: ENVA), more commonly known as Værnes, is an international airport serving \nTrondheim, a city and municipality in Trøndelag county, Norway. The airport is located in Værnes, a village in the municipality \nof Stjørdal in Trøndelag county, 10 nautical miles (19 km; 12 mi) east of Trondheim. Operated by the state-owned Avinor, \nit shares facilities with Værnes Air Station of the Royal Norwegian Air Force. ",
        "source": "https://en.wikipedia.org/wiki/Trondheim_Airport"
    },
    "ENZV": {
        "text": "Stavanger Airport (Norwegian: Stavanger lufthavn; IATA: SVG, ICAO: ENZV), commonly just known as Sola, is an international airport located \nin Rogaland county, Norway. The airport is located 6 NM (11 km; 6.9 mi) southwest of the centre of the \ncity of Stavanger inside the neighboring municipality of Sola and it serves the Stavanger, Sola, Sandnes area as well as \nserves as a regional hub for southwest Norway. It is Norway's third-busiest airport, with both fixed-wing aircraft and helicopter traffic \nfor the offshore North Sea oil installations. ",
        "source": "https://en.wikipedia.org/wiki/Stavanger_Airport"
    },
    "EPGD": {
        "text": "Find more data about Gda?sk Lech Wa??sa Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/GDN'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/GDN"
    },
    "EPKK": {
        "text": "Kraków John Paul II International Airport (Polish: Kraków Airport im. Jana Pawła II since 4 September 2007; earlier in \nPolish: Międzynarodowy Port Lotniczy im. Jana Pawła II Kraków–Balice) (IATA: KRK, ICAO: EPKK) is an international airport located near Kraków, \nin the village of Balice, 11 km (6.8 mi) west of the city centre, in southern Poland. ",
        "source": "https://en.wikipedia.org/wiki/Krak%C3%B3w_John_Paul_II_International_Airport"
    },
    "EPWA": {
        "text": "Warsaw Chopin Airport (Polish: Lotnisko Chopina w Warszawie, Polish pronunciation: [lɔtˈɲiskɔ ʂɔˈpɛna]) (IATA: WAW, ICAO: EPWA) is an international \nairport in the Włochy district of Warsaw, Poland. It is the busiest airport in Poland and 32nd busiest airport in \nEurope with 14.4 million passengers in 2022, handling approximately 40% of the country's total air passenger traffic. The airport is \na central hub for LOT Polish Airlines as well as a base for Enter Air and Wizz Air. ",
        "source": "https://en.wikipedia.org/wiki/Warsaw_Chopin_Airport"
    },
    "ESGG": {
        "text": "Göteborg Landvetter Airport (IATA: GOT, ICAO: ESGG) is an international airport serving the Gothenburg (Swedish: Göteborg) region in Sweden. \nWith just over 6.8 million passengers in 2018 it is Sweden's second-largest airport after Stockholm–Arlanda. Landvetter is also an important \nfreight airport. ",
        "source": "https://en.wikipedia.org/wiki/G%C3%B6teborg_Landvetter_Airport"
    },
    "ESSA": {
        "text": "Stockholm Arlanda Airport (IATA: ARN, ICAO: ESSA) is an international airport located in the Sigtuna Municipality of Sweden, near \nthe town of Märsta, 37 kilometres (23 mi) north of Stockholm and nearly 40 kilometres (25 mi) south-east of Uppsala. \nThe airport is located within Stockholm County and the province of Uppland. It is the largest airport in Sweden and \nthe third-largest airport in the Nordic countries. ",
        "source": "https://en.wikipedia.org/wiki/Stockholm_Arlanda_Airport"
    },
    "EVRA": {
        "text": "RIX Riga Airport (Latvian: RIX Rīgas lidosta; IATA: RIX, ICAO: EVRA) is the international airport of Riga, the capital \nof Latvia, and the largest airport in the Baltic states with direct flights to 76 destinations as of November 2019. \nIt serves as a hub for airBaltic, SmartLynx Airlines and RAF-Avia, and as one of the base airports for Ryanair. \nThe Latvian national carrier airBaltic is the largest carrier that serves the airport, followed by Ryanair. ",
        "source": "https://en.wikipedia.org/wiki/Riga_International_Airport"
    },
    "EYVI": {
        "text": "Vilnius International Airport (IATA: VNO, ICAO: EYVI) (Lithuanian: Vilniaus oro uostas) is the airport of Vilnius, the capital of \nLithuania. It is located 5.9 km (3.7 mi) south of the city center. It is the largest of the three \ncommercial airports in Lithuania by passenger traffic, with one runway and 5 million passengers a year. ",
        "source": "https://en.wikipedia.org/wiki/Vilnius_Airport"
    },
    "FACT": {
        "text": "Cape Town International Airport (IATA: CPT, ICAO: FACT) is the primary international airport serving the city of Cape Town, \nand is the second-busiest airport in South Africa and fifth-busiest in Africa. Located approximately 20 kilometres (12 mi) from the \ncity center, the airport was opened in 1954 to replace Cape Town's previous airport, Wingfield Aerodrome. Cape Town International Airport \nis the only airport in the Cape Town metropolitan area that offers scheduled passenger services. ",
        "source": "https://en.wikipedia.org/wiki/Cape_Town_International_Airport"
    },
    "FALE": {
        "text": "King Shaka International Airport (IATA: DUR, ICAO: FALE), abbreviated KSIA, pronounced as (Kīng Shāk(k)ā Internashonāl Ay(ir)port), is the primary \ninternational airport serving Durban, South Africa. It is located in La Mercy, KwaZulu-Natal, approximately 35 km (22 mi) north of \nthe city centre of Durban. The airport opened its doors to passengers on May 1, 2010, 41 days before the \nstart of the 2010 FIFA World Cup. ",
        "source": "https://en.wikipedia.org/wiki/King_Shaka_International_Airport"
    },
    "FAOR": {
        "text": "O. R. Tambo International Airport (IATA: JNB, ICAO: FAOR) is an international airport serving the twin cities of Johannesburg \nand the main capital of South Africa, Pretoria. ",
        "source": "https://en.wikipedia.org/wiki/O._R._Tambo_International_Airport"
    },
    "FBSK": {
        "text": "Sir Seretse Khama International Airport (IATA: GBE, ICAO: FBSK), located 15 kilometres (9 mi) north of downtown Gaborone, is \nthe main international airport of the capital city of Botswana. The airport is named after Sir Seretse Khama, the first \npresident of Botswana. It was opened in 1984 to handle regional and international traffic. ",
        "source": "https://en.wikipedia.org/wiki/Sir_Seretse_Khama_International_Airport"
    },
    "FDSK": {
        "text": "King Mswati III International Airport (IATA: SHO, ICAO: FDSK), initially named Sikhuphe International Airport in the planning and construction \nphase, is an airport in Eswatini. It replaced Matsapha Airport in 2014 as the only international airport in Eswatini that \ncaters to commercial flights. It is designed to handle 360,000 passengers per year. ",
        "source": "https://en.wikipedia.org/wiki/King_Mswati_III_International_Airport"
    },
    "FIMP": {
        "text": "Sir Seewoosagur Ramgoolam International Airport (IATA: MRU, ICAO: FIMP) (French: Aéroport International Sir Seewoosagur Ramgoolam) is the primary international \nairport serving the island nation of Mauritius. It is located at Plaine Magnien, 48 km (30 mi) southeast of the \ncapital city of Port Louis. The airport was previously known as the Plaisance Airport. ",
        "source": "https://en.wikipedia.org/wiki/Sir_Seewoosagur_Ramgoolam_International_Airport"
    },
    "FLLS": {
        "text": "Kenneth Kaunda International Airport (IATA: LUN, ICAO: FLKK) is an international airport located in Chongwe District, off the Great \nEast Road, approximately 27 kilometres (17 mi) northeast of the city centre of Lusaka, the capital and largest city of \nZambia. The airport has a capacity of 6 million and is the largest in Zambia, serving as a hub for \nits region. The airport serves as a hub for Zambia Airways, Proflight Zambia, Royal Zambian Airlines, and Mahogany Air. ",
        "source": "https://en.wikipedia.org/wiki/Kenneth_Kaunda_International_Airport"
    },
    "FMEE": {
        "text": "Roland Garros Airport (French: Aéroport de la Réunion Roland Garros) (IATA: RUN, ICAO: FMEE), formerly known as Gillot Airport, \nis located in Sainte-Marie on Réunion, France. The airport is 7 kilometres (3.8 NM) east of Saint-Denis; it is named \nafter the French aviator Roland Garros, who was born in Saint-Denis. ",
        "source": "https://en.wikipedia.org/wiki/Roland_Garros_Airport"
    },
    "FMMI": {
        "text": "Ivato International Airport (IATA: TNR, ICAO: FMMI) is the main international airport serving Antananarivo, the capital of Madagascar, located \n16 kilometres (9.9 mi) northwest of the city centre. Ivato Airport is the main hub for Air Madagascar and is \nlocated in the commune of Ivato. ",
        "source": "https://en.wikipedia.org/wiki/Ivato_International_Airport"
    },
    "FNLU": {
        "text": "Quatro de Fevereiro International Airport (Portuguese: Aeroporto Internacional 4 de Fevereiro, Swahili: Uwanja wa Ndege wa Kimataifa wa Quatro \nde Fevereiro), (IATA: LAD, ICAO: FNLU) is the main international airport of Angola. It is located in the southern part \nof the capital Luanda, situated in the Luanda Province. Quatro de Fevereiro means 4 February, which is an important national \nholiday in Angola, marking the start of the armed struggle against the Portuguese colonial regime on 4 February 1961. ",
        "source": "https://en.wikipedia.org/wiki/Quatro_de_Fevereiro_Airport"
    },
    "FQMA": {
        "text": "Maputo International Airport (IATA: MPM, ICAO: FQMA), also known as Mavalane International Airport, formerly Lourenço Marques Airport (IATA: LUM), \nis an airport located 3 kilometres (1.9 mi) northwest of the center of Maputo, the largest city and capital of \nMozambique. It is the largest airport in Mozambique, and hub for LAM Mozambique Airlines and Kaya Airlines. Most of the \ndestinations served by the airport are in Africa, but there are a few intercontinental services. ",
        "source": "https://en.wikipedia.org/wiki/Maputo_International_Airport"
    },
    "FSIA": {
        "text": "Seychelles International Airport (IATA: SEZ, ICAO: FSIA), or Aéroport de la Pointe Larue in French, is the international airport \nof the Seychelles located on the island of Mahé near the capital city of Victoria. The airport is the home \nbase and the head office of Air Seychelles and features several regional and long-haul routes due to its importance as \nthe gateway to a major international leisure destination. The airport is 11 kilometres (6.8 mi) southeast of the capital and \nis accessible by the Victoria-Providence Highway. ",
        "source": "https://en.wikipedia.org/wiki/Seychelles_International_Airport"
    },
    "FTTJ": {
        "text": "N'Djamena International Airport (IATA: NDJ, ICAO: FTTJ) (Arabic: مطار انجمينا الدولي; French: Aéroport international de N'Djaména) serves N'Djamena, the \ncapital city of Chad. It is the country's only international airport. The airport is dual use, with civilian and military \ninstallations on opposite sides of the single runway. ",
        "source": "https://en.wikipedia.org/wiki/N%27Djamena_International_Airport"
    },
    "FVHA": {
        "text": "Robert Gabriel Mugabe International Airport (IATA: HRE, ICAO: FVRG, formerly FVHA), (known colloquially as \"RGM\", or Harare Airport) and \nformerly known as Harare International Airport and Salisbury Airport, is an international airport in Harare, Zimbabwe. It is the largest \nairport in the country and serves as the base of Air Zimbabwe, the national flag carrier. It is operated by \nthe Civil Aviation Authority of Zimbabwe. ",
        "source": "https://en.wikipedia.org/wiki/Robert_Gabriel_Mugabe_International_Airport"
    },
    "FYWH": {
        "text": "Hosea Kutako International Airport (also known as HKIA) (IATA: WDH, ICAO: FYWH) is the main international airport of Namibia, \nserving the capital city Windhoek. Located well east of the city, 45 km (28 mi), it is Namibia's largest airport \nwith international connections. From its founding in 1965 to the independence of Namibia in 1990, it was named J. ",
        "source": "https://en.wikipedia.org/wiki/Hosea_Kutako_International_Airport"
    },
    "FZAA": {
        "text": "N'djili Airport (IATA: FIH, ICAO: FZAA) (French: Aéroport de N'djili pronounced [a. e.ʁɔ. pɔʁ də n‿dʒi. ",
        "source": "https://en.wikipedia.org/wiki/N%27djili_Airport"
    },
    "GABS": {
        "text": "Modibo Keita International Airport (IATA: BKO, ICAO: GABS) (formerly Bamako–Sénou International Airport) is Mali's main airport located approximately 15 \nkilometres (9.3 mi) south of downtown Bamako, the capital of Mali in West Africa. It is the country's only international \nairport. It is managed by Aéroports du Mali (ADM). ",
        "source": "https://en.wikipedia.org/wiki/Modibo_Keita_International_Airport"
    },
    "GBYD": {
        "text": "Banjul International Airport, also known as Yundum International (IATA: BJL, ICAO: GBYD), is the international airport of Banjul, capital \nof Gambia, built during World War II. ",
        "source": "https://en.wikipedia.org/wiki/Banjul_International_Airport"
    },
    "GCFV": {
        "text": "Fuerteventura Airport (IATA: FUE, ICAO: GCFV), also known as El Matorral Airport, is an airport serving the Spanish island \nof Fuerteventura. It is situated in El Matorral, 5 km (3 mi) southwest of the capital city Puerto del Rosario. \nThe airport has flight connections to over 80 destinations worldwide, and over 5.6 million passengers passed through it in 2019. ",
        "source": "https://en.wikipedia.org/wiki/Fuerteventura_Airport"
    },
    "GCLP": {
        "text": "Gran Canaria Airport (IATA: LPA, ICAO: GCLP) (Spanish: Aeropuerto de Gran Canaria) is a passenger and freight airport on \nthe island of Gran Canaria. It is an important airport within the Spanish air-transport network (owned and managed by a \npublic enterprise, AENA), as it holds the sixth position in terms of passengers, and fifth in terms of operations and \ncargo transported. It also ranks first of the Canary Islands in all three categories, although the island of Tenerife has \nhigher passenger numbers overall if statistics from the two airports located on the island are combined. ",
        "source": "https://en.wikipedia.org/wiki/Gran_Canaria_Airport"
    },
    "GCRR": {
        "text": "César Manrique-Lanzarote Airport (IATA: ACE, ICAO: GCRR) (Spanish: Aeropuerto de César Manrique-Lanzarote), commonly known as Lanzarote Airport and also \nknown as Arrecife Airport, is the airport serving the island of Lanzarote in the Canary Islands. The airport is located \nin San Bartolomé, Las Palmas, 5 kilometres (3.1 mi) southwest of the island's capital, Arrecife. It handles flights to many \nEuropean airports, with hundreds of thousands of tourists each year, as well as domestic flights to other Spanish airports. ",
        "source": "https://en.wikipedia.org/wiki/Lanzarote_Airport"
    },
    "GCTS": {
        "text": "Tenerife South Airport (Spanish: Aeropuerto de Tenerife Sur) (IATA: TFS, ICAO: GCTS), also known as Tenerife South–Reina Sofía Airport, \nis the larger of the two international airports located on the island of Tenerife (the other being Tenerife North Airport) \nand the second busiest in the Canary Islands (after Gran Canaria Airport). It is located in the municipality of Granadilla \nde Abona and handled over 11 million passengers in 2018. Combined with Tenerife North Airport, the island gathers the highest \npassenger movement of all the Canary Islands, with 12,248,673 passengers, surpassing Gran Canaria Airport. ",
        "source": "https://en.wikipedia.org/wiki/Tenerife_South_Airport"
    },
    "GFLL": {
        "text": "Freetown International Airport (IATA: FNA, ICAO: GFLL) (officially), locally known as Lungi International Airport, is an international airport located \nin the coastal town of Lungi, Sierra Leone. It is the only international airport in Sierra Leone. The Sierra Leone \nRiver separates the airport from Freetown, the nation's capital city. ",
        "source": "https://en.wikipedia.org/wiki/Freetown_International_Airport"
    },
    "GLRB": {
        "text": "Roberts International Airport (IATA: ROB, ICAO: GLRB), informally also known as Robertsfield, is an international airport in the West \nAfrican nation of Liberia. Located near the town of Harbel in Margibi County, the single runway airport is about 35 \nmiles (56 km) outside of the nation's capital of Monrovia, and as an origin and destination point is referred to \nas \"Monrovia\". Locally, it is often referred to as simply \"RIA.\" The airport is named in honor of Joseph Jenkins \nRoberts, the first President of Liberia. ",
        "source": "https://en.wikipedia.org/wiki/Roberts_International_Airport"
    },
    "GMMN": {
        "text": "Mohammed V International Airport IATA: CMN, ICAO: GMMN is an international airport serving Casablanca, Morocco. Located in Nouaceur Province, \nit is operated by ONDA (National Airports Office). With about 7.6 million passengers passing through the airport in 2022, it \nwas the busiest airport in Morocco and in the top 10 of busiest airports in Africa. ",
        "source": "https://en.wikipedia.org/wiki/Mohammed_V_International_Airport"
    },
    "GOBD": {
        "text": "Blaise Diagne International Airport (French: Aéroport international Blaise Diagne, IATA: DSS, ICAO: GOBD) is an international airport near the \ntown of Diass in Thiès Region, Senegal, 43 kilometres (27 mi) east of downtown Dakar. It serves as the main \nairport for Dakar, replacing Léopold Sédar Senghor International Airport, which had become too small. It is named after Blaise Diagne, \nthe first black African elected to France's parliament in 1914. ",
        "source": "https://en.wikipedia.org/wiki/Blaise_Diagne_International_Airport"
    },
    "GQNO": {
        "text": "Nouakchott–Oumtounsy International Airport (IATA: NKC, ICAO: GQNO) (Arabic: مطار نواكشوط الدولي - أم التونسي, French: Aéroport International de Nouakchott-Oumtounsy) \nis an international airport serving Nouakchott, the capital of Mauritania. It is located 25 kilometres (16 mi) north of the \ncity. The airport opened in June 2016 as the replacement for Nouakchott International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Nouakchott%E2%80%93Oumtounsy_International_Airport"
    },
    "GVAC": {
        "text": "Amílcar Cabral International Airport (IATA: SID, ICAO: GVAC), also known as Sal International Airport, is the main international airport \nof Cape Verde. The airport is named after the revolutionary leader Amílcar Cabral. It is located two km west-southwest from \nEspargos on Sal Island. ",
        "source": "https://en.wikipedia.org/wiki/Am%C3%ADlcar_Cabral_International_Airport"
    },
    "HAAB": {
        "text": "Addis Ababa Bole International Airport (IATA: ADD, ICAO: HAAB) is an international airport in Addis Ababa, Ethiopia. It is \nin the Bole district, 6 km (3.7 mi) southeast of the city centre and 65 km (40 mi) north of \nBishoftu. The airport was formerly known as Haile Selassie I International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Addis_Ababa_Bole_International_Airport"
    },
    "HDAM": {
        "text": "Djibouti–Ambouli International Airport (Arabic: مطار جيبوتي الدولي, French: Aéroport international Ambouli) (IATA: JIB, ICAO: HDAM) is a joint civilian/military-use \nairport situated in the town of Ambouli, Djibouti. It serves the national capital, Djibouti. The airport is located approximately 6 \nkilometres (4 miles) from the city centre. ",
        "source": "https://en.wikipedia.org/wiki/Djibouti%E2%80%93Ambouli_International_Airport"
    },
    "HECA": {
        "text": "Cairo International Airport (IATA: CAI, ICAO: HECA) (Arabic: مطار القاهرة الدولي; Maṭār El Qāhira El Dawli) is the principal \ninternational airport of Cairo and the largest and busiest airport in Egypt. It serves as the primary hub for Egyptair \nand Nile Air as well as several other airlines. The airport is located in Heliopolis, to the northeast of Cairo \naround fifteen kilometres (eight nautical miles) from the business area of the city and has an area of approximately 37 \nkm2 (14 sq mi). ",
        "source": "https://en.wikipedia.org/wiki/Cairo_International_Airport"
    },
    "HEGN": {
        "text": "Hurghada International Airport (IATA: HRG, ICAO: HEGN) is the international airport of Hurghada in Egypt. It is located inland, \n5 km (3.1 mi) southwest of El Dahar, the city centre of Hurghada. It is the second busiest airport in \nEgypt after Cairo International Airport and an important destination for leisure flights mainly from Europe. ",
        "source": "https://en.wikipedia.org/wiki/Hurghada_International_Airport"
    },
    "HESH": {
        "text": "Sharm El Sheikh International Airport (Arabic: مطار شرم الشيخ الدولي Maṭār Sharm El Sheikh El Dawli) (IATA: SSH, ICAO: \nHESH) is an international airport located in Sharm El Sheikh, Egypt. It is the third-busiest airport in Egypt after Cairo \nInternational Airport and Hurghada International Airport. The airport was previously known as Ophira International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Sharm_El_Sheikh_International_Airport"
    },
    "HJJJ": {
        "text": "Juba International Airport (IATA: JUB, ICAO: HJJJ) is a multi-use international airport serving Juba, the capital city of South \nSudan. The airport is located 5 km (3.1 mi) northeast of the city's central business district, on the western banks \nof the White Nile. The city and airport are located in South Sudan's Central Equatoria State. ",
        "source": "https://en.wikipedia.org/wiki/Juba_International_Airport"
    },
    "HKJK": {
        "text": "Jomo Kenyatta International Airport (IATA: NBO, ICAO: HKJK) is an international airport serving Nairobi, the capital and largest city \nof Kenya. The other three important international airports in Kenya include Kisumu International Airport, Moi International Airport and Eldoret International \nAirport. JKIA is located in the Embakasi suburb 18 kilometres (11 mi) southeast of Nairobi's central business district, the airport \nhas scheduled flights to destinations in over 50 countries. ",
        "source": "https://en.wikipedia.org/wiki/Jomo_Kenyatta_International_Airport"
    },
    "HKMO": {
        "text": "Moi International Airport (IATA: MBA, ICAO: HKMO) is an international airport in Mombasa, the second-largest city in Kenya. In \n2020, the airport was heralded as the \"Best Airport in Africa\" (with under 2 million passengers annually) by Airports Council \nInternational. ",
        "source": "https://en.wikipedia.org/wiki/Moi_International_Airport"
    },
    "HLLT": {
        "text": "Tripoli International Airport (IATA: TIP, ICAO: HLLT) (Arabic: مطار طرابلس العالمي) is a closed international airport built to serve \nTripoli, the capital city of Libya. The airport is located in the area of Qasr bin Ghashir, 24 kilometres (15 \nmi) from central Tripoli. It used to be the hub for Libyan Airlines, Afriqiyah Airways, and Buraq Air. ",
        "source": "https://en.wikipedia.org/wiki/Tripoli_International_Airport"
    },
    "HRYR": {
        "text": "Kigali International Airport (IATA: KGL, ICAO: HRYR), formerly known as Kanombe International Airport, is the primary international airport serving \nKigali, the capital of Rwanda. Currently, there is an ongoing project to build another mega-airport in Bugesera District, Eastern Province, \nwhich will be the biggest and the main air gateway for all destinations in the country, in addition to serving \nas a transit airport for Goma and Bukavu in the eastern Democratic Republic of the Congo. There are 4 airlines \nbased in Kigali: RwandAir, the flag carrier airline of Rwanda; Akagera Aviation, a Rwandan heli-company; Tempus Jet, an American airline \nproviding charter flights; and Nexus Aero, a Saudi VIP airline. ",
        "source": "https://en.wikipedia.org/wiki/Kigali_International_Airport"
    },
    "HSSK": {
        "text": "Khartoum International Airport (IATA: KRT, ICAO: HSSK) (Arabic: مطار الخرطوم الدولي) is the principal airport in Khartoum, the capital \nof Sudan. The airport has been shut down since it was stormed and occupied on 15 April 2023 during the \nBattle of Khartoum. The current airport is scheduled to be replaced by the New Khartoum International Airport in Omdourman 40 \nkilometres (25 mi) south of the centre of Khartoum. ",
        "source": "https://en.wikipedia.org/wiki/Khartoum_International_Airport"
    },
    "HTDA": {
        "text": "Julius Nyerere International Airport (IATA: DAR, ICAO: HTDA) is the international airport of Dar es Salaam, the largest city \nin Tanzania. It is located in Kipawa ward of Ilala District in Dar es Salaam Region of Tanzania. The airport \nhas flights to destinations in Africa, Asia, Europe, and the Middle East. ",
        "source": "https://en.wikipedia.org/wiki/Julius_Nyerere_International_Airport"
    },
    "HTZA": {
        "text": "Abeid Amani Karume International Airport (Swahili: Uwanja wa Ndege wa Kimataifa wa Abeid Amani Karume, IATA: ZNZ, ICAO: HTZA) \nis the main airport in the Zanzibar Archipelago located on Unguja Island, Zanzibar, Tanzania. It is approximately 5 kilometres (3.1 \nmi) south of Zanzibar City, the capital of Zanzibar, and has flights to East Africa, Europe, and the Middle East. \nIt was previously known as Kisauni Airport and Zanzibar International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Abeid_Amani_Karume_International_Airport"
    },
    "HUEN": {
        "text": "Entebbe International Airport (IATA: EBB, ICAO: HUEN) is the only international airport in Uganda. It is located about 6 \nkilometres (3.7 mi) southwest of the town of Entebbe, on the northern shores of Lake Victoria. This is approximately 40 \nkilometres (25 mi) by road south-west of the central business district of Kampala, the capital city of Uganda. ",
        "source": "https://en.wikipedia.org/wiki/Entebbe_International_Airport"
    },
    "KADW": {
        "text": "Joint Base Andrews (JBA) is a United States military facility located in Prince George's County, Maryland. The facility is \nunder the jurisdiction of the United States Air Force 316th Wing, Air Force District of Washington (AFDW). The base was \nestablished in 2009, when Andrews Air Force Base and Naval Air Facility Washington were merged. ",
        "source": "https://en.wikipedia.org/wiki/Joint_Base_Andrews"
    },
    "KATL": {
        "text": "Hartsfield–Jackson Atlanta International Airport (IATA: ATL, ICAO: KATL, FAA LID: ATL) is the primary international airport serving Atlanta, Georgia, \nUnited States. The airport is located 10 mi (16 km) south of the Downtown Atlanta district. It is named after \nformer Atlanta mayors William B. ",
        "source": "https://en.wikipedia.org/wiki/Hartsfield%E2%80%93Jackson_Atlanta_International_Airport"
    },
    "KAUS": {
        "text": "Austin–Bergstrom International Airport, or ABIA (IATA: AUS, ICAO: KAUS, FAA LID: AUS, formerly BSM), is an international airport in \nAustin, Texas, United States, serving the Greater Austin metropolitan area. Located about 5 miles (8 km; 4 nmi) southeast of \ndowntown Austin, it covers 4,242 acres (1,717 ha) and has two runways and three helipads. The airport lies on the \nsite of what was Bergstrom Air Force Base, named after Captain John August Earl Bergstrom, an officer who was the \nfirst person from Austin to be killed in World War II. ",
        "source": "https://en.wikipedia.org/wiki/Austin%E2%80%93Bergstrom_International_Airport"
    },
    "KBNA": {
        "text": "Nashville International Airport (IATA: BNA, ICAO: KBNA, FAA LID: BNA) is a public/military airport in the southeastern section of \nNashville, Tennessee, United States. Established in 1937, its original name was Berry Field, from which its ICAO and IATA identifiers \nare derived. The current terminal was built in 1987, and the airport took its current name in 1988. ",
        "source": "https://en.wikipedia.org/wiki/Nashville_International_Airport"
    },
    "KBOS": {
        "text": "General Edward Lawrence Logan International Airport (IATA: BOS, ICAO: KBOS, FAA LID: BOS), also known as Boston Logan International \nAirport and commonly as Boston Logan, Logan Airport or simply Logan, is an international airport that is located mostly in \nEast Boston and partially in Winthrop, Massachusetts. It opened in 1923, covers 2,384 acres (965 ha), has six runways and \nfour passenger terminals, and employs an estimated 16,000 people. It is the largest airport in both the Commonwealth of Massachusetts \nand the New England region in terms of passenger volume and cargo handling as well as the busiest airport in \nthe Northeastern United States outside the New York metropolitan area. ",
        "source": "https://en.wikipedia.org/wiki/Logan_International_Airport"
    },
    "KBUF": {
        "text": "Buffalo Niagara International Airport (IATA: BUF, ICAO: KBUF, FAA LID: BUF) is in Cheektowaga, New York, United States. The \nairport serves Buffalo, New York and Niagara Falls, New York United States, and the southern Golden Horseshoe region of Ontario, \nCanada. It is the third-busiest airport in the state of New York and the busiest inside of the Buffalo-Niagara Falls \nmetropolitan area. ",
        "source": "https://en.wikipedia.org/wiki/Buffalo_Niagara_International_Airport"
    },
    "KBWI": {
        "text": "Baltimore/Washington International Thurgood Marshall Airport (IATA: BWI, ICAO: KBWI, FAA LID: BWI) is an international airport in Anne Arundel \nCounty, Maryland, located 9 miles (14 km) south of downtown Baltimore and 30 miles (50 km) northeast of Washington, D. \nC. BWI is one of three major airports, including Dulles International Airport (IAD) and Ronald Reagan Washington National Airport (DCA), \nthat serve the Washington–Baltimore metropolitan area. ",
        "source": "https://en.wikipedia.org/wiki/Baltimore/Washington_International_Airport"
    },
    "KCLE": {
        "text": "Cleveland Hopkins International Airport (IATA: CLE, ICAO: KCLE, FAA LID: CLE) is a city-owned international airport in Cleveland, Ohio, \nUnited States, and is the primary airport serving Greater Cleveland and Northeast Ohio. It the largest and busiest airport in \nthe state, as well as the 43rd-busiest airport in the U. S. ",
        "source": "https://en.wikipedia.org/wiki/Cleveland_Hopkins_International_Airport"
    },
    "KCLT": {
        "text": "Charlotte Douglas International Airport (IATA: CLT, ICAO: KCLT, FAA LID: CLT), typically referred to as Charlotte Douglas, Douglas Airport, \nor simply CLT, is an international airport in Charlotte, North Carolina, United States, located roughly 6 miles (9.7 km) west \nof the city's central business district. Charlotte Douglas is the primary airport for commercial and military use in the Charlotte \nmetropolitan area. Operated by the city of Charlotte's aviation department, the airport covers 5,558 acres (2,249 ha) of land. ",
        "source": "https://en.wikipedia.org/wiki/Charlotte_Douglas_International_Airport"
    },
    "KCMA": {
        "text": "The following is a list of airports in Greater Los Angeles, the second-largest urban region area in the United \nStates, encompassing the five counties in Southern California that surround the city of Los Angeles. The region is served by \nfive airports with commercial air service, which combined, served 114 million passengers in 2019. The region also hosts a major \ncargo airport, four military airfields, and two dozen general aviation airports. ",
        "source": "https://en.wikipedia.org/wiki/List_of_airports_in_the_Los_Angeles_area"
    },
    "KCMH": {
        "text": "John Glenn Columbus International Airport (IATA: CMH, ICAO: KCMH, FAA LID: CMH) is an international airport located 6 miles \n(9.7 km; 5.2 nmi) east of downtown Columbus, Ohio. Formerly known as Port Columbus International Airport, it is managed by \nthe Columbus Regional Airport Authority, which also oversees operations at Rickenbacker International Airport and Bolton Field. The airport code \"CMH\" \nstands for \"Columbus Municipal Hangar,\" the original name of the airport. ",
        "source": "https://en.wikipedia.org/wiki/John_Glenn_Columbus_International_Airport"
    },
    "KCVG": {
        "text": "Cincinnati/Northern Kentucky International Airport (IATA: CVG, ICAO: KCVG, FAA LID: CVG) is a public international airport located in Boone \nCounty, Kentucky, United States, around the community of Hebron. The airport serves the Cincinnati tri-state area. The airport's code, CVG, \nis derived from the nearest city at the time of the airport's opening, Covington, KY. ",
        "source": "https://en.wikipedia.org/wiki/Cincinnati/Northern_Kentucky_International_Airport"
    },
    "KDCA": {
        "text": "Ronald Reagan Washington National Airport (IATA: DCA, ICAO: KDCA, FAA LID: DCA), referred to colloquially as Reagan Airport, Reagan \nNational, its former name National Airport, or simply DCA, is a civil airport in Arlington County, Virginia, across the Potomac \nRiver from Washington, D. C. It is the smaller of two commercial airports owned by the federal government and operated \nby the Metropolitan Washington Airports Authority (MWAA) that serve the Washington, D. ",
        "source": "https://en.wikipedia.org/wiki/Ronald_Reagan_Washington_National_Airport"
    },
    "KDEN": {
        "text": "Denver International Airport (IATA: DEN, ICAO: KDEN, FAA LID: DEN), locally known as DIA, is an international airport in \nthe Western United States, primarily serving metropolitan Denver, Colorado, as well as the greater Front Range Urban Corridor. At 33,531 \nacres (52.4 sq mi; 135.7 km2), it is the largest airport in the Western Hemisphere by land area and the \nsecond largest on Earth, behind King Fahd International Airport. Runway 16R/34L, with a length of 16,000 feet (3.03 mi; 4.88 \nkm), is the longest public use runway in North America and the seventh longest on Earth. ",
        "source": "https://en.wikipedia.org/wiki/Denver_International_Airport"
    },
    "KDFW": {
        "text": "Dallas Fort Worth International Airport (IATA: DFW, ICAO: KDFW, FAA LID: DFW) is the primary international airport serving the \nDallas–Fort Worth metroplex and the North Texas region of the U. S. state of Texas. ",
        "source": "https://en.wikipedia.org/wiki/Dallas_Fort_Worth_International_Airport"
    },
    "KDTW": {
        "text": "Detroit Metropolitan Wayne County Airport (IATA: DTW, ICAO: KDTW, FAA LID: DTW) is the primary international airport serving Detroit \nand its surrounding metropolitan area in Michigan, United States. It is located in the City of Romulus and is Michigan's \nbusiest airport. The Federal Aviation Administration (FAA) National Plan of Integrated Airport Systems for 2017–2021 categorized it as a large \nhub primary commercial service facility. ",
        "source": "https://en.wikipedia.org/wiki/Detroit_Metropolitan_Airport"
    },
    "KEWR": {
        "text": "Newark Liberty International Airport (IATA: EWR, ICAO: KEWR, FAA LID: EWR) is an international airport straddling the boundary between \nthe cities of Newark in Essex County and Elizabeth in Union County, New Jersey, in the United States. Located about \n4.5 miles (7.2 km) south of downtown Newark and 9 miles (14 km) west-southwest of Manhattan in New York City, \nit is a major gateway to points in Europe, South America, Asia, and Oceania. It is jointly owned by the \ncities and leased to its operator, the Port Authority of New York and New Jersey. ",
        "source": "https://en.wikipedia.org/wiki/Newark_Liberty_International_Airport"
    },
    "KFLL": {
        "text": "Fort Lauderdale–Hollywood International Airport (IATA: FLL, ICAO: KFLL, FAA LID: FLL) is a major public airport in Broward County, \nFlorida, United States. It is one of three airports serving the Miami metropolitan area. The airport is off Interstate 595, \nInterstate 95, U. ",
        "source": "https://en.wikipedia.org/wiki/Fort_Lauderdale%E2%80%93Hollywood_International_Airport"
    },
    "KIAD": {
        "text": "Dulles International Airport (IATA: IAD, ICAO: KIAD, FAA LID: IAD) is an international airport in Loudoun County and Fairfax \nCounty in Northern Virginia, United States, 26 miles (42 km) west of downtown Washington, D. C. The airport, which opened \nin 1962, is named after John Foster Dulles, an influential United States Secretary of State during the Cold War and \nwho briefly represented New York in the United States Senate. ",
        "source": "https://en.wikipedia.org/wiki/Dulles_International_Airport"
    },
    "KIAH": {
        "text": "George Bush Intercontinental Airport (IATA: IAH, ICAO: KIAH, FAA LID: IAH) is an international airport in Houston, Texas, United \nStates, serving the Greater Houston metropolitan area. Located about 23 miles (37 km) north of Downtown Houston between Interstate 45 \nand Interstate 69/U. S. ",
        "source": "https://en.wikipedia.org/wiki/George_Bush_Intercontinental_Airport"
    },
    "KIND": {
        "text": "Indianapolis International Airport (IATA: IND, ICAO: KIND, FAA LID: IND) is an international airport located seven miles (11 km) \nsouthwest of downtown Indianapolis in Marion County, Indiana, United States. It is owned and operated by the Indianapolis Airport Authority. \nThe Federal Aviation Administration (FAA) National Plan of Integrated Airport Systems for 2017–2021 categorized it as a medium hub primary \ncommercial service facility. ",
        "source": "https://en.wikipedia.org/wiki/Indianapolis_International_Airport"
    },
    "KJAX": {
        "text": "Jacksonville International Airport (IATA: JAX, ICAO: KJAX, FAA LID: JAX) is a civil-military public airport 13 miles (21 km) \nnorth of Downtown Jacksonville, in Duval County, Florida. It is owned and operated by the Jacksonville Aviation Authority. . ",
        "source": "https://en.wikipedia.org/wiki/Jacksonville_International_Airport"
    },
    "KJFK": {
        "text": "John F. Kennedy International Airport (IATA: JFK, ICAO: KJFK, FAA LID: JFK) is a major international airport serving New \nYork City, New York. The airport is the busiest of the seven airports in the New York airport system, the \n6th-busiest airport in the United States, and the busiest international air passenger gateway into North America. ",
        "source": "https://en.wikipedia.org/wiki/John_F._Kennedy_International_Airport"
    },
    "KLAS": {
        "text": "Harry Reid International Airport (IATA: LAS, ICAO: KLAS, FAA LID: LAS) is an international airport serving the Las Vegas \nValley, a metropolitan area in the U. S. state of Nevada. ",
        "source": "https://en.wikipedia.org/wiki/Harry_Reid_International_Airport"
    },
    "KLAX": {
        "text": "Los Angeles International Airport (IATA: LAX, ICAO: KLAX, FAA LID: LAX) is the primary international airport serving Los Angeles \nand its surrounding metropolitan area in California, United States. LAX is located in the Westchester neighborhood of the city of \nLos Angeles, 18 miles (29 km; 16 nmi) southwest of Downtown Los Angeles, with the commercial and residential areas of \nWestchester to the north, the city of El Segundo to the south and the city of Inglewood to the east. \nLAX is the closest airport to the Westside and the South Bay. ",
        "source": "https://en.wikipedia.org/wiki/Los_Angeles_International_Airport"
    },
    "KLGA": {
        "text": "LaGuardia Airport (IATA: LGA, ICAO: KLGA, FAA LID: LGA) is a civil airport in East Elmhurst, Queens, New York \nCity. Covering 680 acres (280 ha) as of January 1, 2024, the facility was established in 1929 and began operating \nas a public airport in 1939. It is named after former New York City mayor Fiorello La Guardia. ",
        "source": "https://en.wikipedia.org/wiki/LaGuardia_Airport"
    },
    "KMCI": {
        "text": "Kansas City International Airport (IATA: MCI, ICAO: KMCI, FAA LID: MCI) (originally Mid-Continent International Airport) is a public airport \nin Kansas City, Missouri, located 15 miles (24 km) northwest of Downtown Kansas City in Platte County, Missouri. The airport \nwas opened in 1972 and a new complex in the airport was completed in 2023, replacing the old one. MCI \nreplaced Kansas City Municipal Airport (MKC) in 1972, with all scheduled passenger airline flights moved from MKC to MCI. ",
        "source": "https://en.wikipedia.org/wiki/Kansas_City_International_Airport"
    },
    "KMCO": {
        "text": "Orlando International Airport (IATA: MCO, ICAO: KMCO, FAA LID: MCO) is the primary international airport located 6 miles (9.7 \nkm) southeast of Downtown Orlando, Florida. In 2021, it had 19,618,838 enplanements, making it the busiest airport in the state \nand seventh busiest airport in the United States. The airport code MCO stands for the airport's former name, McCoy Air \nForce Base, a Strategic Air Command (SAC) installation, that was closed in 1975 as part of a general military drawdown \nfollowing the end of the Vietnam War. ",
        "source": "https://en.wikipedia.org/wiki/Orlando_International_Airport"
    },
    "KMDW": {
        "text": "Chicago Midway International Airport (IATA: MDW, ICAO: KMDW, FAA LID: MDW), typically referred to as Midway Airport, Chicago Midway, \nor simply Midway, is a major commercial airport on the Southwest side of Chicago, Illinois, located approximately 12 miles (19 \nkm) from the city's Loop business district. Established in 1927, Midway served as Chicago's primary airport until the opening of \nO'Hare International Airport in 1944. Today, Midway is one of the busiest airports in the nation and the second-busiest airport \nboth in the Chicago metropolitan area and the state of Illinois, serving 20,844,860 passengers in 2019. ",
        "source": "https://en.wikipedia.org/wiki/Midway_International_Airport"
    },
    "KMEM": {
        "text": "Memphis International Airport (IATA: MEM, ICAO: KMEM, FAA LID: MEM) is a civil-military airport located seven miles (11 km) \nsoutheast of Downtown Memphis in Shelby County, Tennessee, United States. It is the primary international airport serving Memphis. It covers \n3,900 acres (1,600 ha) and has four runways. ",
        "source": "https://en.wikipedia.org/wiki/Memphis_International_Airport"
    },
    "KMIA": {
        "text": "Miami International Airport (IATA: MIA, ICAO: KMIA, FAA LID: MIA), also known as MIA and historically as Wilcox Field, \nis the primary airport serving the greater Miami metropolitan area with over 1,000 daily flights to 185 domestic and international \ndestinations, including most countries in Latin America. The airport is in an unincorporated area in Miami-Dade County, 8 miles (13 \nkm) west-northwest of Downtown Miami, in metropolitan Miami, adjacent to the cities of Miami and Miami Springs, and the village \nof Virginia Gardens. Nearby cities include Hialeah, Doral, and the Census-designated place of Fontainebleau. ",
        "source": "https://en.wikipedia.org/wiki/Miami_International_Airport"
    },
    "KMKE": {
        "text": "Milwaukee Mitchell International Airport (IATA: MKE, ICAO: KMKE, FAA LID: MKE) is a civil–military airport 5 nautical miles (9.3 \nkm; 5.8 mi) south of downtown Milwaukee, Wisconsin, United States. It is included in the Federal Aviation Administration (FAA) National \nPlan of Integrated Airport Systems for 2023–2027, in which it is categorized as a medium-hub primary commercial service facility. Milwaukee \nMitchell International Airport covers 2,180 acres (880 ha) and has five asphalt and concrete runways. ",
        "source": "https://en.wikipedia.org/wiki/Milwaukee_Mitchell_International_Airport"
    },
    "KMSP": {
        "text": "Minneapolis–Saint Paul International Airport (IATA: MSP, ICAO: KMSP, FAA LID: MSP), also less commonly known as Wold–Chamberlain Field, is \na joint civil-military public-use international airport located in Fort Snelling Unorganized Territory, Minnesota, United States. Although situated within the unorganized \nterritory, the airport is centrally located within 10 miles (16 kilometers; 9 nautical miles) of both downtown Minneapolis and downtown \nSaint Paul. In addition to primarily hosting commercial flights from major American and some international airlines, the airport is also \nhome to several United States Air Force and Minnesota Air National Guard operations. ",
        "source": "https://en.wikipedia.org/wiki/Minneapolis%E2%80%93Saint_Paul_International_Airport"
    },
    "KMSY": {
        "text": "Louis Armstrong New Orleans International Airport (IATA: MSY, ICAO: KMSY, FAA LID: MSY) is an international airport under Class \nB airspace in Kenner city, Jefferson Parish, Louisiana, United States. It is owned by the city of New Orleans and \nis 11 miles (18 km) west of downtown New Orleans. A small portion of Runway 11/29 is in unincorporated St. ",
        "source": "https://en.wikipedia.org/wiki/Louis_Armstrong_New_Orleans_International_Airport"
    },
    "KOAK": {
        "text": "Oakland International Airport (IATA: OAK, ICAO: KOAK, FAA LID: OAK) is an international airport in Oakland, California. The airport \nis located 7 miles (11 km) south of Downtown Oakland and 12 miles (19 km) east of San Francisco, serving \nthe East Bay of the San Francisco Bay Area. The airport is owned by the Port of Oakland and has \ndomestic passenger flights to cities throughout the United States and international flights to Mexico, El Salvador, and the Azores, in \naddition to cargo flights to China and Japan. ",
        "source": "https://en.wikipedia.org/wiki/Oakland_International_Airport"
    },
    "KONT": {
        "text": "Ontario International Airport (IATA: ONT, ICAO: KONT, FAA LID: ONT) is an international airport two miles east of downtown \nOntario, in San Bernardino County, California, United States, about 38 mi (61 km) east of downtown Los Angeles and 18 \nmi (29 km) west of downtown San Bernardino. It is owned and operated under a joint-powers agreement with the city \nof Ontario and San Bernardino County. The airport covers 1,741 acres (705 ha) and has two parallel runways. ",
        "source": "https://en.wikipedia.org/wiki/Ontario_International_Airport"
    },
    "KORD": {
        "text": "Chicago O'Hare International Airport (IATA: ORD, ICAO: KORD, FAA LID: ORD) is a major international airport serving Chicago, Illinois, \nlocated on the city's Northwest Side, approximately 17 miles (27 km) northwest of the Loop business district. Operated by the \nChicago Department of Aviation and covering 7,627 acres (3,087 ha), O'Hare has non-stop flights to 214 destinations in North America, \nSouth America, the Caribbean, Europe, Africa, Asia, the Middle East, Oceania, and the North Atlantic region as of November 2022. \nAs of 2023, O'Hare is considered the world's most connected airport. ",
        "source": "https://en.wikipedia.org/wiki/O%27Hare_International_Airport"
    },
    "KPBI": {
        "text": "Palm Beach International Airport (IATA: PBI, ICAO: KPBI, FAA LID: PBI) is a public airport in Palm Beach County, \nFlorida, located just west of the city of West Palm Beach, Florida, United States, for which it serves as the \nprimary airport. It is also the primary airport for most of Palm Beach County, serving the suburbs and cities of \nWellington, Boynton Beach, Jupiter, and Palm Beach Gardens. It is the third busiest airport in the Miami metropolitan area after \nMiami International Airport and Fort Lauderdale–Hollywood International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Palm_Beach_International_Airport"
    },
    "KPDX": {
        "text": "Portland International Airport (IATA: PDX, ICAO: KPDX, FAA LID: PDX) is a joint civil–military airport and the largest airport \nin the U. S. state of Oregon, accounting for 90% of the state's passenger air travel and more than 95% \nof its air cargo. ",
        "source": "https://en.wikipedia.org/wiki/Portland_International_Airport"
    },
    "KPHL": {
        "text": "Philadelphia International Airport (IATA: PHL, ICAO: KPHL, FAA LID: PHL) is the primary airport serving Philadelphia, Pennsylvania, United States. \nIt served 9.8 million passengers annually in 2021, making it the 21st busiest airport in the United States. The airport \nis located 7 miles (11 km) from the city's downtown area and has 22 airlines that offer nearly 500 daily \ndepartures to more than 130 destinations worldwide. ",
        "source": "https://en.wikipedia.org/wiki/Philadelphia_International_Airport"
    },
    "KPHX": {
        "text": "Phoenix Sky Harbor International Airport (IATA: PHX, ICAO: KPHX, FAA LID: PHX) is a civil–military public airport 3 miles \n(2.6 nmi; 4.8 km) east of downtown Phoenix, in Maricopa County, Arizona, United States. It is Arizona's largest and busiest \nairport; among the largest commercial airports in the United States, PHX was the 8th-busiest airport in the United States and \n22nd-busiest in the world in 2021. The airport serves as a hub for American Airlines and a base for Frontier \nAirlines and Southwest Airlines. ",
        "source": "https://en.wikipedia.org/wiki/Phoenix_Sky_Harbor_International_Airport"
    },
    "KPIT": {
        "text": "Pittsburgh International Airport (IATA: PIT, ICAO: KPIT, FAA LID: PIT), formerly Greater Pittsburgh International Airport, is a civil-military international \nairport in Findlay Township and Moon Township, Pennsylvania, United States. About 10 miles (15 km) west of downtown Pittsburgh, it \nis the primary international airport serving the Greater Pittsburgh Region as well as adjacent areas in West Virginia and Ohio. \nThe airport is owned and operated by the Allegheny County Airport Authority and offers passenger flights to destinations throughout North \nAmerica and Europe. ",
        "source": "https://en.wikipedia.org/wiki/Pittsburgh_International_Airport"
    },
    "KPVD": {
        "text": "Rhode Island T. F. Green International Airport (IATA: PVD, ICAO: KPVD, FAA LID: PVD) is a public international airport \nin Warwick, Rhode Island, United States, 6 miles (5.2 nmi; 9.7 km) south of the state's capital and largest city \nof Providence. ",
        "source": "https://en.wikipedia.org/wiki/Rhode_Island_T._F._Green_International_Airport"
    },
    "KPWM": {
        "text": "Portland International Jetport (IATA: PWM, ICAO: KPWM, FAA LID: PWM) is a public airport two miles (3 km) west \nof downtown Portland, Maine, United States. It is owned and operated by the City of Portland. A portion of the \nJetport's property, including the main runway, is located within the neighboring city of South Portland. ",
        "source": "https://en.wikipedia.org/wiki/Portland_International_Jetport"
    },
    "KRDU": {
        "text": "Raleigh–Durham International Airport (IATA: RDU, ICAO: KRDU, FAA LID: RDU), locally known by its IATA code RDU, is an \ninternational airport that serves Raleigh, Durham, and the surrounding Research Triangle region of North Carolina as its main airport. It \nis located in unincorporated Wake County, but is surrounded by the city of Raleigh to the north and east, and \nthe towns of Cary and Morrisville to the south. The airport covers 5,000 acres (20 km2) and has three runways. ",
        "source": "https://en.wikipedia.org/wiki/Raleigh%E2%80%93Durham_International_Airport"
    },
    "KRIC": {
        "text": "Richmond International Airport (IATA: RIC, ICAO: KRIC, FAA LID: RIC) is a joint civil-military airport in Sandston, Virginia, United \nStates, an unincorporated community (in Henrico County). The airport is about 7 miles (11 km) southeast of downtown Richmond, the \ncapital of the Commonwealth of Virginia. Richmond International Airport is the busiest airport in central Virginia and the third-busiest in \nthe state behind Washington Reagan and Washington Dulles. ",
        "source": "https://en.wikipedia.org/wiki/Richmond_International_Airport"
    },
    "KRNO": {
        "text": "Reno–Tahoe International Airport (IATA: RNO, ICAO: KRNO, FAA LID: RNO) is a public and military airport three miles (4.8 \nkm) southeast of downtown Reno, in Washoe County, Nevada, United States. It is the state's second busiest commercial airport after \nHarry Reid International Airport in Las Vegas. The Nevada Air National Guard has the 152nd Airlift Wing southwest of the \nairport's main terminal. ",
        "source": "https://en.wikipedia.org/wiki/Reno%E2%80%93Tahoe_International_Airport"
    },
    "KRSW": {
        "text": "Southwest Florida International Airport (IATA: RSW, ICAO: KRSW, FAA LID: RSW) is a major county-owned airport in the South \nFort Myers area of unincorporated Lee County, Florida, United States. The airport serves the Southwest Florida region, including the Cape \nCoral-Fort Myers, Naples-Marco Island, and Punta Gorda metropolitan areas, and is a U. S. ",
        "source": "https://en.wikipedia.org/wiki/Southwest_Florida_International_Airport"
    },
    "KSAN": {
        "text": "San Diego International Airport (IATA: SAN, ICAO: KSAN, FAA LID: SAN), formerly known as Lindbergh Field, is an international \nairport three miles (4.8 km; 2.6 nmi) northwest of Downtown San Diego, California, United States. It is owned and operated \nby the San Diego County Regional Airport Authority. The airport covers 663 acres (268 ha) of land and is ranked \nthe third busiest airport in California in terms of passenger traffic. ",
        "source": "https://en.wikipedia.org/wiki/San_Diego_International_Airport"
    },
    "KSAT": {
        "text": "San Antonio International Airport (IATA: SAT, ICAO: KSAT, FAA LID: SAT) is an international airport in San Antonio, Texas, \nUnited States. It is in Uptown Central San Antonio, about 8 miles (13 km) north of Downtown. It has three \nrunways and covers 2,305 acres (933 ha). ",
        "source": "https://en.wikipedia.org/wiki/San_Antonio_International_Airport"
    },
    "KSAV": {
        "text": "Savannah/Hilton Head International Airport (IATA: SAV, ICAO: KSAV, FAA LID: SAV) is a commercial and military-use airport in Savannah, \nGeorgia, United States. Savannah/Hilton Head International provides travelers with access to Savannah, Georgia, and Hilton Head Island, South Carolina, as \nwell as neighboring areas including Bluffton and Beaufort, South Carolina and the Golden Isles region of Coastal Georgia. Owned by \nthe City of Savannah and managed by the Savannah Airport Commission, Savannah/Hilton Head International is located seven nautical miles (8 \nmi, 13 km) northwest of the Savannah Historic District. ",
        "source": "https://en.wikipedia.org/wiki/Savannah/Hilton_Head_International_Airport"
    },
    "KSDF": {
        "text": "Louisville Muhammad Ali International Airport (IATA: SDF, ICAO: KSDF, FAA LID: SDF), formerly known as simply Louisville International Airport, \nis a civil-military airport in Louisville in Jefferson County, Kentucky. The airport covers 1,500 acres (6.1 km2) and has three \nrunways. Its IATA airport code, SDF, is based on the airport's former name, Standiford Field. ",
        "source": "https://en.wikipedia.org/wiki/Louisville_International_Airport"
    },
    "KSEA": {
        "text": "Seattle–Tacoma International Airport (IATA: SEA, ICAO: KSEA, FAA LID: SEA) is the primary international airport serving Seattle and its \nmetropolitan area in the U. S. state of Washington. ",
        "source": "https://en.wikipedia.org/wiki/Seattle%E2%80%93Tacoma_International_Airport"
    },
    "KSFB": {
        "text": "Orlando Sanford International Airport (IATA: SFB, ICAO: KSFB, FAA LID: SFB) is in Sanford, Florida, United States, near Orlando. \nIt was built as Naval Air Station Sanford, a Master Jet Base for carrier-based attack and reconnaissance aircraft, and was \nused by the U. S. ",
        "source": "https://en.wikipedia.org/wiki/Orlando_Sanford_International_Airport"
    },
    "KSFO": {
        "text": "San Francisco International Airport (IATA: SFO, ICAO: KSFO, FAA LID: SFO) is the primary international airport serving the San \nFrancisco Bay Area in California, United States. It is located in San Mateo County. SFO is the largest airport in \nthe San Francisco Bay Area and the second-busiest in California, after Los Angeles International Airport (LAX). ",
        "source": "https://en.wikipedia.org/wiki/San_Francisco_International_Airport"
    },
    "KSJC": {
        "text": "San José Mineta International Airport (IATA: SJC, ICAO: KSJC, FAA LID: SJC), officially Norman Y. Mineta San Jose International \nAirport, is a city-owned public airport in San Jose, California. Located 3 miles (4.8 km) northwest of Downtown San Jose, \nthe airport serves both the city and the Santa Clara Valley region of the greater San Francisco Bay Area. ",
        "source": "https://en.wikipedia.org/wiki/San_Jose_International_Airport"
    },
    "KSLC": {
        "text": "Salt Lake City International Airport (IATA: SLC, ICAO: KSLC, FAA LID: SLC) is a joint military/public airport located about \n4 miles (6.4 km; 3.5 nmi) west of Downtown Salt Lake City, Utah, in the United States. The airport is \nthe closest commercial airport for more than 2.5 million people and is within a 30-minute drive of nearly 1.3 million \njobs. The airport serves as a hub for Delta Air Lines and is a major gateway to the Intermountain West \nand West Coast. ",
        "source": "https://en.wikipedia.org/wiki/Salt_Lake_City_International_Airport"
    },
    "KSMF": {
        "text": "Sacramento International Airport (IATA: SMF, ICAO: KSMF, FAA LID: SMF) is an international airport located in Sacramento, 10.5 miles \n(16.9 km) northwest of Downtown Sacramento in Sacramento County, California, United States and covers 6,000 acres (2,400 ha). It serves \nthe Sacramento Metropolitan Area, and it is run by the Sacramento County Airport System. The airport is also a gateway \nto some attractions and adventures in Northern and Central California such as Heavenly Mountain Resort, Lake Tahoe, Yosemite National Park, \nOld Sacramento State Historic Park history of gold rush, underground tunnels, floods, and fire, etc., California State Capitol, Wine Country, \nYolo Bypass Wildlife Area, Cosumnes River Preserve, Hawver Cave with a lake inside, Sutter's Mill and Marshall Gold Discovery State \nHistoric Park and Sacramento–San Joaquin River Delta. ",
        "source": "https://en.wikipedia.org/wiki/Sacramento_International_Airport"
    },
    "KSTL": {
        "text": "St. Louis Lambert International Airport (IATA: STL, ICAO: KSTL, FAA LID: STL) is the primary commercial airport serving metropolitan \nSt. Louis, Missouri, United States. ",
        "source": "https://en.wikipedia.org/wiki/St._Louis_Lambert_International_Airport"
    },
    "KSYR": {
        "text": "Syracuse Hancock International Airport (IATA: SYR, ICAO: KSYR, FAA LID: SYR) is a joint civil–military airport five miles (8 \nkm) northeast of downtown Syracuse, New York, and 65 miles (100 km) south of Watertown. Operated by the Syracuse Department \nof Aviation, it is located off Interstate 81, near Mattydale. The main terminal complex is at the east end of \nColonel Eileen Collins Boulevard. ",
        "source": "https://en.wikipedia.org/wiki/Syracuse_Hancock_International_Airport"
    },
    "KTPA": {
        "text": "Tampa International Airport (IATA: TPA, ICAO: KTPA, FAA LID: TPA) (known as Drew Field Municipal Airport until 1952) is \nan international airport six miles (9.7 km) west of Downtown Tampa, in Hillsborough County, Florida, United States. The airport is \npublicly owned by Hillsborough County Aviation Authority (HCAA). The airport serves 100 non-stop destinations throughout North America, Central America, the \nCaribbean and Europe across multiple carriers. ",
        "source": "https://en.wikipedia.org/wiki/Tampa_International_Airport"
    },
    "KTUL": {
        "text": "Tulsa International Airport (IATA: TUL, ICAO: KTUL, FAA LID: TUL) is a civil-military airport five miles (8 km) northeast \nof Downtown Tulsa, in Tulsa County, Oklahoma, United States. It was named Tulsa Municipal Airport when the city acquired it \nin 1929; it received its present name in 1963. While Tulsa International Airport only serves domestic destinations, it is still \nan international airport since it has customs and border patrol facilities. ",
        "source": "https://en.wikipedia.org/wiki/Tulsa_International_Airport"
    },
    "LATI": {
        "text": "Tirana International Airport Nënë Tereza (Albanian: Aeroporti Ndërkombëtar i Tiranës Nënë Tereza, IATA: TIA, ICAO: LATI), often referred to \nas the Rinas International Airport, is one of the two main international airports of the Republic of Albania. It serves \nthe city of Tirana, its metropolitan area, and surrounding region in the county of Tirana. The airport is named in \nhonour of the Albanian Roman Catholic nun and missionary, Mother Teresa (1910–1997). ",
        "source": "https://en.wikipedia.org/wiki/Tirana_International_Airport_N%C3%ABn%C3%AB_Tereza"
    },
    "LBBG": {
        "text": "Burgas Airport (IATA: BOJ, ICAO: LBBG) (Bulgarian: Летище Бургас, romanized: Letishte Burgas) is an international airport in southeast Bulgaria \nand the second largest in the country. It is near the northern neighbourhood of Sarafovo approximately 10 km (6.2 mi) \nfrom the city centre. The airport principally serves Burgas and other seaside resorts of the Bulgarian south coast which attract \nmany tourists during the summer leisure season. ",
        "source": "https://en.wikipedia.org/wiki/Burgas_Airport"
    },
    "LBSF": {
        "text": "Sofia Airport (IATA: SOF, ICAO: LBSF) (Bulgarian: Летище София, romanized: Letishte Sofiya) is the main international airport of Bulgaria, \nlocated 10 km (6.2 mi) east of the centre of the capital Sofia. In 2019 the airport surpassed 7 million \npassengers for the first time. The airport serves as the home base for BH Air, Bulgaria Air, European Air Charter \nand GullivAir, and as a base for both Ryanair and Wizz Air. ",
        "source": "https://en.wikipedia.org/wiki/Sofia_Airport"
    },
    "LBWN": {
        "text": "Find more data about Varna Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/VAR'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/VAR"
    },
    "LCLK": {
        "text": "Larnaca International Airport – Glafcos Clerides (IATA: LCA, ICAO: LCLK) is an international airport located 4 km (2.5 mi) \nsouthwest of Larnaca, Cyprus. Larnaca International Airport is Cyprus' main international gateway and the larger of the two commercial airports \nin the area controlled by the Republic of Cyprus, the other being Paphos International Airport on the island's southwestern coast. \nThe airport was given its current name in July 2016, in honour of former President of Cyprus (1993 – 2003) \nGlafcos Clerides. ",
        "source": "https://en.wikipedia.org/wiki/Larnaca_International_Airport"
    },
    "LDZA": {
        "text": "Zagreb Franjo Tuđman Airport (Croatian: Zračna luka Franjo Tuđman Zagreb) or Zagreb Airport (Croatian: Zračna luka Zagreb) (IATA: ZAG, \nICAO: LDZA) is an international airport serving Zagreb, Croatia. It is the largest and busiest airport in Croatia. In 2023 \nit handled 3.72 million passengers and some 10,859 tons of cargo. ",
        "source": "https://en.wikipedia.org/wiki/Zagreb_Airport"
    },
    "LEAL": {
        "text": "Alicante–Elche Miguel Hernández Airport (Spanish: Aeropuerto de Alicante-Elche Miguel Hernández, Valencian: Aeroport d'Alacant-Elx Miguel Hernández), (IATA: ALC, ICAO: LEAL), \nis an international airport located about 9 km (5.6 mi) southwest of the city of Alicante and about 10 kilometres \n(6.2 miles) east of the city of Elche in Spain. Alicante–Elche is the busiest airport in south-eastern Spain and serves \nboth the southern part of the Valencian Community and the Region of Murcia. The airport is a base for Air \nNostrum, Norwegian Air Shuttle, Ryanair and Vueling. ",
        "source": "https://en.wikipedia.org/wiki/Alicante%E2%80%93Elche_Miguel_Hern%C3%A1ndez_Airport"
    },
    "LEBL": {
        "text": "Josep Tarradellas Barcelona–El Prat Airport (IATA: BCN, ICAO: LEBL) (Catalan: Aeroport Josep Tarradellas Barcelona-El Prat, Spanish: Aeropuerto Josep Tarradellas \nBarcelona-El Prat), and also known as Barcelona-El Prat Airport, is an international airport located 15 km (9.3 mi) southwest of \nthe centre of Barcelona, lying in the municipalities of El Prat de Llobregat, Viladecans, and Sant Boi, in Catalonia, Spain. \nIt is the second-largest and second-busiest airport in Spain, the busiest international airport of Catalonia (largely surpassing Girona, Reus and \nLleida), and the sixth busiest in Europe. In 2019, Barcelona Airport handled a record 52,686,314 passengers, up 5.0% from 2018. ",
        "source": "https://en.wikipedia.org/wiki/Josep_Tarradellas_Barcelona%E2%80%93El_Prat_Airport"
    },
    "LEIB": {
        "text": "Ibiza Airport (IATA: IBZ, ICAO: LEIB) (Catalan: Aeroport d'Eivissa, Spanish: Aeropuerto de Ibiza) is the international airport serving the \nBalearic Islands of Ibiza and Formentera in Spain located 7 km (4.3 mi) southwest of Ibiza Town. In 2020, the \nairport handled 2.1 million passengers (after more than 8.2 million in pre COVID-19 conditions in 2019), making it the thirteenth \nbusiest airport in the country. As the island is a major European holiday destination, it features both year-round domestic services \nand several dozen seasonal routes to cities across Europe. ",
        "source": "https://en.wikipedia.org/wiki/Ibiza_Airport"
    },
    "LEMD": {
        "text": "Adolfo Suárez Madrid–Barajas Airport (IATA: MAD, ICAO: LEMD), commonly known as Madrid–Barajas Airport, is the main international airport serving \nMadrid, the capital city of Spain. At 3,050 ha (7,500 acres) in area, it is the second-largest airport in Europe \nby physical size behind Paris Charles de Gaulle Airport. In 2019, 61.8 million passengers travelled through Madrid–Barajas, making it the \ncountry's busiest airport as well as Europe's fifth-busiest. ",
        "source": "https://en.wikipedia.org/wiki/Madrid%E2%80%93Barajas_Airport"
    },
    "LEMG": {
        "text": "Málaga Airport (IATA: AGP, ICAO: LEMG), officially Málaga–Costa del Sol Airport (Spanish: Aeropuerto de Málaga-Costa del Sol) since June \n2011, is the fourth busiest airport in Spain after Madrid–Barajas, Barcelona and Palma de Mallorca. It is significant for Spanish \ntourism as the main international airport serving the Costa del Sol. It is 8 km (5.0 mi) southwest of Málaga \nand 5 km (3.1 mi) north of Torremolinos. ",
        "source": "https://en.wikipedia.org/wiki/M%C3%A1laga_Airport"
    },
    "LEPA": {
        "text": "Palma de Mallorca Airport (Catalan: Aeroport de Palma de Mallorca, Spanish: Aeropuerto de Palma de Mallorca; IATA: PMI, ICAO: \nLEPA; also known as Son Sant Joan Airport or Aeroport de Son Sant Joan) is an international airport located 8 \nkm (5.0 mi) east of Palma, Mallorca, Spain, adjacent to the village of Can Pastilla. In 2020, the airport handled \n6.1 million passengers (after 29.7 million in 2019, in pre-COVID-19 conditions), making it the third busiest airport in Spain, after \nMadrid–Barajas and Barcelona-El Prat. The airport is the main base for the Spanish carrier Air Europa and also a focus \nairport for Eurowings, EasyJet, Jet2. ",
        "source": "https://en.wikipedia.org/wiki/Palma_de_Mallorca_Airport"
    },
    "LEST": {
        "text": "Santiago–Rosalía de Castro Airport (Galician: Aeroporto de Santiago-Rosalía de Castro, Spanish: Aeropuerto de Santiago-Rosalía de Castro) (IATA: SCQ, ICAO: \nLEST), previously named Lavacolla Airport and also known as Santiago de Compostela Airport, is an international airport serving the autonomous \ncommunity and historic nationality of Galicia in Spain. It is the biggest and busiest airport in Galicia and the 2nd \nbusiest airport in northern Spain after Bilbao Airport. It has been named after the Galician romanticist writer and poet Rosalía \nde Castro, since 12 March 2020. ",
        "source": "https://en.wikipedia.org/wiki/Santiago%E2%80%93Rosal%C3%ADa_de_Castro_Airport"
    },
    "LFBD": {
        "text": "Bordeaux–Mérignac Airport (French: Aéroport de Bordeaux-Mérignac) (IATA: BOD, ICAO: LFBD) is the international airport of Bordeaux, in south-western France. \nIt is situated in the commune of Mérignac, 12 km (7.5 mi) west of Bordeaux, within the département of the \nGironde. It mainly features flights to metropolitan and leisure destinations in Europe, Northern Africa, and Canada, and serves as a \nbase for easyJet, Ryanair and Volotea airlines. ",
        "source": "https://en.wikipedia.org/wiki/Bordeaux%E2%80%93M%C3%A9rignac_Airport"
    },
    "LFBO": {
        "text": "Toulouse–Blagnac Airport (French: Aéroport de Toulouse–Blagnac) (IATA: TLS, ICAO: LFBO) is an international airport located 3.6 nautical miles (6.7 \nkm; 4.1 mi) west northwest of Toulouse, partially in Blagnac, both communes of the Haute-Garonne department in the Occitanie region \nof France. In 2017, the airport served 9,264,611 passengers. As of April 2017, the airport features flights to 74 destinations, \nmostly in Europe and Northern Africa with a few additional seasonal long-haul connections. ",
        "source": "https://en.wikipedia.org/wiki/Toulouse%E2%80%93Blagnac_Airport"
    },
    "LFLL": {
        "text": "Lyon–Saint Exupéry Airport (French: Aéroport de Lyon-Saint Exupéry), formerly known as Lyon Satolas Airport (IATA: LYS, ICAO: LFLL), is \nthe international airport of Lyon, the third-biggest city in France and an important transport facility for the entire Auvergne-Rhône-Alpes region. \nIt lies in Colombier-Saugnieu, 11 nautical miles (20 km; 13 mi) southeast of Lyon's city centre. The airport is 30 \nminutes from the Lyon-Part-Dieu business district by the Rhônexpress tram. ",
        "source": "https://en.wikipedia.org/wiki/Lyon%E2%80%93Saint-Exup%C3%A9ry_Airport"
    },
    "LFML": {
        "text": "Marseille Provence Airport (French: Aéroport Marseille-Provence) (IATA: MRS, ICAO: LFML) is an international airport located 27 km (17 miles) \nnorthwest of Marseille, on the territory of Marignane, both communes of the Bouches-du-Rhône département in the Provence-Alpes-Côte d'Azur region of \nFrance. The airport's hinterland goes from Gap to Arles and from Toulon to Avignon. ",
        "source": "https://en.wikipedia.org/wiki/Marseille_Provence_Airport"
    },
    "LFMN": {
        "text": "Nice Côte d'Azur Airport (French: Aéroport Nice Côte d'Azur) (IATA: NCE, ICAO: LFMN) is an international airport located 3.2 \nNM (5.9 km; 3.7 mi) southwest of Nice, in the Alpes-Maritimes department of France. It is the third busiest airport \nin France and serves as a focus city for Air France and an operating base for easyJet. In 2023, it \nhandled 14,189,965 passengers. ",
        "source": "https://en.wikipedia.org/wiki/Nice_C%C3%B4te_d%27Azur_Airport"
    },
    "LFPG": {
        "text": "Paris Charles de Gaulle Airport (IATA: CDG, ICAO: LFPG), also known as Roissy Airport or simply Paris CDG, is \nthe main international airport serving Paris, France. Opened in 1974, it is in Roissy-en-France, 23 km (14 mi) northeast of \nParis and is named after World War II statesman Charles de Gaulle (1890–1970), whose initials (CDG) are used as its \nIATA airport code. Charles de Gaulle Airport serves as the principal hub for Air France and a destination for other \nlegacy carriers (from Star Alliance, Oneworld and SkyTeam), as well as an operating base for easyJet and Norse Atlantic Airways. ",
        "source": "https://en.wikipedia.org/wiki/Charles_de_Gaulle_Airport"
    },
    "LFPO": {
        "text": "Paris Orly Airport (IATA: ORY, ICAO: LFPO) commonly referred to as Orly, is one of two international airports serving \nParis, the capital of France, the other one being Charles de Gaulle Airport (CDG). It is located partially in Orly \nand partially in Villeneuve-le-Roi, 13 km (8.1 mi) south of Paris. It serves as a secondary hub for domestic and \noverseas territories flights of Air France and as the homebase for Transavia France. ",
        "source": "https://en.wikipedia.org/wiki/Orly_Airport"
    },
    "LFSB": {
        "text": "EuroAirport Basel Mulhouse Freiburg (IATA: MLH, BSL, EAP, ICAO: LFSB) is an international airport in the administrative commune of \nSaint-Louis, in the French Alsace part of the Trinational Eurodistrict of Basel. It is 4.7 km (2.9 mi) west of \nthe tripoint of France, Germany, and Switzerland, 3.5 km (2.2 mi) northwest of the city of Basel in Switzerland, 20 \nkm (12 mi) southeast of Mulhouse in France, and 46 km (29 mi) south-southwest of Freiburg im Breisgau in Germany. \nThe airport is jointly administered by France and Switzerland, governed by a 1949 international convention. ",
        "source": "https://en.wikipedia.org/wiki/EuroAirport_Basel_Mulhouse_Freiburg"
    },
    "LGAV": {
        "text": "Athens International Airport Eleftherios Venizelos (Greek: Διεθνής Αερολιμένας Αθηνών «Ελευθέριος Βενιζέλος», Diethnís Aeroliménas Athinón \"Elefthérios Venizélos\"), commonly initialised as \nAIA (IATA: ATH, ICAO: LGAV), is the largest international airport in Greece, serving the city of Athens and region of \nAttica. It began operation on 28 March 2001 (in time for the 2004 Summer Olympics) and is the main base \nof Aegean Airlines, as well as other smaller Greek airlines. It replaced the old Ellinikon International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Athens_International_Airport"
    },
    "LGIR": {
        "text": "Heraklion International Airport \"Nikos Kazantzakis\" (IATA: HER, ICAO: LGIR) is the primary airport on the island of Crete, Greece, \nand the country's second busiest airport after Athens International Airport. It is located about 5 kilometres (3.1 mi) east of \nthe main city centre of Heraklion, near the municipality of Nea Alikarnassos. It is a shared civil/military facility. ",
        "source": "https://en.wikipedia.org/wiki/Heraklion_International_Airport"
    },
    "LGTS": {
        "text": "Thessaloniki Airport (IATA: SKG, ICAO: LGTS), officially Thessaloniki Airport \"Makedonia\" (Greek: Κρατικός Αερολιμένας Θεσσαλονίκης «Μακεδονία», romanized: Kratikós Aeroliménas Thessaloníkis \n\"Makedonía\") and formerly Mikra Airport, is an international airport serving Thessaloniki, the second-largest city in Greece. It is located 13 \nkm (8 mi) southeast of the city, in Thermi. The airport is the third-largest airport in the country after Athens \nInternational Airport and Heraklion International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Thessaloniki_Airport"
    },
    "LHBP": {
        "text": "Budapest Ferenc Liszt International Airport (Hungarian: Budapest Liszt Ferenc Nemzetközi Repülőtér) (IATA: BUD, ICAO: LHBP), formerly known as Budapest \nFerihegy International Airport and still commonly called just Ferihegy (Hungarian pronunciation: [ˈfɛrihɛɟ]), is the international airport serving the Hungarian capital \ncity of Budapest. It is by far the largest of the country's four commercial airports, ahead of Debrecen and Hévíz–Balaton. \nThe airport is located 16 kilometres (8+1⁄2 nautical miles) southeast of the centre of Budapest (bordering Pest county) and was \nrenamed in 2011 in honour of the famous Hungarian composer Franz Liszt (Hungarian: Liszt Ferenc) on the occasion of the \n200th anniversary of his birth. ",
        "source": "https://en.wikipedia.org/wiki/Budapest_Ferenc_Liszt_International_Airport"
    },
    "LHS": {
        "text": "Lake Havasu City (, HAH-və-soo) is a city in Mohave County, Arizona, United States. As of the 2020 census, \nthe population of the city was 57,144, up from 52,527 in 2010. It is served by Lake Havasu City Airport. ",
        "source": "https://en.wikipedia.org/wiki/Lake_Havasu_City,_Arizona"
    },
    "LICC": {
        "text": "Catania–Fontanarossa Airport (IATA: CTA, ICAO: LICC), also known as Vincenzo Bellini Airport (Italian: Aeroporto Internazionale Vincenzo Bellini di Catania-Fontanarossa), \nis an international airport 2.3 NM (4.3 km; 2.6 mi) southwest of Catania, the second largest city on the Italian \nisland of Sicily. It is named after the opera composer Vincenzo Bellini, who was born in Catania. According to Assaeroporti, \nit is the busiest airport in Sicily and the fourth busiest in Italy in 2020. ",
        "source": "https://en.wikipedia.org/wiki/Catania%E2%80%93Fontanarossa_Airport"
    },
    "LICJ": {
        "text": "Falcone Borsellino Airport (IATA: PMO, ICAO: LICJ) (Italian: Aeroporto Falcone Borsellino) or simply Palermo Airport, formerly Punta Raisi Airport, \nis an international airport located at Cinisi, 19 NM (35 km; 22 mi) west-northwest of Palermo, the capital city of \nthe Italian island of Sicily. It is the second biggest airport in Sicily in terms of passengers after Catania-Fontanarossa Airport, \nwith 7,118,087 passengers handled in 2022. . ",
        "source": "https://en.wikipedia.org/wiki/Palermo_Airport"
    },
    "LIEE": {
        "text": "Cagliari Elmas Airport (IATA: CAG, ICAO: LIEE) is an international airport located in the territory of Elmas, near Cagliari, \non the Italian island of Sardinia. ",
        "source": "https://en.wikipedia.org/wiki/Cagliari_Elmas_Airport"
    },
    "LIMC": {
        "text": "Milan Malpensa Airport (IATA: MXP, ICAO: LIMC) is the largest international airport in northern Italy, serving Lombardy, Piedmont and \nLiguria, as well as the Swiss Canton of Ticino. The airport is 49 kilometres (30 mi) northwest of Milan, next \nto the Ticino river dividing Lombardy and Piedmont. The airport was opened in 1909 by Giovanni Agusta and Gianni Caproni \nto test their aircraft prototypes, before switching to civil operation in 1948. ",
        "source": "https://en.wikipedia.org/wiki/Milan_Malpensa_Airport"
    },
    "LIME": {
        "text": "Orio al Serio International Airport, also styled as Milan Bergamo Airport for commercial purposes, (IATA: BGY, ICAO: LIME) is \nthe third-busiest international airport in Italy. The airport is also officially called Il Caravaggio International Airport after the Baroque painter \nMichelangelo Merisi da Caravaggio, who originally hailed from the nearby town of Caravaggio. The airport is located in Orio al \nSerio, 3.7 km (2.3 mi) southeast of Bergamo and 45 km (28 mi) northeast of Milan. ",
        "source": "https://en.wikipedia.org/wiki/Milan_Bergamo_Airport"
    },
    "LIMF": {
        "text": "Turin Airport (Italian: Aeroporto di Torino) (IATA: TRN, ICAO: LIMF), also known as Turin-Caselle Airport (Aeroporto di Torino-Caselle), is \nan international airport located at Caselle Torinese, 16 km (9.9 mi) north-northwest of the city of Turin, in the Metropolitan \nCity of Turin, Piedmont region, Northern Italy. It is also named Sandro Pertini Airport (Aeroporto Sandro Pertini), after former Italian \nPresident Sandro Pertini. ",
        "source": "https://en.wikipedia.org/wiki/Turin_Airport"
    },
    "LIPE": {
        "text": "Bologna Guglielmo Marconi Airport (Italian: Aeroporto di Bologna-Guglielmo Marconi) (IATA: BLQ, ICAO: LIPE) is an international airport serving the \ncity of Bologna in Italy. It is approximately 6 km (3.7 mi) northwest of the city centre in the Emilia-Romagna \nregion of Italy. The airport is named after Bologna native Guglielmo Marconi, an Italian electrical engineer and Nobel laureate. ",
        "source": "https://en.wikipedia.org/wiki/Bologna_Guglielmo_Marconi_Airport"
    },
    "LIPX": {
        "text": "Verona Villafranca Airport (IATA: VRN, ICAO: LIPX), also known as Valerio Catullo Airport or Villafranca Airport, is located 10 \nkm (6.2 mi) southwest of Verona, Italy. The airport is situated next to the junction of A4 Milan-Venice and A22 \nModena-Brenner motorways. It serves a population of more than 4 million inhabitants in the provinces of Verona, Brescia, Mantua (Mantova) \nand Trentino-Alto Adige/Südtirol. ",
        "source": "https://en.wikipedia.org/wiki/Verona_Villafranca_Airport"
    },
    "LIPZ": {
        "text": "Venice Marco Polo Airport (IATA: VCE, ICAO: LIPZ) is the international airport of Venice, Italy. It is located on \nthe mainland near the village of Tessera, a frazione of the comune of Venice located about 4.1 nautical miles (7.6 \nkilometres; 4.7 miles) east of Mestre (on the mainland) and around the same distance north of Venice proper. Due to \nthe importance of Venice as a leisure destination, it features flights to many European metropolitan areas as well as some \npartly seasonal long-haul routes to the United States, Canada, South Korea and the Middle East. ",
        "source": "https://en.wikipedia.org/wiki/Venice_Marco_Polo_Airport"
    },
    "LIRF": {
        "text": "Leonardo da Vinci–Rome Fiumicino Airport (Italian: Aeroporto Leonardo da Vinci di Roma–Fiumicino) (IATA: FCO, ICAO: LIRF), commonly known as \nRome Fiumicino Airport, is an international airport in Fiumicino, Italy, serving Rome. It is the busiest airport in the country, \nthe 9th busiest airport in Europe and the world's 46th-busiest airport with over 40.5 million passengers served in 2023. It \ncovers an area of 16 square kilometres (6.2 sq mi). ",
        "source": "https://en.wikipedia.org/wiki/Rome_Fiumicino_Airport"
    },
    "LIRN": {
        "text": "Naples-Capodichino International Airport (IATA: NAP, ICAO: LIRN) (Italian: Aeroporto Internazionale di Napoli) is the international airport serving Naples and \nthe Southern Italian region of Campania. According to 2022 data, the airport is the fourth-busiest airport in Italy and the \nbusiest in Southern Italy. The airport serves as a base for easyJet, Ryanair, Volotea and Wizzair. ",
        "source": "https://en.wikipedia.org/wiki/Naples_International_Airport"
    },
    "LIRP": {
        "text": "Pisa International Airport (Italian: Aeroporto Internazionale di Pisa) (IATA: PSA, ICAO: LIRP), also named Galileo Galilei Airport, is an \nairport located in Pisa, Italy. It is one of the two major airports in Tuscany, the other being Florence Airport. \nPisa is ranked 10th in Italy in terms of passenger numbers. ",
        "source": "https://en.wikipedia.org/wiki/Pisa_International_Airport"
    },
    "LJLJ": {
        "text": "Find more data about Ljubljana Jože Pu?nik Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/LJU'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/LJU"
    },
    "LKPR": {
        "text": "Václav Havel Airport Prague, formerly Prague Ruzyně International Airport (IATA: PRG, ICAO: LKPR), is an international airport of Prague, \nthe capital of the Czech Republic. The airport was founded in 1937, when it replaced the Kbely Airport (founded in \n1918). It was reconstructed and extended in 1956, 1968, 1997, and 2006. ",
        "source": "https://en.wikipedia.org/wiki/V%C3%A1clav_Havel_Airport_Prague"
    },
    "LLBG": {
        "text": "Ben Gurion International Airport (IATA: TLV, ICAO: LLBG), commonly known by the Hebrew-language acronym Natbag (נתב״ג‎), is the main \ninternational airport of Israel. Situated on the northern outskirts of the city of Lod, it is the busiest airport in \nthe country. It is located 45 kilometres (28 mi) to the northwest of Jerusalem and 20 kilometres (12 mi) to \nthe southeast of Tel Aviv. ",
        "source": "https://en.wikipedia.org/wiki/Ben_Gurion_Airport"
    },
    "LLER": {
        "text": "Ramon Airport (Hebrew: נמל התעופה רמון, Arabic: مطار رامون) (IATA: ETM, ICAO: LLER), named after Ilan and Assaf Ramon \nand unofficially also known as Eilat-Ramon Airport, is an international airport located in the Timna Valley in southern Israel. Ramon \nAirport is the second busiest in Israel (after Ben Gurion Airport) and has replaced the former Eilat Airport and Ovda \nAirport for civilian traffic. It also serves as the primary diversion airport in Israel. ",
        "source": "https://en.wikipedia.org/wiki/Ramon_Airport"
    },
    "LMML": {
        "text": "Malta International Airport (IATA: MLA, ICAO: LMML) is the only airport in Malta, and it serves the whole of \nthe Maltese Islands. It is located on the island of Malta, southwest of the Maltese capital, Valletta, in the town \nof Luqa, and occupies the location of the former RAF Luqa. The airport serves as the main hub for KM \nMalta Airlines and Medavia besides being an operating base for Ryanair and its subsidiary Malta Air. ",
        "source": "https://en.wikipedia.org/wiki/Malta_International_Airport"
    },
    "LOWW": {
        "text": "Vienna Airport, German: Flughafen Wien-Schwechat, Slovak: Letisko Viedeň-Švechat, (IATA: VIE, ICAO: LOWW) is the international airport of Vienna, the \ncapital of Austria. It is located in Schwechat, 18 km (11 mi) southeast of central Vienna and 57 kilometres (35 \nmi) west of Bratislava, the capital of Slovakia. Its name in the Austrian Aeronautical Information Publication is Wien-Schwechat Airport. ",
        "source": "https://en.wikipedia.org/wiki/Vienna_International_Airport"
    },
    "LPFR": {
        "text": "Hector International Airport (IATA: FAR, ICAO: KFAR, FAA LID: FAR) is a civil-military public airport three miles (5 km) \nnorthwest of Fargo, in Cass County, North Dakota, United States. The busiest airport in North Dakota, it is owned by \nthe City of Fargo Municipal Airport Authority. Fargo Air National Guard Base is located adjacent to the airport. ",
        "source": "https://en.wikipedia.org/wiki/Hector_International_Airport"
    },
    "LPPD": {
        "text": "Ponta Delgada–João Paulo II Airport (IATA: PDL, ICAO: LPPD), named after Pope John Paul II, is an international airport \nlocated on the island of São Miguel, in the Portuguese archipelago of the Azores. Situated 2 kilometres (1.2 miles; 1.1 \nnautical miles) west of the city centre of Ponta Delgada, it is the primary (and busiest) airport in the Azores, \nas well as the fifth largest infrastructure managed by ANA Aeroportos de Portugal. The terminal was finished in 1995; by \n2005 the airport served a total of 873,500 passengers. ",
        "source": "https://en.wikipedia.org/wiki/Jo%C3%A3o_Paulo_II_Airport"
    },
    "LPPR": {
        "text": "Francisco Sá Carneiro Airport (IATA: OPO, ICAO: LPPR) or simply Porto Airport (formerly Pedras Rubras Airport) is an international \nairport near Porto (Oporto), Portugal. It is located 11 km (6.8 mi) northwest of the Clérigos Tower (in the centre \nof Porto). Its location is split between the municipalities of Maia, Matosinhos and Vila do Conde. ",
        "source": "https://en.wikipedia.org/wiki/Porto_Airport"
    },
    "LPPT": {
        "text": "Humberto Delgado Airport (IATA: LIS, ICAO: LPPT), informally Lisbon Airport and previously Portela Airport, is an international airport located \nseven kilometres (four nautical miles) northeast of the city centre of Lisbon, the capital of Portugal. The airport is the \nmain international gateway to Portugal. As of 2023, it was the 12th-largest airport in Europe in terms of passenger volume, \nand carried 190,700 tonnes of cargo. ",
        "source": "https://en.wikipedia.org/wiki/Lisbon_Airport"
    },
    "LROP": {
        "text": "Find more data about Henri Coand? International Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/OTP'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/OTP"
    },
    "LSGG": {
        "text": "Geneva Airport (IATA: GVA, ICAO: LSGG), formerly and still unofficially known as Cointrin Airport, is an international airport of \nGeneva, the second most populous city in Switzerland. It is located 4 km (2.5 mi) northwest of the city centre. \nIt surpassed the 15-million-passengers-a-year mark for the first time in December 2014. ",
        "source": "https://en.wikipedia.org/wiki/Geneva_Airport"
    },
    "LSZH": {
        "text": "Zurich Airport (IATA: ZRH, ICAO: LSZH) is the largest international airport of Switzerland and the principal hub of Swiss \nInternational Air Lines. It serves Zürich, Switzerland's largest city, and, with its surface transport links, much of the rest of \nthe country. The airport is located 13 kilometres (8 mi) north of central Zürich, in the municipalities of Kloten, Rümlang, \nOberglatt, Winkel, and Opfikon, all of which are within the canton of Zürich. ",
        "source": "https://en.wikipedia.org/wiki/Zurich_Airport"
    },
    "LTAC": {
        "text": "Find more data about Esenbo?a International Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/ESB'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/ESB"
    },
    "LTAI": {
        "text": "Antalya Airport (IATA: AYT, ICAO: LTAI) (Turkish: Antalya Havalimanı) is a major international airport located 13 km (8.1 mi) \nnortheast of the city centre of Antalya, Turkey. It is a major destination during the European summer leisure season due \nto its location at the country's Mediterranean coast. It handled 31,210,119 passengers in 2022, making it the second-busiest airport in \nTurkey after Istanbul Airport. ",
        "source": "https://en.wikipedia.org/wiki/Antalya_Airport"
    },
    "LTBA": {
        "text": "Istanbul is the largest city in Turkey, straddling the Bosporus Strait, the boundary between Europe and Asia. It is \nconsidered the country's economic, cultural and historic capital. The city has a population of over 15 million residents, comprising 19% \nof the population of Turkey, and is the most populous city in Europe and the world's fifteenth-largest city. ",
        "source": "https://en.wikipedia.org/wiki/Istanbul"
    },
    "LTBJ": {
        "text": "İzmir Adnan Menderes Airport (IATA: ADB, ICAO: LTBJ) (Turkish: İzmir Adnan Menderes Havalimanı) is an international airport serving İzmir \nand most of the surrounding province in Turkey. It is named after former Turkish prime minister Adnan Menderes. . ",
        "source": "https://en.wikipedia.org/wiki/%C4%B0zmir_Adnan_Menderes_Airport"
    },
    "LTBS": {
        "text": "Dalaman Airport (IATA: DLM, ICAO: LTBS) is an international airport and one of three serving south-west Turkey, the others \nbeing Milas–Bodrum Airport and Antalya Airport. It has two terminals. The old terminal is used for domestic flights and the \nnew terminal is for international flights. ",
        "source": "https://en.wikipedia.org/wiki/Dalaman_Airport"
    },
    "LTFE": {
        "text": "Milas–Bodrum Airport (IATA: BJV, ICAO: LTFE) is an international airport that serves the Turkish towns of Bodrum and Milas. \nThe airport is situated 36 km northeast of the town of Bodrum, and 16 km south of Milas. ",
        "source": "https://en.wikipedia.org/wiki/Milas%E2%80%93Bodrum_Airport"
    },
    "LTFJ": {
        "text": "Istanbul Sabiha Gökçen International Airport (IATA: SAW, ICAO: LTFJ) is one of two international airports serving Istanbul, the largest \ncity in Turkey. Located 32 km (20 mi) southeast of the city center, Sabiha Gökçen Airport is in the Asian \npart of the bi-continental city and serves as the hub for AJet and Pegasus Airlines. The facility is named after \nSabiha Gökçen, adoptive daughter of Mustafa Kemal Atatürk and the first female fighter pilot in the world. ",
        "source": "https://en.wikipedia.org/wiki/Sabiha_G%C3%B6k%C3%A7en_International_Airport"
    },
    "LTFM": {
        "text": "Istanbul Airport (Turkish: İstanbul Havalimanı, IATA: IST, ICAO: LTFM) is the larger of two international airports serving Istanbul, Turkey. \nIt is located in the Arnavutköy district on the European side of the city. All scheduled commercial passenger flights were \ntransferred from Atatürk Airport to Istanbul Airport on 6 April 2019, following the closure of Atatürk Airport for scheduled passenger \nflights. ",
        "source": "https://en.wikipedia.org/wiki/Istanbul_Airport"
    },
    "LWSK": {
        "text": "Skopje International Airport (Macedonian: Меѓународен аеродром Скопје, Albanian: Aeroporti Ndërkombëtar i Shkupit, IATA: SKP, ICAO: LWSK) also known as \nSkopje Airport (Macedonian: Аеродром Скопје, Albanian: Aeroporti i Shkupit) and Petrovec Airport is the larger and busier of the two \ninternational airports in North Macedonia, with the other being the St. Paul the Apostle Airport in Ohrid, which is located \n170 km (110 mi) southwest from the national capital Skopje. The airport was previously named Skopje Alexander the Great Airport. ",
        "source": "https://en.wikipedia.org/wiki/Skopje_International_Airport"
    },
    "LYBE": {
        "text": "Belgrade Nikola Tesla Airport (Serbian: Аеродром Никола Тесла Београд / Aerodrom Nikola Tesla Beograd) or Belgrade Airport (Serbian: Аеродром \nБеоград / Aerodrom Beograd) (IATA: BEG, ICAO: LYBE) is an international airport serving Belgrade, Serbia. It is the largest and \nthe busiest airport in Serbia, situated 18 km (11 mi) west of downtown Belgrade near the suburb of Surčin, surrounded \nby fertile lowlands. It is operated by French conglomerate Vinci Airports and it is named after Serbian-American inventor Nikola Tesla \n(1856–1943). ",
        "source": "https://en.wikipedia.org/wiki/Belgrade_Nikola_Tesla_Airport"
    },
    "LYPG": {
        "text": "Podgorica Airport (Montenegrin: Аеродром Подгорица, Aerodrom Podgorica, pronounced [aerǒdrom pǒdɡorit͡sa]) (IATA: TGD, ICAO: LYPG) is an international airport serving \nthe Montenegrin capital of Podgorica and the surrounding region. It is one of two international airports in Montenegro, the other \nbeing Tivat Airport. Both are operated by the state-owned company Airports of Montenegro (Аеродроми Црне Горе / Aerodromi Crne Gore). ",
        "source": "https://en.wikipedia.org/wiki/Podgorica_Airport"
    },
    "LZIB": {
        "text": "M. R. Štefánik Airport (Slovak: Letisko M. ",
        "source": "https://en.wikipedia.org/wiki/Bratislava_Airport"
    },
    "MBPV": {
        "text": "Providenciales International Airport (IATA: PLS, ICAO: MBPV), on the island of Providenciales in the Caicos Islands, is the main \ninternational airport serving the Turks and Caicos Islands, a British Overseas Territory of the United Kingdom. It is operated by \nTurks and Caicos Islands Airports Authority (TCIAA). The territory's other international airport is JAGS McCartney International Airport on Grand Turk \nIsland. ",
        "source": "https://en.wikipedia.org/wiki/Providenciales_International_Airport"
    },
    "MDPC": {
        "text": "Punta Cana International Airport (IATA: PUJ, ICAO: MDPC) is a privately owned commercial airport in Punta Cana, eastern Dominican \nRepublic. The airport was built with open-air terminals and roofs covered in palm fronds. Grupo Punta Cana built the airport, \nwhich was designed by architect Oscar Imbert, and inaugurated it in December 1983. ",
        "source": "https://en.wikipedia.org/wiki/Punta_Cana_International_Airport"
    },
    "MDSD": {
        "text": "Las Américas International Airport (Spanish: Aeropuerto Internacional Las Américas, or AILA) (IATA: SDQ, ICAO: MDSD) is an international airport \nlocated in Punta Caucedo, near Santo Domingo and Boca Chica in the Dominican Republic. The airport is run by Aeropuertos \nDominicanos Siglo XXI (AERODOM), a private corporation based in the Dominican Republic, under a 25-year concession to build, operate, and \ntransfer (BOT) six of the country's airports. Las Américas usually receives a wide variety of long-, mid-, and short-haul aircraft. ",
        "source": "https://en.wikipedia.org/wiki/Las_Am%C3%A9ricas_International_Airport"
    },
    "MGGT": {
        "text": "La Aurora International Airport (Spanish: Aeropuerto Internacional La Aurora, IATA: GUA, ICAO: MGGT) serves Guatemala City, Guatemala. It is \nlocated 6.4 kilometres (4.0 mi; 3.5 nmi) south of Guatemala City's center and 25 km (16 mi; 13 nmi) from \nAntigua Guatemala. It is administered by the General Directorate of Civil Aeronautics. ",
        "source": "https://en.wikipedia.org/wiki/La_Aurora_International_Airport"
    },
    "MKJP": {
        "text": "Norman Manley International Airport (IATA: KIN, ICAO: MKJP), formerly Palisadoes Airport, is an international airport serving Kingston, Jamaica, and \nis located south of the island 19 km (12 mi) away from the centre of New Kingston. It is the \nsecond busiest airport in the country after Sangster International Airport, recording 629,400 arriving passengers in 2020 and 830,500 in 2021. \nOver 130 international flights a week depart from Norman Manley International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Norman_Manley_International_Airport"
    },
    "MMAA": {
        "text": "Acapulco International Airport (Spanish: Aeropuerto Internacional de Acapulco), officially Aeropuerto Internacional General Juan N. Álvarez (General Juan N. Álvarez \nInternational Airport) (IATA: ACA, ICAO: MMAA), is an international airport located in Acapulco, Guerrero, Mexico. ",
        "source": "https://en.wikipedia.org/wiki/Acapulco_International_Airport"
    },
    "MMGL": {
        "text": "Don Miguel Gregorio Antonio Ignacio Hidalgo y Costilla Gallaga Mandarte y Villaseñor (8 May 1753 – 30 July 1811), \nmore commonly known as Miguel Hidalgo y Costilla or Miguel Hidalgo (Spanish pronunciation: [miˈɣel iˈðalɣo]), was a Catholic priest, leader \nof the Mexican War of Independence and recognized as the Father of the Nation. A professor at the Colegio de \nSan Nicolás Obispo in Valladolid, Hidalgo was influenced by Enlightenment ideas, which contributed to his ouster in 1792. He served \nin a church in Colima and then in Dolores. ",
        "source": "https://en.wikipedia.org/wiki/Miguel_Hidalgo_y_Costilla"
    },
    "MMHO": {
        "text": "Ignacio Echeverría Miralles de Imperial, (25 May 1978 – 3 June 2017) was a Spanish lawyer and banker. He \nfought off two of the terrorists in the 2017 London Bridge attack, before being killed by other terrorists. ",
        "source": "https://en.wikipedia.org/wiki/Ignacio_Echeverr%C3%ADa"
    },
    "MMMX": {
        "text": "Find more data about Licenciado Benito Juarez International A from <a id='airport-guide-link' href='https://airportguide.com/airport/info/MEX'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/MEX"
    },
    "MMMZ": {
        "text": "Mazatlán International Airport, (Spanish: Aeropuerto Internacional de Mazatlán); officially Aeropuerto Internacional General Rafael Buelna (General Rafael Buelna International Airport) \n(IATA: MZT, ICAO: MMMZ) is an international airport located in Mazatlán, Sinaloa, Mexico. It serves as the primary international gateway \nto Mazatlán, a popular Mexican tourist destination, offering flights to and from Mexico, the United States, and Canada. The airport \nalso facilitates various tourism-related activities, flight training, and general aviation. ",
        "source": "https://en.wikipedia.org/wiki/Mazatl%C3%A1n_International_Airport"
    },
    "MMPR": {
        "text": "Puerto Vallarta International Airport (Spanish: Aeropuerto Internacional de Puerto Vallarta), officially Aeropuerto Internacional Licenciado Gustavo Díaz Ordaz (Licenciado Gustavo \nDíaz Ordaz International Airport) (IATA: PVR, ICAO: MMPR), is an international airport managing both domestic and international air traffic for \nPuerto Vallarta, Jalisco, Mexico. It serves as a gateway to the Mexican tourist destination of Riviera Nayarit and the Jalisco \ncoast year-round, offering flights to and from Mexico, the United States, Canada, and the United Kingdom. The airport also houses \nfacilities for the Mexican Army and supports various tourism, flight training, and general aviation activities. ",
        "source": "https://en.wikipedia.org/wiki/Licenciado_Gustavo_D%C3%ADaz_Ordaz_International_Airport"
    },
    "MMSD": {
        "text": "Los Cabos International Airport (Spanish: Aeropuerto Internacional de Los Cabos) (IATA: SJD, ICAO: MMSD) is an international airport located \nin San José del Cabo, Baja California Sur, Mexico, serving as the main gateway to the popular tourist destination of \nthe Los Cabos region on the Baja California Peninsula. Annually, the airport attracts millions of tourists, predominantly from the United \nStates and Canada, with flights connecting to 30 U. S. ",
        "source": "https://en.wikipedia.org/wiki/Los_Cabos_International_Airport"
    },
    "MMSM": {
        "text": "Felipe Ángeles International Airport (IATA: NLU, ICAO: MMSM), also known as Mexico City Felipe Ángeles International Airport or simply \nMexico City-AIFA, is an international airport located in Zumpango, State of Mexico, 35 kilometres (22 mi) north of Mexico City. \nOriginally named Santa Lucía Air Force Base, it opened for civilian use in 2022, serving as the second airport for \nGreater Mexico City. The passenger terminal facilitates domestic and international flights, functioning as a Focus City for Viva Aerobus and \nAeromexico Connect. ",
        "source": "https://en.wikipedia.org/wiki/Felipe_%C3%81ngeles_International_Airport"
    },
    "MMTJ": {
        "text": "Abelardo Rodríguez Luján, commonly known as Abelardo L. Rodríguez (Spanish pronunciation: [aβeˈlaɾðo ˈele roˈðɾiɣes]; 12 May 1889 – 13 \nFebruary 1967) was a Mexican military officer, businessman and politician who served as Substitute President of Mexico from 1932 to \n1934. He completed the term of President Pascual Ortiz Rubio after his resignation, during the period known as the Maximato, \nwhen Former President Plutarco Elías Calles (El Jefe Máximo) held considerable de facto political power, without being president himself. ",
        "source": "https://en.wikipedia.org/wiki/Abelardo_L._Rodr%C3%ADguez"
    },
    "MMUN": {
        "text": "Cancún International Airport (Spanish: Aeropuerto Internacional de Cancún) (IATA: CUN, ICAO: MMUN) serves as the primary gateway for the \nCancún Metropolitan Area in Quintana Roo, the Mexican Caribbean, Riviera Maya, and Yucatán Peninsula. Operating as a hub for Viva \nAerobus and a focus city for Volaris and Magnicharters, it facilitates flights to over 100 cities across 30 countries in \nthe Americas and Europe. The airport is managed by Grupo Aeroportuario del Sureste (ASUR) and is the easternmost airport in \nMexico. ",
        "source": "https://en.wikipedia.org/wiki/Canc%C3%BAn_International_Airport"
    },
    "MPTO": {
        "text": "Tocumen International Airport (Spanish: Aeropuerto Internacional de Tocumen) (IATA: PTY, ICAO: MPTO) is the primary international airport serving Panama \nCity, the capital of Panama. The airport serves as the homebase for Copa Airlines and is a regional hub to \nand from the Caribbean, South, North and Central America and additionally features routes to some European cities as well as \ncargo flights to Qatar. . ",
        "source": "https://en.wikipedia.org/wiki/Tocumen_International_Airport"
    },
    "MRLB": {
        "text": "Guanacaste Airport—officially, Daniel Oduber Quirós International Airport (Spanish: Aeropuerto Internacional Daniel Oduber Quirós)—(IATA: LIR, ICAO: MRLB), and also known \nas Liberia International Airport, is one of four international airports in Costa Rica. It sits 11 kilometres (7 mi; 6 \nnmi) west-southwest of the city of Liberia in Guanacaste Province, and serves as a tourism hub for those who visit \nthe Pacific coast and western Costa Rica. The facility covers 243 hectares (600 acres) of land and has a single \n2,750-metre (9,022 ft) runway that can handle wide-body aircraft, including the Boeing 747. ",
        "source": "https://en.wikipedia.org/wiki/Guanacaste_Airport"
    },
    "MSLP": {
        "text": "El Salvador International Airport Saint Óscar Arnulfo Romero y Galdámez (Spanish: Aeropuerto Internacional de El Salvador San Óscar Arnulfo \nRomero y Galdámez), (IATA: SAL, ICAO: MSLP), previously known as Comalapa International Airport (Aeropuerto Internacional de Comalapa) and as Comalapa \nAir Base (Base Aérea de Comalapa) to the military, is a joint-use civilian and military airport that serves San Salvador, \nEl Salvador. It is located in the south central area of the country, in the city of San Luis Talpa, \nDepartment of La Paz, and occupies a triangular plain of 2,519.8 acres (1,019.7 ha), which borders the Pacific Ocean to \nthe south, is bordered to the east by the Jiboa River, and to the northwest by the coastal highway. Being \nclose to sea level, it allows aircraft to operate efficiently at maximum capacity. ",
        "source": "https://en.wikipedia.org/wiki/El_Salvador_International_Airport"
    },
    "MTPP": {
        "text": "Toussaint Louverture International Airport (Haitian Creole: Ayewopò Entènasyonal Tousen Louvèti, French: Aéroport International Toussaint Louverture) (IATA: PAP, ICAO: MTPP) \nis an international airport in Tabarre, a commune of Port-au-Prince in Haiti. The airport is currently the busiest in Haiti \nand is an operating hub for Sunrise Airways. It is informally called \"the Maïs-Gâté airport\", named after the area in \nthe Cul-de-Sac Plain where the airport was built. ",
        "source": "https://en.wikipedia.org/wiki/Toussaint_Louverture_International_Airport"
    },
    "MUHA": {
        "text": "José Martí International Airport (IATA: HAV, ICAO: MUHA), sometimes known by its former name Rancho Boyeros Airport, is an \ninternational airport located 20 kilometres (12 mi) southwest of the centre of Havana, Cuba, and is a hub for Cubana \nde Aviación and Aerogaviota, and former Latin American hub for the Soviet (later Russian) airline Aeroflot. It is Cuba's main \ninternational airport, and serves several million passengers each year. The facility is operated by Empresa Cubana de Aeropuertos y Servicios \nAeronáuticos (ECASA). ",
        "source": "https://en.wikipedia.org/wiki/Jos%C3%A9_Mart%C3%AD_International_Airport"
    },
    "MUVR": {
        "text": "Juan Gualberto Gómez Airport (IATA: VRA, ICAO: MUVR), formerly known as Varadero Airport (Spanish: Aeropuerto de Varadero), is an \ninternational airport serving Varadero, Cuba, and the province of Matanzas. The airport is located 5 km from the village of \nCarbonera, closer to the city of Matanzas than to Varadero. The closest airport to Varadero is Kawama Airport. ",
        "source": "https://en.wikipedia.org/wiki/Juan_Gualberto_G%C3%B3mez_Airport"
    },
    "MWCR": {
        "text": "Owen Roberts International Airport (IATA: GCM, ICAO: MWCR) is an airport serving Grand Cayman, Cayman Islands. It is the \nmain international airport for the Cayman Islands as well as the main base for Cayman Airways. The airport is named \nafter British Royal Air Force (RAF) Wing Commander Owen Roberts, a pioneer of commercial aviation in the country, and is \none of the two entrance ports to the Cayman Islands. ",
        "source": "https://en.wikipedia.org/wiki/Owen_Roberts_International_Airport"
    },
    "MYNN": {
        "text": "Lynden Pindling International Airport (IATA: NAS, ICAO: MYNN), formerly known as Nassau International Airport, is the largest airport in \nthe Bahamas and the largest international gateway into the country. It is a hub for Bahamasair, Western Air, and Pineapple \nAir. The airport is located in western New Providence island near the capital city of Nassau. ",
        "source": "https://en.wikipedia.org/wiki/Lynden_Pindling_International_Airport"
    },
    "MZBZ": {
        "text": "Philip S. W. Goldson International Airport (IATA: BZE, ICAO: MZBZ) is an airport that serves the nation of Belize's \nlargest city, Belize City along the eastern coast of Central America. ",
        "source": "https://en.wikipedia.org/wiki/Philip_S._W._Goldson_International_Airport"
    },
    "NCRG": {
        "text": "Rarotonga International Airport (IATA: RAR, ICAO: NCRG) (Cook Islands Māori: Papa Rererangi o Rarotonga) is the Cook Islands' main \ninternational gateway, located in the town and district of Avarua, Rarotonga, 3 km (1.9 mi) west of the downtown area \non the northern coast. Originally built in 1944, the airport was expanded in the early 1970s, and officially opened for \njets in January 1974. Because of the proximity of the runways to the nearby roads, it is possible to get \nvery close to the aircraft while they are departing and landing. ",
        "source": "https://en.wikipedia.org/wiki/Rarotonga_International_Airport"
    },
    "NTAA": {
        "text": "Faa'a International Airport (French: Aéroport international de Tahiti-Faaa), also known as Tahiti International Airport (IATA: PPT, ICAO: NTAA), is \nthe international airport of French Polynesia, located in the commune of Faaa, on the island of Tahiti. It is situated \n5 km (3.1 mi) southwest of Papeete, the capital city of the overseas collectivity. It opened in 1960. ",
        "source": "https://en.wikipedia.org/wiki/Faa%27a_International_Airport"
    },
    "NVVV": {
        "text": "Bauerfield International Airport (IATA: VLI, ICAO: NVVV) (French: Aéroport International Bauerfield) is an airport located in Port Vila, Vanuatu. \nThe airport is relatively small in size, but its runway has the capability and length to accept jets up to \nthe Airbus A330. It serves as the hub for Vanuatu's flag carrier airline, Air Vanuatu. ",
        "source": "https://en.wikipedia.org/wiki/Bauerfield_International_Airport"
    },
    "NWWM": {
        "text": "Nouméa Magenta Airport (French: Aéroport de Nouméa-Magenta; IATA: GEA, ICAO: NWWM) is a domestic airport on the main island \nof New Caledonia, an overseas collectivity of France in the southwest Pacific Ocean. The airport is 3 km (2 mi) \neast-northeast of the city centre of Nouméa, the capital, approximately 38 km (24 mi) southeast of La Tontouta International Airport. \nIn 2017, 428,679 passengers used the airport. ",
        "source": "https://en.wikipedia.org/wiki/Noum%C3%A9a_Magenta_Airport"
    },
    "NZAA": {
        "text": "Auckland Airport (Māori: Taunga Rererangi o Tāmaki-Makaurau) (IATA: AKL, ICAO: NZAA) is the largest and busiest airport in New \nZealand, with over 16 million passengers served in the year ended August 2023. The airport is located near Māngere, a \nresidential suburb, and Airport Oaks, a service-hub suburb 21 kilometres (13 mi) south of the Auckland city centre. It serves \nas the domestic and international hub for Air New Zealand, and the New Zealand hub of Jetstar. ",
        "source": "https://en.wikipedia.org/wiki/Auckland_Airport"
    },
    "NZCH": {
        "text": "Christchurch Airport (IATA: CHC, ICAO: NZCH) is the main airport that serves Christchurch, New Zealand. It is located 12 \nkilometres (7.5 mi) to the northwest of the city centre, in the suburb of Harewood. Christchurch (Harewood) Airport officially opened \non 18 May 1940 and became New Zealand's first international airport on 16 December 1950. ",
        "source": "https://en.wikipedia.org/wiki/Christchurch_Airport"
    },
    "NZWN": {
        "text": "Wellington International Airport (Māori: Taunga Rererangi o Te Whanganui-a-Tara; formerly known as Rongotai Airport) (IATA: WLG, ICAO: NZWN) is \nan international airport located in the suburb of Rongotai in Wellington. It lies 3 NM or 5.5 km south-east from \nthe city centre. It is a hub for Air New Zealand and Sounds Air. ",
        "source": "https://en.wikipedia.org/wiki/Wellington_Airport"
    },
    "OBBI": {
        "text": "Bahrain International Airport (IATA: BAH, ICAO: OBBI) (Arabic: مطار البحرين الدولي, romanized: Maṭār al-Baḥrayn al-dwalī) is the international airport \nof Bahrain. Located on Muharraq Island, adjacent to the capital Manama and the city Al Muharraq, it serves as the \nhub for the national carrier Gulf Air. The airport is managed by the Bahrain Airport Company. ",
        "source": "https://en.wikipedia.org/wiki/Bahrain_International_Airport"
    },
    "OEDF": {
        "text": "King Fahd International Airport (Arabic: مطار الملك فهد الدولي; abbr. KFIA) (IATA: DMM, ICAO: OEDF), also known as Dammam \nInternational Airport or simply Dammam Airport or King Fahd Airport, is the international airport serving Dammam, Saudi Arabia. The airport \nis located 31 kilometres (19 miles) northwest of downtown Dammam and is named after the former King of Saudi Arabia, \nFahd ibn Abdulaziz (1921–2005). ",
        "source": "https://en.wikipedia.org/wiki/King_Fahd_International_Airport"
    },
    "OEDR": {
        "text": "King Abdulaziz Air Base (Arabic: قاعدة الملك عبدالعزيز الجوية) (IATA: DHA, ICAO: OEDR), also known as Dhahran Air Base \nand formerly Dhahran International Airport, Dhahran Airport and Dhahran Airfield, is a Royal Saudi Air Force base located in Dhahran \nin the Eastern Province, Saudi Arabia. Located west of Thuqbah and 7 km (4 mi) southeast of the Saudi Aramco \nDhahran Camp, the airbase was the first Saudi Arabian airport to be constructed, in 1961, and is under the command \nof Air vice-marshal Prince Turki bin Bandar bin Abdulaziz Al Saud. The airbase was initially built and operated by the \nUnited States Air Force from 1945 until 1962 and was known as the Dhahran Airfield. ",
        "source": "https://en.wikipedia.org/wiki/King_Abdulaziz_Air_Base"
    },
    "OEJN": {
        "text": "King Abdulaziz International Airport (IATA: JED, ICAO: OEJN, colloquially referred to as Jeddah Airport, Jeddah International Airport, or KAIA), \nis a major international airport serving the cities of Jeddah and Mecca in Saudi Arabia, located 19 kilometres (12 mi) \nnorth of Jeddah and covering an area of 105 square kilometres (41 sq mi). The airport is the busiest in \nthe kingdom and the third-largest by land area. Opened in 1981, it was built to replace the now-demolished Kandara Airport \nand is named after the founder of Saudi Arabia, King Abdulaziz. ",
        "source": "https://en.wikipedia.org/wiki/King_Abdulaziz_International_Airport"
    },
    "OEMA": {
        "text": "Prince Mohammad bin Abdulaziz International Airport (Arabic: مطار الأمير محمد بن عبد العزيز الدولي) or Medina Airport (IATA: MED, \nICAO: OEMA) is a regional airport in Medina, Saudi Arabia. Opened in 1950, it handles domestic flights, while it has \nscheduled international services to regional destinations such as Cairo, Dubai, Istanbul and Kuwait City. Medina Airport also handles charter international \nflights during the Hajj and Umrah seasons. ",
        "source": "https://en.wikipedia.org/wiki/Prince_Mohammad_bin_Abdulaziz_International_Airport"
    },
    "OERK": {
        "text": "King Khalid International Airport (Arabic: مطار الملك خالد الدولي Maṭār al-Malik Khālid al-Duwaliyy, IATA: RUH, ICAO: OERK) is an \ninternational airport located about 35 kilometres (22 mi) north of Riyadh, Saudi Arabia, designed by the architectural firm HOK, and \nArabian Bechtel Company Limited served as the construction manager on behalf of the Saudi government. This airport consists of five \npassenger terminals (only three of which are in use), with eight aero-bridges each, a mosque, covered and uncovered car parking \nfor 11,600 vehicles, an additional Royal Terminal (for the kingdom's guests, government heads, and Saudi royal family use), a central \ncontrol tower (one of the world's tallest), and two parallel runways, each 4,260 metres (13,980 ft) long. Formerly the largest \nairport in the world in terms of ground area, the land area allocated for KKIA is the second-largest in the \nworld, after King Fahd International Airport. ",
        "source": "https://en.wikipedia.org/wiki/King_Khalid_International_Airport"
    },
    "OIIE": {
        "text": "Imam Khomeini International Airport (IATA: IKA, ICAO: OIIE) (Persian: فرودگاه بین‌المللی امام خمینی) is the international airport of Tehran, \nthe capital of Iran. It is located 2 kilometers (1 mi) of Vahnabad and 35 kilometres (22 mi) southwest of \nTehran and is named for Ruhollah Khomeini, Iran's first supreme leader. The airport is operated by Imam Khomeini Airport City \nCompany. ",
        "source": "https://en.wikipedia.org/wiki/Imam_Khomeini_International_Airport"
    },
    "OIII": {
        "text": "Mehrabad Airport (Persian: فرودگاه بین المللی مهرآباد, Foroudgâh-e Beyn Almelali-ye Mehrâbâd) (IATA: THR, ICAO: OIII) is an airport serving \nTehran, the capital city of Iran. Prior to the construction of the larger Imam Khomeini International Airport in 2007, Mehrabad \nwas Tehran's primary airport for both international and domestic traffic, but now serves only domestic flights. Despite this, in 2016, \nMehrabad Airport was the busiest airport in Iran in terms of passengers, handling 16,678,351 passengers in total. ",
        "source": "https://en.wikipedia.org/wiki/Mehrabad_International_Airport"
    },
    "OIMM": {
        "text": "Mashhad International Airport (Persian: فرودگاه بین‌المللی مشهد) (IATA: MHD, ICAO: OIMM) is an international airport located in Mashhad, Razavi \nKhorasan, Iran. ",
        "source": "https://en.wikipedia.org/wiki/Mashhad_Shahid_Hasheminejad_International_Airport"
    },
    "OISS": {
        "text": "Find more data about Shiraz Shahid Dastghaib International Ai from <a id='airport-guide-link' href='https://airportguide.com/airport/info/SYZ'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/SYZ"
    },
    "OJAI": {
        "text": "Queen Alia International Airport (IATA: AMM, ICAO: OJAI) (Arabic: مطار الملكة علياء الدولي, romanized: Maṭār al-Malika ʿAlyāʾ ad-Dawaliyy) is \nan international airport located in Zizya, 30 kilometers (18 miles) south of Amman, the capital city of Jordan, as well \nas the largest city in the nation. It is the largest airport in the country, named after Queen Alia, who \ndied in a helicopter crash in 1977. The airport is home to the country's national flag carrier, Royal Jordanian Airlines, \nand serves as a significant hub for Jordan Aviation. ",
        "source": "https://en.wikipedia.org/wiki/Queen_Alia_International_Airport"
    },
    "OKBK": {
        "text": "Kuwait International Airport (Arabic: مطار الكويت الدولي, IATA: KWI, ICAO: OKKK) is an international airport located in the Farwaniya \nGovernorate, Kuwait, 15.5 kilometers (9.6 mi) south of the centre of Kuwait City, spread over an area of 37.7 square \nkilometres (14.6 sq mi). It serves as the primary hub for Kuwait Airways and Jazeera Airways. A portion of the \nairport complex is designated as Abdullah Al-Mubarak Air Base, which contains the headquarters of the Kuwait Air Force, as well \nas the Kuwait Air Force Museum. ",
        "source": "https://en.wikipedia.org/wiki/Kuwait_International_Airport"
    },
    "OLBA": {
        "text": "Beirut–Rafic Hariri International Airport (Arabic: مطار رفيق الحريري الدولي بيروت, (previously known as Beirut International Airport) (IATA: BEY, ICAO: \nOLBA) is the only operational commercial airport in Lebanon. It is located in the Southern Suburbs of Beirut, Lebanon, 9 \nkilometres (5.6 mi) from the city center. The airport is the hub for Lebanon's national carrier, Middle East Airlines (MEA) \nand was the hub for the Lebanese cargo carrier TMA cargo and Wings of Lebanon before their respective collapses. ",
        "source": "https://en.wikipedia.org/wiki/Beirut%E2%80%93Rafic_Hariri_International_Airport"
    },
    "OM-0003": {
        "text": "Duqm Airport (IATA: DQM, ICAO: OODQ) is an airport serving the Arabian Sea port of Duqm in the Al \nWusta Region of Oman. Duqm Airport kicked off its operations, on July 23, 2014, to serve passengers between Duqm and \nMuscat through a temporary building. However, on September 17, 2018, the passenger terminal, which can accommodate 500,000 passengers annually, started \nits operations. ",
        "source": "https://en.wikipedia.org/wiki/Duqm_Airport"
    },
    "OMAA": {
        "text": "Zayed International Airport (IATA: AUH, ICAO: OMAA) (Arabic: مطار زايد الدولي), also known as Abu Dhabi International Airport, is \nthe primary international airport serving Abu Dhabi, the capital of the United Arab Emirates (UAE). It is the second busiest \nairport in the UAE after Dubai International Airport, and is the hub for Etihad Airways as well as an operating \nbase for Wizz Air Abu Dhabi and Air Arabia Abu Dhabi. The airport is located 16.5 nautical miles (30.6 km; \n19.0 mi) east of Abu Dhabi, and covers an area of 15,000 acres (6,000 ha). ",
        "source": "https://en.wikipedia.org/wiki/Zayed_International_Airport"
    },
    "OMDB": {
        "text": "Dubai International Airport (IATA: DXB, ICAO: OMDB) (Arabic: مطار دبي الدولي) is the primary and is a major international \nairport serving Dubai, United Arab Emirates, and is the world's busiest airport by international passenger traffic. It is also the \nsecond-busiest airport in the world by passenger traffic, the busiest airport for Airbus A380 and Boeing 777 movements, and the \nairport with the highest average number of passengers per flight. In 2023, the airport handled 87 million passengers and 1.81 \nmillion tonnes of cargo and registered 416,405 aircraft movements. ",
        "source": "https://en.wikipedia.org/wiki/Dubai_International_Airport"
    },
    "OMDW": {
        "text": "Al Maktoum International Airport (IATA: DWC, ICAO: OMDW), also known as Dubai World Central, is an international airport in \nJebel Ali, 37 kilometres (23 mi) southwest of Dubai, United Arab Emirates, that opened on June 27, 2010. It is \nthe main part of Dubai South, a planned residential, commercial and logistics complex. When fully completed (originally expected 2027, now \nin 2030), the airport will contain transport modes, logistics, and value-added services, including manufacturing and assembly, in a single free \neconomic zone. ",
        "source": "https://en.wikipedia.org/wiki/Al_Maktoum_International_Airport"
    },
    "OMSJ": {
        "text": "Sharjah International Airport (Arabic: مطار الشارقة, romanized: Maṭār aš-Šāriqa) (IATA: SHJ, ICAO: OMSJ) is an international airport located 7 \nnautical miles (13 km; 8.1 mi) east-southeast of Sharjah, United Arab Emirates. It is spread over an area of 15,200,000 \nm2 (3,800 acres). It has one runway, and is the only airport in Sharjah capable of international flights as of \n2022. ",
        "source": "https://en.wikipedia.org/wiki/Sharjah_International_Airport"
    },
    "OOMS": {
        "text": "Muscat International Airport (IATA: MCT, ICAO: OOMS), formerly Seeb International Airport, is the main international airport in Oman and \nis located in Seeb, 32 km from the old city and capital Muscat within the Muscat metropolitan area. The airport \nserves as the hub for flag carrier Oman Air and Oman's first budget airline, Salam Air, and features flights to \nseveral regional destinations as well as some intercontinental services to Asia, Africa and Europe. ",
        "source": "https://en.wikipedia.org/wiki/Muscat_International_Airport"
    },
    "OPIS": {
        "text": "Islamabad International Airport (Urdu: اسلام آباد بین الاقوامی ہوائی اڈا) (IATA: ISB, ICAO: OPIS) (also known as Gandhara International \nAirport) is the international airport serving Islamabad, the capital city of Pakistan and Rawalpindi. It is located 25 km (16 \nmi) south-west of the city, and is accessed via Srinagar Highway. The airport commenced full operations in 6 May 2018, \nreplacing the defunct Benazir Bhutto International Airport which now forms part of the PAF Base Nur Khan. ",
        "source": "https://en.wikipedia.org/wiki/Islamabad_International_Airport"
    },
    "OPKC": {
        "text": "Jinnah International Airport (Urdu: جناح بین الاقوامی ہوائی اڈا) (IATA: KHI, ICAO: OPKC), formerly Drigh Road Airport or Karachi \nCivil Airport, is Pakistan's busiest international and domestic airport, and handled 7,267,582 passengers in 2017–2018. Located in Karachi, the largest \ncity and commercial capital of Pakistan and capital of the province of Sindh, it is named after Muhammad Ali Jinnah, \nthe statesman founder of Pakistan. It is one of the oldest airports in the world. ",
        "source": "https://en.wikipedia.org/wiki/Jinnah_International_Airport"
    },
    "ORBI": {
        "text": "Baghdad International Airport (IATA: BGW, ICAO: ORBI), previously Saddam International Airport from 1982 to 2003, (IATA: SDA, ICAO: ORBS) \n(Arabic: مطار بغداد الدولي, romanized: Maṭār Baġdād ad-Dawaliyy) is Iraq's largest international airport, located in a suburb about 16 km \n(9.9 mi) west of downtown Baghdad in the Baghdad Governorate. It is the home base for Iraq's national airline, Iraqi \nAirways. ",
        "source": "https://en.wikipedia.org/wiki/Baghdad_International_Airport"
    },
    "OSDI": {
        "text": "Damascus International Airport (Arabic: مَطَار دِمَشْق الدَّوْلِيّ, romanized: Maṭār Dimašq ad-Duwaliyy) (IATA: DAM, ICAO: OSDI) is the international airport \nof Damascus, the capital of Syria. Inaugurated in the mid-1970s, it also was the country's busiest airport. In 2010, an \nestimated 5.5 million passengers used the airport, an increase of more than 50% since 2004. ",
        "source": "https://en.wikipedia.org/wiki/Damascus_International_Airport"
    },
    "OTHH": {
        "text": "Hamad International Airport (IATA: DOH, ICAO: OTHH) (Arabic: مطار حمد الدولي, Maṭār Ḥamad al-Duwalī) is an international airport in \nQatar, and the home of the national flag carrier airline, Qatar Airways. Located east of the capital, Doha, it replaced \nthe nearby Doha International Airport as Qatar's principal and main national airport. Hamad International Airport is currently rated as the \n\"World's Best Airport\" by Skytrax, and now holds \"Best Airport in the Middle East\" for the 10th time. ",
        "source": "https://en.wikipedia.org/wiki/Hamad_International_Airport"
    },
    "PAFA": {
        "text": "Fairbanks International Airport (IATA: FAI, ICAO: PAFA, FAA LID: FAI) is a state-owned public-use airport located three miles (5 \nkm) southwest of the central business district of Fairbanks, a city in the Fairbanks North Star Borough of the United \nStates state of Alaska. It is located in the South Van Horn census-designated place. Fairbanks was the smallest city in \nthe United States with regularly scheduled non-stop international flights, as Condor offered weekly flights to Frankfurt during the summer tourist \nseason. ",
        "source": "https://en.wikipedia.org/wiki/Fairbanks_International_Airport"
    },
    "PANC": {
        "text": "Ted Stevens Anchorage International Airport (IATA: ANC, ICAO: PANC, FAA LID: ANC) is a major airport in the U. \nS. state of Alaska, located 5 miles (8 km) southwest of downtown Anchorage. ",
        "source": "https://en.wikipedia.org/wiki/Ted_Stevens_Anchorage_International_Airport"
    },
    "PGUM": {
        "text": "Antonio B. Won Pat International Airport (IATA: GUM, ICAO: PGUM), also known as Guam International Airport, is an airport \nlocated in Tamuning and Barrigada, three miles (4.8 km) east of the capital city of Hagåtña (formerly Agana) in the \nUnited States territory of Guam. The airport is a hub for Asia Pacific Airlines and for United Airlines, serving as \nthe latter's Pacific Ocean hub. ",
        "source": "https://en.wikipedia.org/wiki/Antonio_B._Won_Pat_International_Airport"
    },
    "PHNL": {
        "text": "Daniel K. Inouye International Airport (IATA: HNL, ICAO: PHNL, FAA LID: HNL), also known as Honolulu International Airport, is \nthe main and largest airport in Hawaii. The airport is named after Honolulu native and Medal of Honor recipient Daniel \nInouye, who represented Hawaii in the United States Senate from 1963 until his death in 2012. ",
        "source": "https://en.wikipedia.org/wiki/Daniel_K._Inouye_International_Airport"
    },
    "RCKH": {
        "text": "Kaohsiung International Airport (高雄國際機場) (IATA: KHH, ICAO: RCKH) is a medium-sized international airport in Siaogang District, Kaohsiung, Taiwan, also \nknown as Siaogang Airport (小港機場; Xiǎogǎng jīchǎng). With nearly seven million passengers in 2018, it is the second busiest airport \nin Taiwan, after Taoyuan. The airport has a single east–west runway and two terminals: one international and one domestic. ",
        "source": "https://en.wikipedia.org/wiki/Kaohsiung_International_Airport"
    },
    "RCTP": {
        "text": "Taiwan Taoyuan International Airport (IATA: TPE, ICAO: RCTP), also sometimes referred to as Taipei-Taoyuan International Airport, is an international \nairport situated in Taoyuan City which serves the entire northern Taiwan region including the capital city Taipei. Located about 40 \nkm (25 mi) west of the capital Taipei in Dayuan District, Taoyuan, the airport is the busiest and largest in \nTaiwan. In 2016, it was ranked the best airport for its size in the Asia-Pacific region by Airports Council International. ",
        "source": "https://en.wikipedia.org/wiki/Taoyuan_International_Airport"
    },
    "RJAA": {
        "text": "Narita International Airport (成田国際空港, Narita Kokusai Kūkō) (IATA: NRT, ICAO: RJAA), also known as Tokyo-Narita International Airport, formerly and \noriginally known as New Tokyo International Airport (新東京国際空港, Shin Tōkyō Kokusai Kūkō), is one of two international airports serving the \nGreater Tokyo Area, the other one being Haneda Airport (HND). It is about 60 kilometers (37 mi) east of central \nTokyo in Narita, Chiba. The facility since July 2019, covers 1,137 hectares (2,810 acres) of land and there are future \nplans to expand to nearly 1,200 ha (3,000 acres). ",
        "source": "https://en.wikipedia.org/wiki/Narita_International_Airport"
    },
    "RJBB": {
        "text": "Find more data about Kansai International Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/KIX'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/KIX"
    },
    "RJCC": {
        "text": "New Chitose Airport (新千歳空港, Shin-Chitose Kūkō) (IATA: CTS, ICAO: RJCC) is an international airport located 2.7 nautical miles (5.0 \nkm; 3.1 mi) south-southeast of Chitose and Tomakomai, Hokkaidō, Japan, serving the Sapporo metropolitan area. By both traffic and land \narea, it is the largest airport in Hokkaidō. It is adjacent to Chitose Air Base, a Japan Air Self-Defense Force \nbase which houses F-15 Eagle fighter jets, the Japanese Air Force One government aircraft and a number of smaller emergency \nresponse aircraft and helicopters. ",
        "source": "https://en.wikipedia.org/wiki/New_Chitose_Airport"
    },
    "RJFF": {
        "text": "Fukuoka Airport (福岡空港, Fukuoka Kūkō) (IATA: FUK, ICAO: RJFF), formerly known as Itazuke Air Base, is an international and \ndomestic airport located 1.6 NM (3.0 km; 1.8 mi) east of Hakata Station in Hakata-ku, Fukuoka, Japan. The facility has \none 2,800 m (9,186 ft) runway and covers 355 hectares (877 acres) of land. Fukuoka Airport is the principal airport \non the island of Kyushu and is the fourth busiest passenger airport in Japan. ",
        "source": "https://en.wikipedia.org/wiki/Fukuoka_Airport"
    },
    "RJFK": {
        "text": "Kagoshima Airport (鹿児島空港, Kagoshima Kūkō) (IATA: KOJ, ICAO: RJFK) is an airport located in Kirishima, Kagoshima Prefecture, Japan, 29.6 \nkm (18.4 mi) northeast of Kagoshima-Chūō Station in Kagoshima City. It is the second-busiest airport in Kyushu after Fukuoka Airport. \nThe airport covers 187.7 hectares (464 acres) and has one 3000m runway. ",
        "source": "https://en.wikipedia.org/wiki/Kagoshima_Airport"
    },
    "RJGG": {
        "text": "Chubu Centrair International Airport (中部国際空港, Chūbu Kokusai Kūkō) (IATA: NGO, ICAO: RJGG) is an international airport on an artificial \nisland (which also houses the Aichi International Exhibition Center) in Ise Bay, Tokoname City in Aichi Prefecture, 35 km (22 \nmi) south of Nagoya in central Japan. The airport covers about 470 hectares (1,161 acres) of land and has one \n3,500m runway. Centrair is classified as a first class airport and is the main international gateway for the Chubu (\"central\") \nregion of Japan. ",
        "source": "https://en.wikipedia.org/wiki/Chubu_Centrair_International_Airport"
    },
    "RJOO": {
        "text": "Osaka International Airport (大阪国際空港, Ōsaka Kokusai Kūkō) (IATA: ITM, ICAO: RJOO), often referred to as Itami Airport (伊丹空港, Itami \nKūkō), is the primary regional airport for the Kansai region of Japan, including the major cities of Osaka, Kyoto and \nKobe. Classified as a first class airport, it is the airport closest to Kyoto, 36 kilometres (22 mi) southwest of \nKyoto Station. Itami Airport has a small footprint, covering only 311 hectares (768 acres) of land. ",
        "source": "https://en.wikipedia.org/wiki/Itami_Airport"
    },
    "RJSS": {
        "text": "Sendai Airport (仙台空港, Sendai Kūkō) (IATA: SDJ, ICAO: RJSS) is an international airport located in the city of Natori, \nMiyagi, 13.6 km (8.5 mi) south southeast of Sendai metropolis, Sendai, Japan. The airport is alternatively referred to as Sendai \nInternational Airport (仙台国際空港, Sendai Kokusai Kūkō). Operations at Sendai consist primarily of domestic flights to other airports in Japan, with \na handful of flights to cities in the Far East. ",
        "source": "https://en.wikipedia.org/wiki/Sendai_Airport"
    },
    "RJTT": {
        "text": "Haneda Airport (羽田空港, Haneda Kūkō) (IATA: HND, ICAO: RJTT), sometimes referred to as Tokyo-Haneda, is one of two international \nairports serving the Greater Tokyo Area, the other one being Narita International Airport (NRT). It serves as the primary base \nof Japan's two largest airlines, Japan Airlines (Terminal 1) and All Nippon Airways (Terminal 2), as well as RegionalPlus Wings \nCorp. (Air Do and Solaseed Air), Skymark Airlines, and StarFlyer. ",
        "source": "https://en.wikipedia.org/wiki/Haneda_Airport"
    },
    "RJTY": {
        "text": "Yokota Air Base (横田飛行場, Yokota Hikōjō), (IATA: OKO, ICAO: RJTY) is a Japan Air Self-Defense Force (JASDF) and United \nStates Air Force (USAF) base in the Tama Area, or Western Tokyo. It occupies portions of Akishima, Fussa, Hamura, Mizuho, \nMusashimurayama, and Tachikawa. The base houses 14,000 personnel. ",
        "source": "https://en.wikipedia.org/wiki/Yokota_Air_Base"
    },
    "RKJB": {
        "text": "Muan International Airport (Korean: 무안국제공항; Hanja: 務安國際空港; RR: Muan Gukje Gonghang; MR: Muan Kukche Konghang) (IATA: MWX, ICAO: RKJB) \nis an airport in Muan County, Jeollanam-do, South Korea. Construction of the airport began in 1997 and the airport opened \non November 9, 2007. The airport serves the province of Jeollanam-do, especially the cities of Gwangju, Mokpo and Naju. ",
        "source": "https://en.wikipedia.org/wiki/Muan_International_Airport"
    },
    "RKPC": {
        "text": "Jeju International Airport (Korean: 제주국제공항; Hanja: 濟州國際空港; RR: Jeju Gukje Gonghang; MR: Cheju Kukche Konghang) (IATA: CJU, ICAO: RKPC) \nis the second largest airport in South Korea, just behind Incheon Airport in Incheon (near Seoul). It is located in \nthe city of Jeju. The airport opened in 1968. ",
        "source": "https://en.wikipedia.org/wiki/Jeju_International_Airport"
    },
    "RKPK": {
        "text": "Gimhae International Airport (IATA: PUS, ICAO: RKPK) is located on the western end of Busan, South Korea. Opened in \n1976, the airport is named after the nearby city of Gimhae. A new international terminal opened on October 31, 2007. ",
        "source": "https://en.wikipedia.org/wiki/Gimhae_International_Airport"
    },
    "RKSI": {
        "text": "Incheon International Airport (IATA: ICN, ICAO: RKSI) is the main international airport serving Seoul, the capital of South Korea. \nIt is also one of the largest and busiest airports in the world. As of 2021, the airport has been \nrated by Skytrax as the fourth-best airport in the world. ",
        "source": "https://en.wikipedia.org/wiki/Incheon_International_Airport"
    },
    "RKSS": {
        "text": "Gimpo International Airport (IATA: GMP, ICAO: RKSS) (sometimes referred to as Seoul–Gimpo International Airport), formerly rendered in English as \nKimpo International Airport, is located in the far western end of Seoul, some 15 km (9 mi) west of the \nCentral District of Seoul. Gimpo was the main international airport for Seoul and South Korea before being replaced by Incheon \nInternational Airport in 2001. It now functions as Seoul's secondary airport. ",
        "source": "https://en.wikipedia.org/wiki/Gimpo_International_Airport"
    },
    "ROAH": {
        "text": "Naha Airport (那覇空港, Naha Kūkō) (IATA: OKA, ICAO: ROAH) is a second class airport located 4 km (2.5 mi) \nwest of the city hall in Naha, Okinawa. It is Japan's seventh busiest airport and the primary air terminal for \npassengers and cargo traveling to and from Okinawa Prefecture, Japan. It handles scheduled international traffic to Taiwan, Hong Kong, South \nKorea, Thailand, Singapore and mainland China. ",
        "source": "https://en.wikipedia.org/wiki/Naha_Airport"
    },
    "RODN": {
        "text": "Kadena Air Base (嘉手納飛行場, Kadena Hikōjō) (IATA: DNA, ICAO: RODN) is a United States Air Force base in the \ntowns of Kadena and Chatan and the city of Okinawa, in Okinawa Prefecture, Japan. It is often referred to as \nthe \"Keystone of the Pacific\" because of its highly strategic location. It is located 650 km (400 mi) off the \ncoast of China and at a distance of 770 km (480 mi) from Shanghai, a major economic hub. ",
        "source": "https://en.wikipedia.org/wiki/Kadena_Air_Base"
    },
    "RPLL": {
        "text": "Ninoy Aquino International Airport (NAIA NA-YAH, locally NA-ee-YAH; Tagalog pronunciation: [ˈnɐʔia]; Filipino: Paliparang Pandaigdig ng Ninoy Aquino; IATA: MNL, \nICAO: RPLL), originally known as Manila International Airport (MIA), is the main international airport serving Metro Manila in the Philippines. \nLocated between the cities of Pasay and Parañaque, about 7 kilometers (4.3 mi) south of Manila proper and southwest of \nMakati, it is the main gateway for travelers to the Philippines and serves as a hub for PAL Express, and \nPhilippine Airlines. It is also the main operating base for AirSWIFT, Cebgo, Cebu Pacific, and Philippines AirAsia. ",
        "source": "https://en.wikipedia.org/wiki/Ninoy_Aquino_International_Airport"
    },
    "RPMD": {
        "text": "Francisco Bangoy International Airport (IATA: DVO, ICAO: RPMD), also commonly known as Davao International Airport, is the main airport \nserving Davao City and Davao Region in the Philippines. Serving as the main gateway to Mindanao, it is the busiest \nairport on the island and the third busiest in the Philippines in 2022. . ",
        "source": "https://en.wikipedia.org/wiki/Francisco_Bangoy_International_Airport"
    },
    "RPVM": {
        "text": "Mactan–Cebu International Airport (IATA: CEB, ICAO: RPVM) is an international airport serving Cebu and serves as the main gateway \nto the Central Visayas region in the Philippines. Located on a 797-hectare (1,970-acre) site in Lapu-Lapu City on Mactan, it \nis the second busiest airport in the Philippines. Opened on April 27, 1966, the airport serves as a hub for \nPhilippine Airlines, and as an operating base for Cebu Pacific and Philippines AirAsia. ",
        "source": "https://en.wikipedia.org/wiki/Mactan%E2%80%93Cebu_International_Airport"
    },
    "RU-0016": {
        "text": "Lipetsk Air Base (also given as Lipetskiy, Lipetsky, Lipetsk-2, Shakhm 10, and Lipetsk West) is an air base in \nLipetsk Oblast, Russia located 12 km northwest of Lipetsk. It is the combat training center of Russian Aerospace Forces, analogous \nto the United States Air Force's Nellis Air Force Base. The base is made up of two medium-sized airfields joined \ntogether. ",
        "source": "https://en.wikipedia.org/wiki/Lipetsk_(air_base)"
    },
    "RU-0035": {
        "text": "Grozny Airport (Chechen: Соьлжа-ГӀалан аэропорт, Russian: Аэропорт «Грозный») (IATA: GRV, ICAO: URMG) is an international airport in Chechen Republic, \nRussia located 7.5 km north of Grozny. ",
        "source": "https://en.wikipedia.org/wiki/Kadyrov_Grozny_International_Airport"
    },
    "RU-4464": {
        "text": "Olenya (also Olenegorsk) has been a major Russian Navy reconnaissance base, located on the Kola Peninsula 92 km south \nof Murmansk. As of 2020, units at the base are subordinate to the Long-Range Aviation branch of the Russian Aerospace \nForces. The base and its staff settlement (Vysoky, Murmansk Oblast), across Lake Permusozero from the city of Olenegorsk, are served \nby the Olenegorsk rail station (formerly Olenya station). ",
        "source": "https://en.wikipedia.org/wiki/Olenya_(air_base)"
    },
    "SABE": {
        "text": "Jorge Newbery Airfield (IATA: AEP, ICAO: SABE), commonly known as Aeroparque, is an international airport 2 km (1.2 mi) \nnorthwest of downtown Buenos Aires, Argentina. The airport covers an area of 138 hectares (341 acres) and is operated by \nAeropuertos Argentina 2000 S. A. ",
        "source": "https://en.wikipedia.org/wiki/Aeroparque_Jorge_Newbery"
    },
    "SAEZ": {
        "text": "Ministro Pistarini International Airport (Spanish: Aeropuerto Internacional Ministro Pistarini) (IATA: EZE, ICAO: SAEZ), also known as Ezeiza International Airport \nowing to its location in Ezeiza in Greater Buenos Aires, is an international airport 22 kilometres (14 mi) south-southwest of \nthe autonomous city of Buenos Aires, the capital city of Argentina. Covering 3,475 hectares (13.42 sq mi; 8,590 acres), it \nis one of two commercial airports serving Buenos Aires and its metropolitan area, along with Aeroparque Jorge Newbery. Pistarini Airport \nis the country's largest international airport by number of passengers handled—85% of international traffic—and is a hub for international flights \nof Aerolíneas Argentinas, which operates domestic services from the airport as well. ",
        "source": "https://en.wikipedia.org/wiki/Ministro_Pistarini_International_Airport"
    },
    "SBBE": {
        "text": "Find more data about Val de Cans/Júlio Cezar Ribeiro Internat from <a id='airport-guide-link' href='https://airportguide.com/airport/info/BEL'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/BEL"
    },
    "SBBR": {
        "text": "Juscelino Kubitschek de Oliveira (Portuguese pronunciation: [ʒuseˈlinu kubiˈʃɛk(i) dʒi oliˈve(j)ɾɐ]; 12 September 1902 – 22 August 1976), also known \nby his initials JK, was a prominent Brazilian politician who served as the 21st president of Brazil from 1956 to \n1961. His term was marked by economic prosperity and political stability, being most known for the construction of a new \ncapital, Brasília. ",
        "source": "https://en.wikipedia.org/wiki/Juscelino_Kubitschek"
    },
    "SBCF": {
        "text": "Belo Horizonte/Confins–Tancredo Neves International Airport, formerly called Confins International Airport, is the primary international airport serving Belo Horizonte, located \nin the municipality of Confins. Since 2 September 1986, the airport is named after Tancredo de Almeida Neves (1910–1985), President-elect \nof Brazil. It is operated by BH Airport S. ",
        "source": "https://en.wikipedia.org/wiki/Belo_Horizonte_International_Airport"
    },
    "SBEG": {
        "text": "Manaus–Eduardo Gomes International Airport (IATA: MAO, ICAO: SBEG) is an international airport serving Manaus, Brazil. On December 11, 1973, \nwhile still under construction, the name of the facility was changed from Supersonic Airport of Manaus (owing to its design \nenabling Concorde operations) to Eduardo Gomes International Airport, celebrating the Brazilian politician and military figure Air Marshal Eduardo Gomes (1896–1981). \nIt is operated by Vinci Airports. ",
        "source": "https://en.wikipedia.org/wiki/Eduardo_Gomes_International_Airport"
    },
    "SBFL": {
        "text": "Florianópolis–Hercílio Luz International Airport (IATA: FLN, ICAO: SBFL), branded Floripa Airport, is the airport serving Florianópolis, Brazil. It is \nnamed after Hercílio Pedro da Luz (1860–1924), three times governor of the state of Santa Catarina and senator. It is \noperated by Zurich Airport Brasil. ",
        "source": "https://en.wikipedia.org/wiki/Herc%C3%ADlio_Luz_International_Airport"
    },
    "SBGL": {
        "text": "Rio de Janeiro/Galeão–Antonio Carlos Jobim International Airport (IATA: GIG, ICAO: SBGL), popularly known by its original name Galeão International \nAirport, is the main international airport serving Rio de Janeiro, Brazil. The airport was originally named after the neighborhood of \nGaleão: Praia do Galeão (Galleon Beach) is located in front of the original passenger terminal (the present passenger terminal of \nthe Brazilian Air Force). This beach is the location where the galleon Padre Eterno was built in 1663. ",
        "source": "https://en.wikipedia.org/wiki/Rio_de_Janeiro/Gale%C3%A3o_International_Airport"
    },
    "SBGR": {
        "text": "São Paulo/Guarulhos–Governor André Franco Montoro International Airport (IATA: GRU, ICAO: SBGR), commonly known as São Paulo/Guarulhos International Airport, is \nthe primary international airport serving São Paulo. It is popularly known locally as either Cumbica Airport, after the district where \nit is located and the Brazilian Air Force base that exists at the airport complex, or Guarulhos Airport, after the \nmunicipality of Guarulhos, in the state of São Paulo, where it is located. Since November 28, 2001, the airport has \nbeen named after André Franco Montoro (1916–1999), former Governor of São Paulo state. ",
        "source": "https://en.wikipedia.org/wiki/S%C3%A3o_Paulo/Guarulhos_International_Airport"
    },
    "SBSV": {
        "text": "Find more data about Deputado Luiz Eduardo Magalhães Internat from <a id='airport-guide-link' href='https://airportguide.com/airport/info/SSA'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/SSA"
    },
    "SCEL": {
        "text": "Arturo Merino Benítez International Airport (IATA: SCL, ICAO: SCEL), also known as Santiago International Airport and Nuevo Pudahuel Airport, \nlocated in Pudahuel, 15 km (9.3 mi) north-west of central Santiago, is Chile's largest aviation facility and busiest international airport. \nArturo Merino Benítez International Airport has domestic and international services to destinations in Europe, Oceania, Africa (cargo only), Asia and \nthe Americas. In 2011, it was the ninth busiest airport in Latin America and the sixth busiest in South America \nby passenger traffic. ",
        "source": "https://en.wikipedia.org/wiki/Arturo_Merino_Ben%C3%ADtez_International_Airport"
    },
    "SEGU": {
        "text": "José Joaquín de Olmedo International Airport (Spanish: Aeropuerto Internacional José Joaquín de Olmedo; IATA: GYE, ICAO: SEGU) is an \ninternational airport serving Guayaquil, the capital of the Guayas Province and the most populous city in Ecuador. It is the \nsecond busiest airport in Ecuador. The airport was named after José Joaquín de Olmedo, a notable Ecuadorian poet, first mayor \nof Guayaquil, and former president of Ecuador. ",
        "source": "https://en.wikipedia.org/wiki/Jos%C3%A9_Joaqu%C3%ADn_de_Olmedo_International_Airport"
    },
    "SEQM": {
        "text": "Mariscal Sucre International Airport (IATA: UIO, ICAO: SEQM) is an international airport serving Quito, Ecuador. It is the busiest \nairport in Ecuador. It is located in the Tababela parish, about 18 kilometres (11 mi) east of Quito, and because \nof its location it is also colloquially known as Tababela Airport. ",
        "source": "https://en.wikipedia.org/wiki/Mariscal_Sucre_International_Airport"
    },
    "SKBO": {
        "text": "El Dorado International Airport (IATA: BOG, ICAO: SKBO) is an international airport serving Bogotá, Colombia, and its surrounding areas. \nThe airport is located mostly in the Fontibón district of Bogotá, although it partially extends into the Engativá district and \nthrough the municipality of Funza in the Western Savanna Province of the Cundinamarca Department. It served over 39 million passengers \nin 2023 making it the second busiest airport in South America and 3rd overall in Latin America in terms of \npassenger traffic, as well as being the 32nd busiest airport in the world in 2022. ",
        "source": "https://en.wikipedia.org/wiki/El_Dorado_International_Airport"
    },
    "SLVR": {
        "text": "Viru Viru International Airport (IATA: VVI, ICAO: SLVR) in Santa Cruz de la Sierra is Bolivia's largest international airport. \nViru Viru handles domestic, regional, and international flights from Bolivia, North America, South America and Europe and serves as a \nfocus city for Bolivia's biggest airline Boliviana de Aviación. The airport is able to handle large aircraft such as the \nBoeing 747-400, Airbus A340-600 and Boeing 777-300ER. ",
        "source": "https://en.wikipedia.org/wiki/Viru_Viru_International_Airport"
    },
    "SMJP": {
        "text": "Johan Adolf Pengel International Airport (IATA: PBM, ICAO: SMJP), also known as Paramaribo-Zanderij International Airport, and locally referred to \nsimply as JAP, is an airport located in the town of Zanderij and hub for airline carrier Surinam Airways, 45 \nkilometres (28 mi) south of Paramaribo. It is the larger of Suriname's two international airports, the other being Zorg en \nHoop with scheduled flights to Guyana, and is operated by Airport Management, Ltd./ NV Luchthavenbeheer. ",
        "source": "https://en.wikipedia.org/wiki/Johan_Adolf_Pengel_International_Airport"
    },
    "SOCA": {
        "text": "Cayenne – Félix Éboué Airport (French: Aéroport de Cayenne – Félix Éboué, IATA: CAY, ICAO: SOCA) is French Guiana's \nmain international airport. It is located near the commune of Matoury, 13 kilometres (8 mi) southwest of French Guiana's capital \ncity of Cayenne. It is managed by the Chamber of Commerce and Industry of French Guiana (CCI Guyane). ",
        "source": "https://en.wikipedia.org/wiki/Cayenne_%E2%80%93_F%C3%A9lix_Ebou%C3%A9_Airport"
    },
    "SPIM": {
        "text": "Jorge Chávez International Airport (IATA: LIM, ICAO: SPJC, SPIM) is the main international airport serving the Lima Metropolitan Area \nin Peru. It is located in Callao, 11 kilometers (6.8 mi) northwest of Lima Center, the nation's capital city and \n17 kilometers (11 mi) from the district of Miraflores. In 2017, the airport served 22,025,704 passengers. ",
        "source": "https://en.wikipedia.org/wiki/Jorge_Ch%C3%A1vez_International_Airport"
    },
    "SPZO": {
        "text": "Alejandro Velasco Astete International Airport (IATA: CUZ, ICAO: SPZO) is an international airport located in the city of Cusco, \nin southeastern Peru. Cusco, a principal tourist attraction in Latin America, receives various domestic flights as well as some international \nflights. The runway is completely paved. ",
        "source": "https://en.wikipedia.org/wiki/Alejandro_Velasco_Astete_International_Airport"
    },
    "SUMU": {
        "text": "Carrasco/General Cesáreo L. Berisso International Airport (IATA: MVD, ICAO: SUMU) is the main international airport of Uruguay. It is \nthe country's largest airport and is located in the Carrasco neighborhood of Montevideo. ",
        "source": "https://en.wikipedia.org/wiki/Carrasco_International_Airport"
    },
    "SVBC": {
        "text": "General José Antonio Anzoátegui International Airport (IATA: BLA, ICAO: SVBC) It is the international airport of the city of \nBarcelona, capital of the Anzoátegui State. Located in the Northeast of the country, southwest of the city center of Barcelona, \nabout 4 km away from the urban center of the city. And less than 1 km from the Caribbean Sea \n(Atlantic Ocean). ",
        "source": "https://en.wikipedia.org/wiki/General_Jos%C3%A9_Antonio_Anzo%C3%A1tegui_International_Airport"
    },
    "SVMI": {
        "text": "Maiquetía \"Simón Bolívar\" International Airport (IATA: CCS, ICAO: SVMI, Spanish: Aeropuerto Internacional de Maiquetía \"Simón Bolívar\") is an international \nairport located in Maiquetía, Vargas, Venezuela, about 21 kilometres (13 mi) west of downtown Caracas, the capital of the country. \nSimply called Maiquetía by the local population, it is the main international air passenger gateway to Venezuela. It handles flights \nto destinations in the Americas, Europe and the Middle East. ",
        "source": "https://en.wikipedia.org/wiki/Sim%C3%B3n_Bol%C3%ADvar_International_Airport_(Venezuela)"
    },
    "TAO": {
        "text": "Qingdao Jiaodong International Airport (IATA: TAO, ICAO: ZSQD) is an international airport serving the city of Qingdao in East \nChina’s Shandong province. It received approval in December 2013, and replaced Qingdao Liuting International Airport as the city's main airport. \nIt is located in Jiaodong, Jiaozhou, 39 kilometres (24 mi) from the center of Qingdao. ",
        "source": "https://en.wikipedia.org/wiki/Qingdao_Jiaodong_International_Airport"
    },
    "TFFF": {
        "text": "Martinique Aimé Césaire International Airport (French: Aéroport international de Martinique-Aimé-Césaire, pronounced [maʁtinik ɛme sezɛːʁ]) (IATA: FDF, ICAO: TFFF) is \nan international airport of Martinique in the French West Indies. Located in Le Lamentin, a suburb of the capital Fort-de-France, \nit was opened in 1950 and renamed in 2007, after author and politician Aimé Césaire. ",
        "source": "https://en.wikipedia.org/wiki/Martinique_Aim%C3%A9_C%C3%A9saire_International_Airport"
    },
    "TFFR": {
        "text": "Pointe-à-Pitre (French pronunciation: [pwɛ̃tapitʁ]; Guadeloupean Creole: Pwentapit, [pwɛ̃tapit], or simply Lapwent, [lapwɛ̃t]) is the second most populous commune of \nGuadeloupe (after Les Abymes). Guadeloupe is an overseas region and department of France located in the Lesser Antilles, of which \nit is a sous-préfecture, being the seat of the Arrondissement of Pointe-à-Pitre. Although Pointe-à-Pitre is not Guadeloupe's administrative capital (that \ndistinction goes to Basse-Terre), it is nonetheless the region's economic capital. ",
        "source": "https://en.wikipedia.org/wiki/Pointe-%C3%A0-Pitre"
    },
    "TJSJ": {
        "text": "Luis Muñoz Marín International Airport (IATA: SJU, ICAO: TJSJ, FAA LID: SJU) is a joint civil-military international airport located \nin suburban Carolina, Puerto Rico, three miles (5 km) southeast of San Juan. It is named for Luis Muñoz Marín, \nPuerto Rico's first democratically elected governor, and was known as Isla Verde International Airport (Aeropuerto Internacional de Isla Verde) until \nit was renamed in February 1985. It is the busiest airport in the Caribbean region by passenger traffic. ",
        "source": "https://en.wikipedia.org/wiki/Luis_Mu%C3%B1oz_Mar%C3%ADn_International_Airport"
    },
    "TLPL": {
        "text": "Hewanorra International Airport (IATA: UVF, ICAO: TLPL), located near Vieux Fort Quarter, Saint Lucia, in the Caribbean, is the \nlarger of Saint Lucia's two airports and is managed by the Saint Lucia Air and Seaports Authority (SLASPA). It is \non the southern cape of the island, about 53.4 km (33.2 mi) from the capital city, Castries. The airport is \na Fire Category 9 facility that handles 700,000 passengers a year and can accommodate Boeing 747, Airbus A330, Airbus A340, \nBoeing 777 and other long-range intercontinental jet aircraft. ",
        "source": "https://en.wikipedia.org/wiki/Hewanorra_International_Airport"
    },
    "TN-0002": {
        "text": "Enfidha–Hammamet International Airport (IATA: NBE, ICAO: DTNH) is an airport in Enfidha, Tunisia, located about 40 kilometres (25 miles) \nsouthwest from the town of Hammamet. The airport is mostly used by European airlines bringing travellers to Tunisian holiday resorts. \n. ",
        "source": "https://en.wikipedia.org/wiki/Enfidha%E2%80%93Hammamet_International_Airport"
    },
    "TNCA": {
        "text": "Queen Beatrix International Airport (IATA: AUA, ICAO: TNCA), (Dutch: Internationale luchthaven Koningin Beatrix; Papiamento: Aeropuerto Internacional Reina Beatrix), is \nan international airport located in Oranjestad, Aruba. It has flight services to the United States, Canada, several countries in the \nCaribbean, the northern coastal countries of South America, as well as some parts of Europe, notably the Netherlands. It is \nnamed after Beatrix of the Netherlands, who was Queen of the Netherlands from 1980 to 2013. ",
        "source": "https://en.wikipedia.org/wiki/Queen_Beatrix_International_Airport"
    },
    "TNCB": {
        "text": "Flamingo International Airport (IATA: BON, ICAO: TNCB), also called Bonaire International Airport, is an international airport located near Kralendijk \non the island of Bonaire in the Caribbean Netherlands. It was once the hub for BonaireExel and CuraçaoExel before they \nwere rebranded as Dutch Antilles Express, and served as a secondary hub for Dutch Antilles Express and Insel Air. The \nairport is the fourth largest in the Dutch Caribbean, after Queen Beatrix International Airport on Aruba, Princess Juliana International Airport \non Sint Maarten and Curaçao International Airport on Curaçao and is now the largest airport in the Caribbean Netherlands, with \nF. ",
        "source": "https://en.wikipedia.org/wiki/Flamingo_International_Airport"
    },
    "TNCC": {
        "text": "Curaçao International Airport (IATA: CUR, ICAO: TNCC), (Papiamento: Aeropuerto Internashonal Hato, Dutch: Hato Internationale Luchthaven) also known as Hato \nInternational Airport (formerly Dr. Albert Plesman International Airport), is the only airport for the island of Curaçao. The airport is \nlocated on the north coast of Curaçao, 12 kilometres (7.5 mi) from the capital Willemstad. ",
        "source": "https://en.wikipedia.org/wiki/Cura%C3%A7ao_International_Airport"
    },
    "TNCM": {
        "text": "Princess Juliana International Airport (IATA: SXM, ICAO: TNCM) is the main airport on the Caribbean island of Saint Martin. \nThe airport is located on the Dutch side of the island, in the country of Sint Maarten, close to the \nshore of Simpson Bay Lagoon. In 2015, the airport handled 1,829,543 passengers and around 60,000 aircraft movements. ",
        "source": "https://en.wikipedia.org/wiki/Princess_Juliana_International_Airport"
    },
    "UAAA": {
        "text": "Almaty International Airport (IATA: ALA, ICAO: UAAA), is the largest international airport of Kazakhstan, surpassing Nursultan Nazarbayev International Airport \n(NQZ) in Astana and the principal hub of Air Astana. It serves Almaty, the largest and most populous city in \nthe country, and, with its surface transport links, much of the rest of the country. It is the busiest airport \nboth in Kazakhstan and Central Asia. ",
        "source": "https://en.wikipedia.org/wiki/Almaty_International_Airport"
    },
    "UACC": {
        "text": "Nursultan Nazarbayev International Airport (IATA: NQZ, ICAO: UACC), alternatively referred by its previous name as Astana International Airport until \n2017 (or simply Astana Airport), is the international airport serving Astana, Kazakhstan, the capital and second most populous city in \nthe country. It is the primary aviation hub for northern Kazakhstan. Regionally, it stands as the second-busiest international air passenger \ngateway into Central Asia after Almaty International Airport (ALA). ",
        "source": "https://en.wikipedia.org/wiki/Nursultan_Nazarbayev_International_Airport"
    },
    "UAFM": {
        "text": "Manas International Airport (Kyrgyz: Манас эл аралык аэропорту, romanized: Manas El Aralyk Aeroportu ; Russian: Международный аэропорт «Манас») (IATA: \nFRU, ICAO: UCFM) is the main international airport in Kyrgyzstan, located 25 kilometres (16 mi) north-northwest of the capital, Bishkek. ",
        "source": "https://en.wikipedia.org/wiki/Manas_International_Airport"
    },
    "UAIT": {
        "text": "Hazrat Sultan International Airport (HSIA) (Kazakh: Халықаралық Әзірет Сұлтан Әуежайы / Halyqaralyq Äzıret Sūltan Äuejaiy), commonly known as Türkistan \nInternational Airport (IATA: HSA, ICAO: UAIT), is a new greenfield international airport that serves the city of Türkistan (as a \nreplacement for the old Türkistan Airport). The airport is located near the village of Shaga, 16 km (9.9 mi) NE \nof the centre of Türkistan, the capital of the Türkistan Region (formerly known as South Kazakhstan Region), in the southernmost \npart of Kazakhstan. The construction of the airport started in May 2019, and was completed after one year in 2020 \nwith a cost of around US$160 million. ",
        "source": "https://en.wikipedia.org/wiki/%C3%84ziret_S%C5%ABltan_International_Airport"
    },
    "UBBB": {
        "text": "Heydar Aliyev International Airport (Azerbaijani: Heydar Aliyev adına Beynəlxalq Hava Limanı) (IATA: GYD, ICAO: UBBB) is one of the \nseven international airports serving Azerbaijan. Heydar Aliyev International Airport is the busiest airport both in Azerbaijan and in the South \nCaucasus as well as one of the busiest in the post-Soviet countries. Formerly, it was called Bina International Airport after \na suburb of the Azerbaijan capital Baku. ",
        "source": "https://en.wikipedia.org/wiki/Heydar_Aliyev_International_Airport"
    },
    "UDYZ": {
        "text": "Zvartnots International Airport (Armenian: Զվարթնոց միջազգային օդանավակայան, romanized: Zvart'nots' mijazgayin ōdanavakayan) (IATA: EVN, ICAO: UDYZ) is located near Zvartnots, \n15 km (9.3 mi) west of Yerevan, the capital city of Armenia. It acts as the main international airport of \nArmenia and is Yerevan's main international transport hub. It is the busiest airport in the country. ",
        "source": "https://en.wikipedia.org/wiki/Zvartnots_International_Airport"
    },
    "UGTB": {
        "text": "Shota Rustaveli Tbilisi International Airport (Georgian: თბილისის შოთა რუსთაველის სახელობის საერთაშორისო აეროპორტი) (IATA: TBS, ICAO: UGTB), is the busiest \ninternational airport in Georgia, located 17 km (11 mi) southeast of capital Tbilisi. The airport handled 3.7 million passengers in \n2019. Over 45 airlines operate from the airport, with nonstop or direct flights to over 25 countries. ",
        "source": "https://en.wikipedia.org/wiki/Tbilisi_International_Airport"
    },
    "UHWW": {
        "text": "Vladivostok International Airport (Russian: Международный аэропорт \"Владивосток\" Mezhdunarodnyi aeroport Vladivostok) (IATA: VVO, ICAO: UHWW) is an international airport located \nnear Artyom, Primorsky Krai, Russia, roughly an hour's drive (44 kilometres (27 mi)) north of the center of the city \nof Vladivostok. It was formerly known as Knevichi Airport, named after the village of Knevichi. ",
        "source": "https://en.wikipedia.org/wiki/Vladivostok_International_Airport"
    },
    "UKBB": {
        "text": "Boryspil International Airport (Ukrainian: Міжнародний аеропорт «Бориспіль») (IATA: KBP, ICAO: UKBB) is an international airport in Boryspil, 29 km \n(18 mi) east of Kyiv, the capital of Ukraine. It is Ukraine's largest airport, serving 65% of its passenger air \ntraffic, including all its intercontinental flights and a majority of international flights. It is one of two passenger airports that \nserve Kyiv along with the smaller Zhuliany Airport. ",
        "source": "https://en.wikipedia.org/wiki/Boryspil_International_Airport"
    },
    "UKLL": {
        "text": "Lviv Danylo Halytskyi International Airport (Ukrainian: Міжнародний аеропорт «Львів» імені Данила Галицького, romanized: Mizhnarodnyi aeroport \"Lviv\" imeni Danyla Halytskoho) \n(IATA: LWO, ICAO: UKLL) is an international airport in Lviv, Ukraine, located 6 kilometres (3.7 mi) from the central city. \nIt is the second largest and busiest airport in Ukraine. The airport is named after King Daniel of Galicia, the \nhistorical founder of the city in 1256 AD. ",
        "source": "https://en.wikipedia.org/wiki/Lviv_Danylo_Halytskyi_International_Airport"
    },
    "ULLI": {
        "text": "Pulkovo Airport (Russian: Аэропорт Пулково, IPA: [ˈpuɫkəvə]) (IATA: LED, ICAO: ULLI) is an international airport serving St. Petersburg, Russia. \nIt consists of one terminal which is located 23 km (14 mi) south of the city centre. ",
        "source": "https://en.wikipedia.org/wiki/Pulkovo_Airport"
    },
    "UMMS": {
        "text": "Minsk National Airport, formerly known as Minsk-2 (IATA: MSQ, ICAO: UMMS) (Belarusian: Нацыянальны аэрапорт Мінск, romanized: Nacyjanalny aeraport Minsk, \n[natsɨjaˈnalʲnɨ aeraˈport mʲinsk]; Russian: Национальный аэропорт Минск), is the main international airport in Belarus, located 42 km (26 mi) to \nthe east of the capital Minsk. It geographically lies in the territory of Smalyavichy Raion but is administratively subordinated to \nthe Kastrychnitski District of Minsk. The airport serves as hub of the Belarusian flag carrier Belavia and the cargo carriers \nTAE Avia, Genex, and Rubystar Airways. ",
        "source": "https://en.wikipedia.org/wiki/Minsk_National_Airport"
    },
    "UNKL": {
        "text": "Krasnoyarsk International Airport (Russian: Международный аэропорт Красноярск) (IATA: KJA, ICAO: UNKL), is a major airport in Krasnoyarsk Krai, Russia, \n27 kilometres (17 mi) northwest of Krasnoyarsk. As of December 2017, it was the 14th biggest in Russia in passenger \ntraffic. ",
        "source": "https://en.wikipedia.org/wiki/Krasnoyarsk_International_Airport"
    },
    "UNNT": {
        "text": "Novosibirsk Tolmachevo Airport (Russian: Аэропо́рт Толмачёво) (IATA: OVB, ICAO: UNNT) is situated in the town of Ob, 16 kilometres \n(9.9 mi) west of the center of Novosibirsk, an industrial and scientific center in Siberia and Russia's third-largest city. ",
        "source": "https://en.wikipedia.org/wiki/Tolmachevo_Airport"
    },
    "URRP": {
        "text": "Platov International Airport (IATA: ROV, ICAO: URRP) (Russian: Международный аэропорт Платов) is an airport close to the stanitsa of \nGrushevskaya, Aksaysky District, Rostov Oblast, Russia near the city of Novocherkassk northeast of Rostov-on-Don. It serves Rostov-on-Don (as a replacement \nfor the old Rostov-on-Don Airport) and started operation in December 2017. It is named after Matvei Platov. ",
        "source": "https://en.wikipedia.org/wiki/Platov_International_Airport"
    },
    "URSS": {
        "text": "Sochi International Airport (Russian: Международный Аэропорт Сочи; IATA: AER, ICAO: URSS) is an international airport located in the Adler \nDistrict of the resort city of Sochi, on the coast of the Black Sea in the federal subject of Krasnodar \nKrai, Russia. Sochi International Airport is among the ten largest Russian airports, with an annual passenger turnover of 5.2 million. \nThe airport is run by an international joint venture of Basic Element group, Sberbank and Changi Airports International. ",
        "source": "https://en.wikipedia.org/wiki/Sochi_International_Airport"
    },
    "USSS": {
        "text": "Koltsovo International Airport (Russian: Аэропорт Кольцово) (IATA: SVX, ICAO: USSS) is the international airport serving Yekaterinburg, Russia, located 16 \nkm (10 mi) southeast of the city. Being the largest airport in Sverdlovsk Oblast, Koltsovo also serves nearby towns such \nas Aramil, Sysert, and Polevskoy. In general, the airport is responsible for serving approximately 4,290,000 people. ",
        "source": "https://en.wikipedia.org/wiki/Koltsovo_International_Airport"
    },
    "UTAA": {
        "text": "Ashgabat International Airport (Turkmen: Aşgabat halkara howa menzili) (IATA: ASB, ICAO: UTAA), formerly known as Saparmyrat Türkmenbaşy International Airport, \nis one of five international airports in Turkmenistan. It is located within the city limits of Ashgabat (Ashkhabad). The old \nairport, with its air traffic control tower and a 3,700-metre-long (12,000 ft) precision approach runway (12L-30R), opened in 1994 and \nwas named after the country's first president, Saparmyrat Niyazov. ",
        "source": "https://en.wikipedia.org/wiki/A%C5%9Fgabat_International_Airport"
    },
    "UTTT": {
        "text": "Islam Karimov Tashkent International Airport (Uzbek: Islom Karimov Toshkent Xalqaro Aeroporti) (IATA: TAS, ICAO: UTTT) is the main international \nairport of Uzbekistan and the third busiest airport in Central Asia (after Almaty International Airport and Nursultan Nazarbayev International Airport \nin Astana, both in Kazakhstan). It is located 12 km (7.5 mi) from the center of Tashkent. It was named \nafter Islam Karimov, the first president of independent Uzbekistan, in office from 1991 until his death in 2016. ",
        "source": "https://en.wikipedia.org/wiki/Tashkent_International_Airport"
    },
    "UUBW": {
        "text": "Zhukovsky (IATA: ZIA, ICAO: UUBW) (Russian: Жуковский), formerly (and still occasionally) known as Ramenskoye (Russian: Раменское) is an international \nairport, located in Moscow Oblast, Russia, 36 km (22 mi) southeast of central Moscow, in the city of Zhukovsky, a \nfew kilometers south-east of the closed Bykovo Airport. ",
        "source": "https://en.wikipedia.org/wiki/Zhukovsky_International_Airport"
    },
    "UUDD": {
        "text": "Moscow Domodedovo International Airport (Russian: Домодедово аэропорт, IPA: [dəmɐˈdʲɛdəvə]) (IATA: DME, ICAO: UUDD), formally Domodedovo Mikhail Lomonosov International Airport, \nis an international airport serving Moscow, the capital of Russia. It is located in Domodedovo, Moscow Oblast, 42 kilometres (26 \nmi) south-southeast from the city centre of Moscow. Domodedovo Airport serves regular flights across Russia, as well as to Asia, \nAfrica, and the Middle East, and it is the third largest airport in Russia and CIS after Sheremetyevo and Pulkovo. ",
        "source": "https://en.wikipedia.org/wiki/Moscow_Domodedovo_Airport"
    },
    "UUEE": {
        "text": "Sheremetyevo Alexander S. Pushkin International Airport (Russian: Международный аэропорт Шереметьево имени А. С. ",
        "source": "https://en.wikipedia.org/wiki/Sheremetyevo_International_Airport"
    },
    "UUWW": {
        "text": "Vnukovo, formally Vnukovo Andrei Tupolev International Airport (named after Andrei Tupolev) (Russian: Внуково, IPA: [ˈvnukəvə]) (IATA: VKO, ICAO: UUWW), \nis a dual-runway international airport located in Vnukovo District, 28 km (17 mi) southwest of the centre of Moscow, Russia. \nIt is one of the four major airports that serve Moscow, along with Domodedovo, Sheremetyevo, and Zhukovsky. In 2019, the \nairport handled 24.01 million passengers, representing an increase of 12% compared to the previous year. ",
        "source": "https://en.wikipedia.org/wiki/Vnukovo_International_Airport"
    },
    "UWKD": {
        "text": "Kazan International Airport (Tatar: Казан Халыкара Аэропорты, Russian: Международный аэропорт Казань; IATA: KZN, ICAO: UWKD) is an international airport \nin Russia, around 25 km southeast of Kazan. It is the largest airport in Tatarstan, and the one of the \nbusiest airports in Russia as well as in Post-Soviet States. Kazan International Airport served more than 5 million passengers in \n2023. ",
        "source": "https://en.wikipedia.org/wiki/Kazan_International_Airport"
    },
    "UWSG": {
        "text": "Find more data about Gagarin International Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/GSV'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/GSV"
    },
    "UWUU": {
        "text": "Find more data about Ufa International Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/UFA'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/UFA"
    },
    "UWWW": {
        "text": "Kurumoch International Airport (Russian: Международный аэропорт \"Курумоч\") (IATA: KUF, ICAO: UWWW) is the international airport serving the city of \nSamara, Russia, located 35 km (22 mi) north of the city. Besides Samara, the airport serves Tolyatti – the second \nlargest city in the region. The name of the airport originated from the closest village of Kurumoch 7 km (4 \nmi) southwest. ",
        "source": "https://en.wikipedia.org/wiki/Kurumoch_International_Airport"
    },
    "VABB": {
        "text": "Chhatrapati Shivaji Maharaj International Airport (IATA: BOM, ICAO: VABB) is an international airport serving Mumbai and the Mumbai Metropolitan \nRegion (MMR). It is the second busiest airport in India in terms of total and international passenger traffic after Delhi, \nand was the ninth busiest airport in Asia and 25th busiest airport in the world by passenger traffic in fiscal \nyear 2023-24. The airport is operated by Mumbai International Airport Limited (MIAL), a Joint Venture between Adani Enterprises, a subsidiary \nof the Adani Group and Airports Authority of India. ",
        "source": "https://en.wikipedia.org/wiki/Chhatrapati_Shivaji_Maharaj_International_Airport"
    },
    "VAGO": {
        "text": "Dabolim Airport (IATA: GOI, ICAO: VAGO) is an international airport serving Panaji capital of the state of Goa, India. \nIt is operated by the Airports Authority of India (AAI) as a civil enclave in an Indian Navy naval airbase \nnamed INS Hansa. The airport is located in Dabolim, in South Goa district, 4 km (2.5 mi) from the nearest \ncity of Vasco da Gama, 23 km (14 mi) from Margao, and about 30 km (19 mi) from the state \ncapital, Panaji. ",
        "source": "https://en.wikipedia.org/wiki/Dabolim_Airport"
    },
    "VCBI": {
        "text": "Bandaranaike International Airport (BIA) (Sinhala: බණ්ඩාරනායක ජාත්‍යන්තර ගුවන්තොටුපළ, romanized: Bandāranāyaka Jātyantara Guvantoṭupaḷa; Tamil: பண்டாரநாயக்க சர்வதேச விமான நிலையம், romanized: Paṇṭāranāyakka \nCarvatēca Vimāṉa Nilaiyam) (commonly known as Colombo International Airport, Colombo–Bandaranaike International Airport, and locally as Katunayake International Airport) (IATA: CMB, \nICAO: VCBI) is the main international airport serving Sri Lanka. It is named after former Prime Minister S. W. ",
        "source": "https://en.wikipedia.org/wiki/Bandaranaike_International_Airport"
    },
    "VCRI": {
        "text": "Mattala Rajapaksa International Airport (MRIA) (Sinhala: මත්තල රාජපක්ෂ ජාත්‍යන්තර ගුවන්තොටුපළ, romanized: Mattala Rājapakṣa Jātyantara Guvantoṭupaḷa; Tamil: மத்தல ராஜபக்ஷ சர்வதேச \nவிமானநிலையம், romanized: Mattala Rājapakṣa Carvatēca Vimāṉanilaiyam) (IATA: HRI, ICAO: VCRI) is an international airport serving southeast Sri Lanka. It is \nlocated in the town of Mattala, 18 km (11 mi) from Hambantota. It is the first greenfield airport and the \nthird international airport in the country, after Ratmalana International Airport and Bandaranaike International Airport in Colombo. ",
        "source": "https://en.wikipedia.org/wiki/Mattala_Rajapaksa_International_Airport"
    },
    "VDPP": {
        "text": "Phnom Penh International Airport (IATA: PNH, ICAO: VDPP) is the busiest airport in Cambodia and serves as the country's \nmain international gateway. It is Cambodia's second largest airport by area after the new Siem Reap–Angkor International Airport. It is \nlocated in the Pou Senchey District, 10 kilometres (5.4 NM) west of Phnom Penh, the nation's capital. ",
        "source": "https://en.wikipedia.org/wiki/Phnom_Penh_International_Airport"
    },
    "VDSR": {
        "text": "Siem Reap International Airport (IATA: REP, ICAO: VDSR) was an international airport serving Siem Reap and Angkor. It opened \nin 1932 and closed in 2023 upon the opening of Siem Reap–Angkor International Airport. It was the second-busiest airport in \nCambodia after Phnom Penh International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Siem_Reap_International_Airport"
    },
    "VECC": {
        "text": "Subhas Chandra Bose ( shuub-HAHSS CHUN-drə BOHSS; 23 January 1897 – 18 August 1945) was an Indian nationalist whose \ndefiance of British authority in India made him a hero among many Indians, but his wartime alliances with Nazi Germany \nand Imperial Japan left a legacy vexed by authoritarianism, anti-Semitism, and military failure. The honorific 'Netaji' (Bengali: \"Respected Leader\") was \nfirst applied to Bose in Germany in early 1942—by the Indian soldiers of the Indische Legion and by the German \nand Indian officials in the Special Bureau for India in Berlin. It is now used throughout India. ",
        "source": "https://en.wikipedia.org/wiki/Subhas_Chandra_Bose"
    },
    "VGZR": {
        "text": "Hazrat Shahjalal International Airport (Bengali: হযরত শাহ্‌জালাল আন্তর্জাতিক বিমানবন্দর, Romanized: Hôzrôt Shahjalal Antôrjatik Bimanbôndôr), (IATA: DAC, ICAO: VGHS, formerly \nVGZR), is the main international airport serving Dhaka City, the capital city of Bangladesh, and it is the largest airport \nin Bangladesh. It is located in Kurmitola, 17 km (11 mi) from the city centre, in the northern part of \nDhaka. The airport is also used as a base of the Bangladesh Air Force. ",
        "source": "https://en.wikipedia.org/wiki/Hazrat_Shahjalal_International_Airport"
    },
    "VHHH": {
        "text": "Hong Kong International Airport (IATA: HKG, ICAO: VHHH) is an international airport located on the island of Chek Lap \nKok in western Hong Kong. The airport is also referred to as Chek Lap Kok International Airport or Chek Lap \nKok Airport, to distinguish it from its predecessor, the former Kai Tak Airport. Opened in 1998, the airport is the \nworld's busiest cargo gateway and one of the world's busiest passenger airports. ",
        "source": "https://en.wikipedia.org/wiki/Hong_Kong_International_Airport"
    },
    "VIDP": {
        "text": "Indira Gandhi International Airport (IATA: DEL, ICAO: VIDP) is the primary international airport serving Delhi, the capital of India, \nand the National Capital Region (NCR). The airport, spread over an area of 5,106 acres (2,066 ha), is situated in \nPalam, Delhi, 15 km (9.3 mi) southwest of the New Delhi Railway Station and 16 km (9.9 mi) from New \nDelhi city centre. Named after Indira Gandhi (1917–1984), the former Prime Minister of India, it is the busiest airport of \nIndia in terms of passenger traffic since 2009. ",
        "source": "https://en.wikipedia.org/wiki/Indira_Gandhi_International_Airport"
    },
    "VMMC": {
        "text": "Macau International Airport (IATA: MFM, ICAO: VMMC) (Chinese: 澳門國際機場; Portuguese: Aeroporto Internacional de Macau) is an international airport in \nthe special administrative region of Macau, situated at the eastern end of Taipa island and neighbouring waters which opened for \ncommercial operations on 9 November 1995, during Portuguese administration of the region. Since then the airport has been a common \ntransfer point for people traveling between the Mainland and Taiwan, as well as a passenger hub for destinations in mainland \nChina and Southeast Asia. During 2006, the airport handled 5 million passengers and 220,000 tonnes of cargo. ",
        "source": "https://en.wikipedia.org/wiki/Macau_International_Airport"
    },
    "VNKT": {
        "text": "Tribhuvan International Airport (Nepali: त्रिभुवन अन्तर्राष्ट्रिय विमानस्थल) (IATA: KTM, ICAO: VNKT, colloquially referred to as TIA) is an international \nairport located in Kathmandu, Bagmati, Nepal. It has a tabletop runway, a domestic terminal and an international terminal. As the \ncountry's main international airport, it connects Nepal to over 40 destinations in 17 countries. ",
        "source": "https://en.wikipedia.org/wiki/Tribhuvan_International_Airport"
    },
    "VOBL": {
        "text": "Bengaluru Airport (IATA: BLR, ICAO: VOBL), officially Kempegowda International Airport, is an international airport serving Bangalore, the capital of \nKarnataka, India. Spread over 4,000 acres (1,600 ha), it is located about 35 kilometres (22 mi) north of the city \nnear the suburb of Devanahalli. It is owned and operated by Bengaluru International Airport Limited (BIAL), a public–private consortium. ",
        "source": "https://en.wikipedia.org/wiki/Bengaluru_Airport"
    },
    "VOCI": {
        "text": "Cochin International Airport (IATA: COK, ICAO: VOCI) (locally referred to as Nedumbassery Airport, Kochi Airport or Ernakulam Airport) is \nan international airport serving the city of Kochi, Kerala, in southwestern India. It is located at Nedumbassery, about 25 km \n(16 mi) northeast of the city center. The airport is the first of its kind to be developed under a \npublic-private partnership (PPP) model in India. ",
        "source": "https://en.wikipedia.org/wiki/Cochin_International_Airport"
    },
    "VOHS": {
        "text": "Rajiv Gandhi International Airport (IATA: HYD, ICAO: VOHS) is an international airport that serves Hyderabad, the capital of the \nIndian state of Telangana. It is located in Shamshabad, about 24 kilometres (15 mi) south of Hyderabad and it was \nopened on 23 March 2008 to replace Begumpet Airport, which was the sole civilian airport serving Hyderabad. It is named \nafter Rajiv Gandhi, former Prime Minister of India. ",
        "source": "https://en.wikipedia.org/wiki/Rajiv_Gandhi_International_Airport"
    },
    "VOMM": {
        "text": "Chennai International Airport (IATA: MAA, ICAO: VOMM) is an international airport serving the city of Chennai, the capital of \nTamil Nadu, India and its metropolitan area. It is located in Tirusulam, around 20 km (12 mi) southwest of the \ncity centre. The airport is the fifth-busiest airport in India, and third by international traffic. ",
        "source": "https://en.wikipedia.org/wiki/Chennai_International_Airport"
    },
    "VOTV": {
        "text": "Thiruvananthapuram International Airport (IATA: TRV, ICAO: VOTV), is an international airport that serves Thiruvananthapuram, the capital city of Kerala, \nIndia. Established in 1932, it is the first airport in the state of Kerala and the fifth international airport of \nIndia, officially declared in 1991. It is the operating base of Air India, Air India Express, IndiGo and SpiceJet. ",
        "source": "https://en.wikipedia.org/wiki/Thiruvananthapuram_International_Airport"
    },
    "VRMM": {
        "text": "Velana International Airport (VIA), also known as Malé-Velana International Airport (Dhivehi: ވެލާނާ ބައިނަލްއަޤުވާމީ ވައިގެ ބަނދަރު) (IATA: MLE, ICAO: VRMM) \nis the main international airport in the Maldives. It is located on Hulhulé Island in the North Malé Atoll, nearby \nthe capital island Malé. The airport is well connected with major airports around the world, mostly serving as the main \ngateway into the Maldives for tourists. ",
        "source": "https://en.wikipedia.org/wiki/Velana_International_Airport"
    },
    "VTBD": {
        "text": "Don Mueang International Airport (IATA: DMK, ICAO: VTBD), known as Bangkok International Airport before 2006, is one of two \ninternational airports serving Bangkok, the capital of Thailand, the other one being Suvarnabhumi Airport (BKK). The airport is considered to \nbe one of the world's oldest international airports and one of Asia's oldest operating airport. It was officially opened as \na Royal Thai Air Force (RTAF) base on 27 March 1914, although it had been in use earlier. ",
        "source": "https://en.wikipedia.org/wiki/Don_Mueang_International_Airport"
    },
    "VTBS": {
        "text": "Suvarnabhumi Airport (IATA: BKK, ICAO: VTBS) is the main international airport serving Bangkok, the capital of Thailand. Located mostly \nin Racha Thewa subdistrict, Bang Phli district, Samut Prakan province, it covers an area of 3,240 ha (32.4 km2; 8,000 \nacres), making it one of the biggest international airports in Southeast Asia and a regional hub for aviation. The airport \nis also a major Cargo Air Freight Hub (20th busiest in 2019), which has a designated Airport Free Zone, as \nwell as road links to the Eastern Economic Corridor (EEC) on Motorway 7. ",
        "source": "https://en.wikipedia.org/wiki/Suvarnabhumi_Airport"
    },
    "VTCC": {
        "text": "Chiang Mai International Airport (IATA: CNX, ICAO: VTCC) is an international airport in Suthep subdistrict, Mueang Chiang Mai district, \nChiang Mai province in northern Thailand. It is a major gateway that links northern Thailand to the rest of the \nregion, and currently the fourth-busiest airport in the country. It is managed by Airports of Thailand. ",
        "source": "https://en.wikipedia.org/wiki/Chiang_Mai_International_Airport"
    },
    "VTSP": {
        "text": "Phuket International Airport (IATA: HKT, ICAO: VTSP) is in Mai Khao subdistrict, Thalang district, Phuket province in southern Thailand. \nIt is in the north of Phuket Island, 32 kilometres (20 mi) from downtown Phuket. The airport plays a major \nrole in Thailand's tourism industry, as Phuket is a popular resort destination. ",
        "source": "https://en.wikipedia.org/wiki/Phuket_International_Airport"
    },
    "VVNB": {
        "text": "Nội Bài International Airport (IATA: HAN, ICAO: VVNB) in Hanoi, the capital of Vietnam, is the country’s second largest \nand busiest international airport for passenger traffic, after Tan Son Nhat International Airport in Ho Chi Minh City. It is \ncurrently the main airport serving Hanoi, replacing the role of Gia Lam Airport. The airport consists of two passenger terminals \nand a cargo terminal. ",
        "source": "https://en.wikipedia.org/wiki/Noi_Bai_International_Airport"
    },
    "VVTS": {
        "text": "Tân Sơn Nhất International Airport (IATA: SGN, ICAO: VVTS) is an international airport serving Ho Chi Minh City, the \nlargest city of Vietnam. It serves Tan Binh District, where the airport is located in the Ho Chi Minh City \nmetropolitan area, as well as the rest of southeastern Vietnam. It is the busiest and largest airport in Vietnam, with \n32.5 million passengers in 2016, 38.5 million passengers in 2018, and about 41 million passengers in 2023. ",
        "source": "https://en.wikipedia.org/wiki/Tan_Son_Nhat_International_Airport"
    },
    "VYMD": {
        "text": "Mandalay International Airport (IATA: MDL, ICAO: VYMD), located 35 km south of Mandalay in Tada-U, is one of three \ninternational airports in Myanmar. Completed in 1999, it replaced the old Mandalay Chanmyathazi Airport as the city's main airport and \nit was the largest and most modern airport in the country until the modernization of Yangon International Airport in 2008. \nThe airport connects 11 domestic and seven international destinations. ",
        "source": "https://en.wikipedia.org/wiki/Mandalay_International_Airport"
    },
    "VYYY": {
        "text": "Yangon International Airport (Burmese: ရန်ကုန်အပြည်ပြည်ဆိုင်ရာလေဆိပ်; MLCTS: rankun apranyprany hcuingra lehcip [jàɴɡòʊɰ̃ əpjìpjì sʰàɪɴjà lèzeɪʔ]) (IATA: RGN, ICAO: VYYY) is \nthe primary and busiest international airport of Myanmar. The airport is located in Mingaladon, 15 kilometres (9.3 mi) north of \ncentral Yangon. All ten Myanmar carriers and about 30 international airlines operate at Yangon International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Yangon_International_Airport"
    },
    "WAAA": {
        "text": "Sultan Hasanuddin International Airport (IATA: UPG, ICAO: WAAA) is an international airport in Makassar, South Sulawesi. It is located \n20 km (12 mi) northeast of Makassar's city centre and is operated by PT. Angkasa Pura I. ",
        "source": "https://en.wikipedia.org/wiki/Sultan_Hasanuddin_International_Airport"
    },
    "WADD": {
        "text": "I Gusti Ngurah Rai International Airport (IATA: DPS, ICAO: WADD), also known as Denpasar International Airport, is the main \ninternational airport of Bali, Indonesia, located 13 kilometres (8.1 mi) from Downtown Denpasar, serves the Denpasar metropolitan area and the \nBali island. Ngurah Rai is the second busiest airport in Indonesia after Soekarno-Hatta, Ngurah Rai is one of the most \npopular island destinations hubs in Asia. In 2018, the airport served 23,779,178 passengers. ",
        "source": "https://en.wikipedia.org/wiki/Ngurah_Rai_International_Airport"
    },
    "WAJJ": {
        "text": "Dortheys Hiyo Eluay International Airport, also known as Sentani International Airport (Indonesian: Bandar Udara Internasional Sentani) (IATA: DJJ, ICAO: \nWAJJ) is an airport serving Jayapura, the capital of Papua province, Indonesia, on the island of New Guinea. It is \nlocated in the Sentani District, approximately 40 km from downtown Jayapura; the name 'Sentani' is taken from Lake Sentani nearby. \nIt is the easternmost airport in Indonesia, the main hub, and the largest airport on the island of New Guinea. ",
        "source": "https://en.wikipedia.org/wiki/Dortheys_Hiyo_Eluay_International_Airport"
    },
    "WARR": {
        "text": "Juanda International Airport (IATA: SUB, ICAO: WARR), is an international airport located in Sedati, Sidoarjo, East Java, Indonesia. It \nis now the third busiest airport in Indonesia (after Jakarta's Soekarno-Hatta and Denpasar's Ngurah Rai). This airport is located approximately \n12 kilometers (7.5 mi) from Downtown Surabaya and serves the Surabaya metropolitan area, the metropolitan area of Surabaya plus extended \nurban area. ",
        "source": "https://en.wikipedia.org/wiki/Juanda_International_Airport"
    },
    "WBSB": {
        "text": "Brunei International Airport (BIA) (Malay: Lapangan Terbang Antarabangsa Brunei, Jawi: لاڤڠن تربڠ انتارابڠسا بروني ), (IATA: BWN, ICAO: WBSB), \nis the primary international airport and official airport of entry; one of two airports in the Sultanate of Brunei Darussalam, \non the island of Borneo. Located near Bandar Seri Begawan in the Brunei-Muara District, it serves as the home base \nand hub for Royal Brunei Airlines (RB). Additionally, the Royal Brunei Air Force (RBAirF) is also headquartered at Royal Brunei \nAir Force Base, Rimba, which is located opposite the 3,685 by 46 metres (12,090 by 151 feet) main runway on \nthe north-western side, within the aerodrome's environs. ",
        "source": "https://en.wikipedia.org/wiki/Brunei_International_Airport"
    },
    "WIII": {
        "text": "Find more data about Soekarno-Hatta International Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/CGK'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/CGK"
    },
    "WMKK": {
        "text": "Kuala Lumpur International Airport (KLIA) (IATA: KUL, ICAO: WMKK) is Malaysia's main international airport. It is located in the \nSepang District of Selangor, approximately 45 kilometres (28 mi) south of Kuala Lumpur and serves the city's greater conurbation. KLIA \nis the largest and busiest airport in Malaysia. ",
        "source": "https://en.wikipedia.org/wiki/Kuala_Lumpur_International_Airport"
    },
    "WSSS": {
        "text": "Singapore Changi Airport ( CHAHNG-ee), commonly known as Changi Airport (IATA: SIN, ICAO: WSSS), is a major international airport \nthat serves Singapore, and is one of the largest transportation hubs in Asia. As one of the world's busiest airports \nby international passenger and cargo traffic, it has been rated as the \"World's Best Airport\" by Skytrax a dozen times, \nand was the first airport in the world to hold the accolade for eight consecutive years. It has also been \nrated as one of the world's cleanest airports and highly rated international transit airports. ",
        "source": "https://en.wikipedia.org/wiki/Changi_Airport"
    },
    "YBBN": {
        "text": "Brisbane Airport (IATA: BNE, ICAO: YBBN) is an international airport serving Brisbane, the capital of the Australian state of \nQueensland. The airport services 31 airlines flying to 50 domestic and 29 international destinations, total amounting to more than 22.7 \nmillion passengers who travelled through the airport in 2016. In 2016, an OAG report named Brisbane airport as the fifth-best \nperforming large-sized airport in the world for on-time performance with 87% of arrivals and departures occurring within 15 minutes of \ntheir scheduled times, slipping from 88.31% the year before. ",
        "source": "https://en.wikipedia.org/wiki/Brisbane_Airport"
    },
    "YMML": {
        "text": "Melbourne Orlando International Airport (IATA: MLB, ICAO: KMLB, FAA LID: MLB) is a public airport 1.5 miles (2.4 km) \nnorthwest of downtown Melbourne, in Brevard County, Florida, United States, and 50 miles (80.5 km) southeast of Orlando, located on \ncentral Florida's Space Coast. The airport is reached by NASA Boulevard (State Road 508). It is governed by a seven-member \nboard which is appointed by the Melbourne City Council and the private sector. ",
        "source": "https://en.wikipedia.org/wiki/Melbourne_Orlando_International_Airport"
    },
    "YNT": {
        "text": "Yantai Penglai International Airport (IATA: YNT, ICAO: ZSYT) is an international airport serving the city of Yantai in East \nChina’s Shandong province. It is located 43 kilometres (27 mi) from the city center, near the Chaoshui town in Penglai \nDistrict, a district in Yantai city. Construction officially started on 26 December 2009, and the airport was opened on 28 \nMay 2015, when all flights serving Yantai were transferred from the old Laishan Airport. ",
        "source": "https://en.wikipedia.org/wiki/Yantai_Penglai_International_Airport"
    },
    "YPAD": {
        "text": "Adelaide Airport (IATA: ADL, ICAO: YPAD) is an international, domestic and general aviation airport, and the principal airport of \nAdelaide, South Australia. It is the fifth-busiest airport in Australia measured by passengers movements, servicing more than 7.7 million passengers \nin FY23, and is located adjacent to West Beach, approximately 6 km (3.7 mi) west of the Adelaide city centre. \nIt has been operated privately by Adelaide Airport Limited under a long-term lease from the Federal Government since 29 May \n1998.: p 25  The facility covers a total area of 785 hectares (1,940 acres) of airport property. ",
        "source": "https://en.wikipedia.org/wiki/Adelaide_Airport"
    },
    "YPPH": {
        "text": "Perth Airport (IATA: PER, ICAO: YPPH) is an international, domestic and general aviation airport serving Perth, the capital city \nof Western Australia. It is the fourth busiest airport in Australia measured by passenger movements and falls within the boundaries \nof the City of Belmont, City of Kalamunda and the City of Swan. Perth Airport and Jandakot Airport, the other \ncivilian airport within the mainland Perth metropolitan area located about 20 kilometres (12 mi) south-southwest of the general aviation area \nof the airport, recorded a combined total of 362,782 aircraft movements in 2017. ",
        "source": "https://en.wikipedia.org/wiki/Perth_Airport"
    },
    "YSSY": {
        "text": "Sydney Kingsford Smith Airport (IATA: SYD, ICAO: YSSY) — colloquially Mascot Airport, Kingsford Smith Airport, or Sydney Airport — \nis an international airport in Sydney, New South Wales, Australia, located 8 km (5 mi) south of the Sydney central \nbusiness district, in the suburb of Mascot. The airport is owned by Sydney Airport Holdings. It is the primary airport \nserving Sydney and is a primary hub for Qantas, as well as a secondary hub for Virgin Australia and Jetstar, \nand a focus city for Air New Zealand. ",
        "source": "https://en.wikipedia.org/wiki/Sydney_Airport"
    },
    "ZBAA": {
        "text": "Beijing Capital International Airport (IATA: PEK, ICAO: ZBAA) is one of two international airports serving Beijing, the capital of \nChina (the other one being Beijing Daxing International Airport). The airport is located 32 km (20 mi) northeast of Beijing's \ncity center, in an exclave of Chaoyang and the surroundings of that exclave in suburban Shunyi. The airport is owned \nand operated by the Beijing Capital International Airport Company Limited, a state-controlled company. ",
        "source": "https://en.wikipedia.org/wiki/Beijing_Capital_International_Airport"
    },
    "ZBAD": {
        "text": "Beijing Daxing International Airport (IATA: PKX, ICAO: ZBAD) is one of two international airports serving Beijing, the capital of \nChina (the other one being Beijing Capital International Airport). The airport is located on the border of Beijing and Langfang, \nHebei. It has been nicknamed \"the starfish\". ",
        "source": "https://en.wikipedia.org/wiki/Beijing_Daxing_International_Airport"
    },
    "ZBHH": {
        "text": "Find more data about Baita International Airport from <a id='airport-guide-link' href='https://airportguide.com/airport/info/HET'>Airport Guide</a>",
        "source": "https://airportguide.com/airport/info/HET"
    },
    "ZBTJ": {
        "text": "Tianjin Binhai International Airport (IATA: TSN, ICAO: ZBTJ) is an international airport serving Tianjin, the municipality in North China. \nIt is one of the major air cargo centers in the People's Republic of China. It is the hub airport \nfor Tianjin Airlines, established in 2004, and privately owned Okay Airways, as well as a focus city for Air China. ",
        "source": "https://en.wikipedia.org/wiki/Tianjin_Binhai_International_Airport"
    },
    "ZBYN": {
        "text": "Taiyuan Wusu International Airport (IATA: TYN, ICAO: ZBYN) is an international airport serving Taiyuan, the capital of North China’s \nShanxi province. It is the largest airport in Shanxi and is located about 15 kilometers (9.3 miles) southeast of downtown \nTaiyuan. Built in 1939, it has evolved into one of the busiest and most important airports of Shanxi Province, with \nconnections to most major cities within China. ",
        "source": "https://en.wikipedia.org/wiki/Taiyuan_Wusu_International_Airport"
    },
    "ZGGG": {
        "text": "Guangzhou Baiyun International Airport (IATA: CAN, ICAO: ZGGG) is an international airport serving Guangzhou, the capital of South Central \nChina's Guangdong province. The airport codes were inherited from the former Baiyun Airport, and the IATA code is derived from \nGuangzhou's historical romanization Canton. Baiyun Airport serves as a hub for China Southern Airlines, FedEx Express, 9 Air, Hainan Airlines \nand Shenzhen Airlines. ",
        "source": "https://en.wikipedia.org/wiki/Guangzhou_Baiyun_International_Airport"
    },
    "ZGHA": {
        "text": "Changsha Huanghua International Airport (IATA: CSX, ICAO: ZGHA, CAAC LID: HHA) is an international airport serving Changsha, the capital \nof South Central China’s Hunan province, and the Greater Changsha Metropolitan Region comprising the nearby cities of Zhuzhou and Xiangtan. \nAs of 2021, it was one of the 50 busiest airports in the world, the 12th busiest civil airport in \nChina, the second busiest in South Central China after Guangzhou Baiyun International Airport and the busiest in Central China. Located \nabout 25 kilometres (16 mi) from downtown Changsha in the town of Huanghua in Changsha County, the airport has two \nterminal buildings. ",
        "source": "https://en.wikipedia.org/wiki/Changsha_Huanghua_International_Airport"
    },
    "ZGKL": {
        "text": "Guilin Liangjiang International Airport (IATA: KWL, ICAO: ZGKL) is an international airport serving the city of Guilin in Guangxi \nZhuang Autonomous Region, China. It is located in Liangjiang, about 28 km (17 mi) southwest of the city center. In \n2014, Guilin Liangjiang International Airport was the 33rd busiest airport in China with 5,875,327 passengers. ",
        "source": "https://en.wikipedia.org/wiki/Guilin_Liangjiang_International_Airport"
    },
    "ZGNN": {
        "text": "Nanning Wuxu International Airport (IATA: NNG, ICAO: ZGNN) is an international airport serving Nanning, the capital of Guangxi Autonomous \nRegion, China. It is located 32 km (20 mi) south-west of the centre of the city. The airport was built \nin 1962, with improvements made in 1990. ",
        "source": "https://en.wikipedia.org/wiki/Nanning_Wuxu_International_Airport"
    },
    "ZGSZ": {
        "text": "Shenzhen Bao'an International Airport (IATA: SZX, ICAO: ZGSZ) is an international airport serving the city of Shenzhen in South \nCentral China’s Guangdong province. It is on the east bank of the Pearl River near Huangtian and Fuyong villages in \nBao'an District, 32 km (20 mi) northwest of the city centre. It is a hub for Shenzhen Airlines and Shenzhen \nDonghai Airlines and for cargo airline SF Airlines, China Southern Airlines and Hainan Airlines. ",
        "source": "https://en.wikipedia.org/wiki/Shenzhen_Bao%27an_International_Airport"
    },
    "ZHCC": {
        "text": "Zhengzhou Xinzheng International Airport (IATA: CGO, ICAO: ZHCC) is an international airport serving Zhengzhou, the capital of South Central \nChina’s Henan province. The airport is located in Xinzheng, 37 kilometres (23 mi) southeast of downtown Zhengzhou. It was opened \non 28 August 1997, replacing its predecessor, the now-demolished Dongjiao Airport. ",
        "source": "https://en.wikipedia.org/wiki/Zhengzhou_Xinzheng_International_Airport"
    },
    "ZHHH": {
        "text": "Wuhan Tianhe International Airport (IATA: WUH, ICAO: ZHHH) is an international airport serving Wuhan, the capital of South Central \nChina’s Hubei province. It was opened on 15 April 1995, replacing the old Hankou Wangjiadun Airport and Nanhu Airport as \nthe major airport of Wuhan. The airport is located in Wuhan's suburban Huangpi District, around 26 km (16 mi) to \nthe north of Wuhan city center. ",
        "source": "https://en.wikipedia.org/wiki/Wuhan_Tianhe_International_Airport"
    },
    "ZJHK": {
        "text": "Haikou Meilan International Airport (IATA: HAK, ICAO: ZJHK) is an international airport serving Haikou, the capital of South Central \nChina’s Hainan province. It is located 25 kilometres (16 mi) southeast of the city center and was opened in 1999, \nreplacing the old Dayingshan Airport located along what is now the city's Guoxing Avenue. The airport is operated by Hainan \nMeilan International Airport Company Limited. ",
        "source": "https://en.wikipedia.org/wiki/Haikou_Meilan_International_Airport"
    },
    "ZJSY": {
        "text": "Sanya Phoenix International Airport (IATA: SYX, ICAO: ZJSY) is an international airport serving the city of Sanya in South \nCentral China’s Hainan province. It is located about 15 km (9 mi) northwest of the city center. Sanya Phoenix International \nAirport is a main airport hub and comprises close to ten thousand acres. ",
        "source": "https://en.wikipedia.org/wiki/Sanya_Phoenix_International_Airport"
    },
    "ZLLL": {
        "text": "Lanzhou Zhongchuan International Airport (IATA: LHW, ICAO: ZLLL) is an international airport serving Lanzhou, the capital of Northwest China’s \nGansu province. It is located 71 kilometres (44 mi) northwest of downtown Lanzhou. It was opened in 1970 and serves \nas a major air hub for the province of Gansu and western China. ",
        "source": "https://en.wikipedia.org/wiki/Lanzhou_Zhongchuan_International_Airport"
    },
    "ZLXY": {
        "text": "Xi'an Xianyang International Airport (IATA: XIY, ICAO: ZLXY) is an international airport serving the city of Xi'an, the capital \nof Northwest China’s Shaanxi province, as well as the whole Guanzhong area. Covering an area of 5 square kilometres (1.9 \nsq mi), it is the largest airport in Northwest China, and the second largest airport in Northern China. The airport \nwas the hub for China Northwest Airlines until the company was merged into China Eastern Airlines in 2002. ",
        "source": "https://en.wikipedia.org/wiki/Xi%27an_Xianyang_International_Airport"
    },
    "ZMCK": {
        "text": "Chinggis Khaan International Airport (IATA: UBN, ICAO: ZMCK), also referred to as New Ulaanbaatar International Airport, is the primary \nairport serving Ulaanbaatar, and is Mongolia's only international airport. It opened on 4 July 2021, replacing Buyant-Ukhaa International Airport. It \nis the largest air facility in the country, serving as a hub for all major Mongolian airlines, and is located \nin the Khöshig Valley of Sergelen, Töv Province, 52 km south of Ulaanbaatar and 20 km southwest of Zuunmod. ",
        "source": "https://en.wikipedia.org/wiki/Chinggis_Khaan_International_Airport"
    },
    "ZPPP": {
        "text": "Kunming Changshui International Airport (IATA: KMG, ICAO: ZPPP) is an international airport serving Kunming, the capital of Southwestern China’s \nYunnan province. The airport is located 24.5 km (15.2 mi) northeast of the city center in a graded mountainous area \nabout 2,100 m (6,900 ft) above sea level. The airport opened at 08:00 (UTC+8) on 28 June 2012, replacing the \nold Kunming Wujiaba International Airport, which was later demolished. ",
        "source": "https://en.wikipedia.org/wiki/Kunming_Changshui_International_Airport"
    },
    "ZSAM": {
        "text": "Xiamen Gaoqi International Airport (IATA: XMN, ICAO: ZSAM) is an international airport serving the city of Xiamen in East \nChina’s Fujian province. It is the main base of XiamenAir and TAECO, an aircraft maintenance provider. The airport is located \non the north side of Xiamen Island. ",
        "source": "https://en.wikipedia.org/wiki/Xiamen_Gaoqi_International_Airport"
    },
    "ZSFZ": {
        "text": "Fuzhou Changle International Airport (IATA: FOC, ICAO: ZSFZ) is an international airport serving Fuzhou, the capital of East China’s \nFujian province. It was inaugurated on 23 June 1997 after being approved to start construction by the state council in \n1992. The current handling capacity is approximately 6.5 million people annually. ",
        "source": "https://en.wikipedia.org/wiki/Fuzhou_Changle_International_Airport"
    },
    "ZSHC": {
        "text": "Hangzhou Xiaoshan International Airport (IATA: HGH, ICAO: ZSHC) is an international airport serving Hangzhou, a major city in the \nYangtze River Delta region and the capital of East China’s Zhejiang province. The airport is located on the southern shore \nof Qiantang River in Xiaoshan District and is 27 km (17 mi) east of downtown Hangzhou. Architecture firm Aedas designed \nHangzhou Xiaoshan International Airport. ",
        "source": "https://en.wikipedia.org/wiki/Hangzhou_Xiaoshan_International_Airport"
    },
    "ZSJN": {
        "text": "Jinan Yaoqiang International Airport (IATA: TNA, ICAO: ZSJN) is the airport serving Jinan, the capital of Shandong Province, China. \nThe airport is located approximately 33 kilometres (21 mi) northeast of the city center and immediately to the north of \nthe Yaoqiang Subdistrict (遥墙街道) after which the airport is named. By road, the airport is connected to the Jinan Ring \n(济南绕城高速公路), Beijing–Shanghai, and Qingdao–Yinchuan Expressways. ",
        "source": "https://en.wikipedia.org/wiki/Jinan_Yaoqiang_International_Airport"
    },
    "ZSNB": {
        "text": "Ningbo Lishe International Airport (IATA: NGB, ICAO: ZSNB) is an international airport serving Ningbo, a major city in the \nYangtze River Delta region and the second largest city in East China’s Zhejiang province. In 2013, the airport handled 5.4 \nmillion passengers, ranking 36th in China. It was the 29th busiest airport in China in cargo traffic in 2012. ",
        "source": "https://en.wikipedia.org/wiki/Ningbo_Lishe_International_Airport"
    },
    "ZSNJ": {
        "text": "Nanjing Lukou International Airport (IATA: NKG, ICAO: ZSNJ) is an international airport serving Nanjing, the capital of East China’s \nJiangsu province, and a major airport serving the Yangtze River Delta area. As of 2020, it is the 12th busiest \ncivil airport in China, dropping one place from 2019 after being overtaken by Zhengzhou Xinzheng International Airport. It is located \nin the suburban Jiangning District, over 35 km (22 mi) south of the city center, and is connected to Nanjing \nand neighboring towns by expressways. ",
        "source": "https://en.wikipedia.org/wiki/Nanjing_Lukou_International_Airport"
    },
    "ZSPD": {
        "text": "Shanghai Pudong International Airport (IATA: PVG, ICAO: ZSPD) is the main international airport serving Shanghai, the largest city by \npopulation in China, and a major aviation hub of East Asia. Pudong Airport serves both international flights and a smaller \nnumber of domestic flights, while the city's other major airport, Shanghai–Hongqiao, mainly serves domestic and regional flights in East Asia. \nLocated about 30 kilometres (19 mi) east of the city center, Pudong Airport occupies a 40-square-kilometre (10,000-acre) site adjacent to \nthe coastline in eastern Pudong. ",
        "source": "https://en.wikipedia.org/wiki/Shanghai_Pudong_International_Airport"
    },
    "ZSSS": {
        "text": "Shanghai Hongqiao International Airport (IATA: SHA, ICAO: ZSSS) is one of two international airports of Shanghai, the largest city \nby population in China, and a significant airline hub of the country. Hongqiao Airport mainly serves domestic and regional flights, \nalthough the airport also serves select international flights (mainly to Seoul–Gimpo, Taipei–Songshan and Tokyo–Haneda). The airport is located near the \ntown of Hongqiao in the outskirts of Changning and Minhang districts, 13 kilometres (8.1 mi) west of downtown, and is \ncloser to the city center than the area's primary international airport, Shanghai–Pudong. ",
        "source": "https://en.wikipedia.org/wiki/Shanghai_Hongqiao_International_Airport"
    },
    "ZSWZ": {
        "text": "Wenzhou Longwan International Airport (IATA: WNZ, ICAO: ZSWZ) is an airport serving the city of Wenzhou in southern Zhejiang \nProvince, China. Formerly called Wenzhou Yongqiang Airport, it adopted its current name on 25 April 2013. The airport is located \n24 km (15 mi) southeast of the city. ",
        "source": "https://en.wikipedia.org/wiki/Wenzhou_Longwan_International_Airport"
    },
    "ZUCK": {
        "text": "Chongqing Jiangbei International Airport (IATA: CKG, ICAO: ZUCK) is the main international airport serving the city of Chongqing in \nSouthwestern China. It is located in Yubei, Chongqing, about 19 kilometres (12 mi) north of the Chongqing urban center. The \nairport is a major aviation hub for airlines in western China, including China Express Airlines, China Southern Airlines (Chongqing Airlines), \nSichuan Airlines, Shandong Airlines, XiamenAir and West Air. ",
        "source": "https://en.wikipedia.org/wiki/Chongqing_Jiangbei_International_Airport"
    },
    "ZUGY": {
        "text": "Guiyang Longdongbao International Airport (IATA: KWE, ICAO: ZUGY) is an international airport serving Guiyang, the capital of Southwest China’s \nGuizhou province. Guiyang Longdongbao Airport was opened on 28 May 1997 and adopted its current name on 19 January 2006. \nIt is located 11 km (6.8 mi) southeast from Guiyang's city center. ",
        "source": "https://en.wikipedia.org/wiki/Guiyang_Longdongbao_International_Airport"
    },
    "ZUTF": {
        "text": "Chengdu Tianfu International Airport (IATA: TFU, ICAO: ZUTF; abbreviated as Tianfu Airport) is one of two international airports serving \nChengdu, the capital of Sichuan province in Southwestern China. The airport is located at Lujia Town, Jianyang, Chengdu, 51 kilometers \n(32 mi) southeast of Downtown Chengdu. It is named after the Tianfu New Area, a development zone for Chengdu in \nwhich the airport is. ",
        "source": "https://en.wikipedia.org/wiki/Chengdu_Tianfu_International_Airport"
    },
    "ZUUU": {
        "text": "Chengdu Shuangliu International Airport (IATA: CTU, ICAO: ZUUU; traditionally as Chengdu Airport) is one of two international airports serving \nChengdu, the capital of Sichuan province in Southwestern China. It mainly serves domestic flights around China. Located about 16 kilometers \n(10 mi) southwest of downtown Chengdu to the north of Shuangliu district, Shuangliu Airport is an important aviation hub for \nWestern China. ",
        "source": "https://en.wikipedia.org/wiki/Chengdu_Shuangliu_International_Airport"
    },
    "ZWWW": {
        "text": "Ürümqi Diwopu International Airport (IATA: URC, ICAO: ZWWW) is an international airport serving Ürümqi, the capital of Northwest China‘s \nXinjiang Uygur Autonomous Region. It is located in the Diwopu township of Xinshi district, 16 km (9.9 mi) northwest of \ndowntown Ürümqi. As a hub for China Southern Airlines and as a focus city for Hainan Airlines, the airport handled \n23,027,788 passengers in 2018, making it the 19th busiest airport in China by passenger traffic. ",
        "source": "https://en.wikipedia.org/wiki/%C3%9Cr%C3%BCmqi_Diwopu_International_Airport"
    },
    "ZYHB": {
        "text": "Harbin Taiping International Airport (IATA: HRB, ICAO: ZYHB) is an international airport serving Harbin, the capital of Northeast China’s \nHeilongjiang province. The airport handled 20,431,432 passengers in 2018, making it the 20th busiest airport in mainland China. ",
        "source": "https://en.wikipedia.org/wiki/Harbin_Taiping_International_Airport"
    },
    "ZYTL": {
        "text": "Dalian Zhoushuizi International Airport (IATA: DLC, ICAO: ZYTL) is an international airport serving the city of Dalian in Northeast \nChina’s Liaoning province. It is located in Ganjingzi District, about 10 km (6.2 mi) northwest of the city center. In \n2018 the airport handled 18,758,171 passengers, making it the busiest airport in Northeast China and the 24th busiest nationwide. ",
        "source": "https://en.wikipedia.org/wiki/Dalian_Zhoushuizi_International_Airport"
    },
    "ZYTX": {
        "text": "Shenyang Taoxian International Airport (IATA: SHE, ICAO: ZYTX) is an international airport serving Shenyang, the capital of Northeast China’s \nLiaoning province. It is located about 20 km (12 mi) south of the city center in Hunnan District. It is \na focus city for China Southern Airlines and is the 23rd busiest airport in China with 19,027,398 passengers as of \n2018. ",
        "source": "https://en.wikipedia.org/wiki/Shenyang_Taoxian_International_Airport"
    }
}